[
    {
        "description": "Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Th Around the World, continent by continent, here is the best the world has to offer: 1,000 places guaranteed to give travelers the shivers. Sacred ruins, grand hotels, wildlife preserves, hilltop villages, snack shacks, castles, festivals, reefs, restaurants, cathedrals, hidden islands, opera houses, museums, and more. Each entry tells exactly why it's essential to visit. Then come the nuts and bolts: addresses, websites, phone and fax numbers, best times to visit. Stop dreaming and get going.This hefty volume reminds vacationers that hot tourist spots are small percentage of what's worth seeing out there. A quick sampling: Venice's Cipriani Hotel; California's Monterey Peninsula; the Lewis and Clark Trail in Oregon; the Great Wall of China; Robert Louis Stevenson's home in Western Samoa; and the Alhambra in Andalusia, Spain. Veteran travel guide writer Schultz divides the book geographically, presenting a little less than a page on each location. Each entry lists exactly where to find the spot (e.g. Moorea is located \"12 miles/19 km northwest of Tahiti; 10 minutes by air, 1 hour by boat\") and when to go (e.g., if you want to check out The Complete Fly Fisher hotel in Montana, \"May and Sept.-Oct. offer productive angling in a solitary setting\"). This is an excellent resource for the intrepid traveler.Copyright 2003 Reed Business Information, Inc. ...more",
        "title": "1,000 Places to See Before You Die",
        "url": "http://books.toscrape.com/catalogue/category/books/travel_2/index.html"
    },
    {
        "description": "Most business books give you the same old advice: Write a business plan, study the competition, seek investors, yadda yadda. If you're looking for a book like that, put this one back on the shelf.Rework shows you a better, faster, easier way to succeed in business. Read it and you'll know why plans are actually harmful, why you don't need outside investors, and why you're Most business books give you the same old advice: Write a business plan, study the competition, seek investors, yadda yadda. If you're looking for a book like that, put this one back on the shelf.Rework shows you a better, faster, easier way to succeed in business. Read it and you'll know why plans are actually harmful, why you don't need outside investors, and why you're better off ignoring the competition. The truth is, you need less than you think. You don't need to be a workaholic. You don't need to staff up. You don't need to waste time on paperwork or meetings. You don't even need an office. Those are all just excuses.  What you really need to do is stop talking and start working. This book shows you the way. You'll learn how to be more productive, how to get exposure without breaking the bank, and tons more counterintuitive ideas that will inspire and provoke you.With its straightforward language and easy-is-better approach, Rework is the perfect playbook for anyone who’s ever dreamed of doing it on their own. Hardcore entrepreneurs, small-business owners, people stuck in day jobs they hate, victims of \"downsizing,\" and artists who don’t want to starve anymore will all find valuable guidance in these pages. ...more",
        "title": "Rework",
        "url": "http://books.toscrape.com/catalogue/category/books/business_35/index.html"
    },
    {
        "description": "Casey knows the truth.But it won’t set her free.Casey Cox’s DNA is all over the crime scene. There’s no use talking to police; they have failed her abysmally before. She has to flee before she’s arrested . . . or worse. The truth doesn’t matter anymore.But what is the truth? That’s the question haunting Dylan Roberts, the war-weary veteran hired to find Casey. PTSD has mar Casey knows the truth.But it won’t set her free.Casey Cox’s DNA is all over the crime scene. There’s no use talking to police; they have failed her abysmally before. She has to flee before she’s arrested . . . or worse. The truth doesn’t matter anymore.But what is the truth? That’s the question haunting Dylan Roberts, the war-weary veteran hired to find Casey. PTSD has marked him damaged goods, but bringing Casey back can redeem him. Though the crime scene seems to tell the whole story, details of the murder aren’t adding up. Casey Cox doesn’t fit the profile of a killer. But are Dylan’s skewed perceptions keeping him from being objective? If she isn’t guilty, why did she run?Unraveling her past and the evidence that condemns her will take more time than he has, but as Dylan’s damaged soul intersects with hers, he is faced with two choices. The girl who occupies his every thought is a psychopathic killer . . . or a selfless hero. And the truth could be the most deadly weapon yet. ...more",
        "title": "If I Run (If I Run #1)",
        "url": "http://books.toscrape.com/catalogue/category/books/christian-fiction_34/index.html"
    },
    {
        "description": "Although we usually think of technology as something unique to modern times, our ancestors began to create the first technologies millions of years ago in the form of prehistoric tools and weapons. Over time, eight key technologies gradually freed us from the limitations of our animal origins.The fabrication of weapons, the mastery of fire, and the technologies of clothing Although we usually think of technology as something unique to modern times, our ancestors began to create the first technologies millions of years ago in the form of prehistoric tools and weapons. Over time, eight key technologies gradually freed us from the limitations of our animal origins.The fabrication of weapons, the mastery of fire, and the technologies of clothing and shelter radically restructured the human body, enabling us to walk upright, shed our body hair, and migrate out of tropical Africa. Symbolic communication transformed human evolution from a slow biological process into a fast cultural process. The invention of agriculture revolutionized the relationship between humanity and the environment, and the technologies of interaction led to the birth of civilization. Precision machinery spawned the industrial revolution and the rise of nation-states; and in the next metamorphosis, digital technologies may well unite all of humanity for the benefit of future generations.Synthesizing the findings of primatology, paleontology, archeology, history, and anthropology, Richard Currier reinterprets and retells the modern narrative of human evolution that began with the discovery of Lucy and other Australopithecus fossils. But the same forces that allowed us to integrate technology into every aspect of our daily lives have also brought us to the brink of planetary catastrophe. Unbound explains both how we got here and how human society must be transformed again to achieve a sustainable future.Technology: “The deliberate modification of any natural object or substance with forethought to achieve a specific end or to serve a specific purpose.” ...more",
        "title": "Unbound: How Eight Technologies Made Us Human, Transformed Society, and Brought Our World to the Brink",
        "url": "http://books.toscrape.com/catalogue/category/books/history_32/index.html"
    },
    {
        "description": "This fascinating book tells the story of how one museum changed ideas about dinosaurs, dynasties, and even the story of life on earth. The Yale Peabody Museum of Natural History, now celebrating its 150th anniversary, has remade the way we see the world. Delving into the museum’s storied and colorful past, award-winning author Richard Conniff introduces a cast of bold expl This fascinating book tells the story of how one museum changed ideas about dinosaurs, dynasties, and even the story of life on earth. The Yale Peabody Museum of Natural History, now celebrating its 150th anniversary, has remade the way we see the world. Delving into the museum’s storied and colorful past, award-winning author Richard Conniff introduces a cast of bold explorers, roughneck bone hunters, and visionary scientists. Some became famous for wresting Brontosaurus, Triceratops, and other dinosaurs from the earth, others pioneered the introduction of science education in North America, and still others rediscovered the long-buried glory of Machu Picchu.   In this lively tale of events, achievements, and scandals from throughout the museum’s history. Readers will encounter renowned paleontologist O. C. Marsh who engaged in ferocious combat with his “Bone Wars” rival Edward Drinker Cope, as well as dozens of other intriguing characters. Nearly 100 color images portray important figures in the Peabody’s history and special objects from the museum’s 13-million-item collections. For anyone with an interest in exploring, understanding, and protecting the natural world, this book will deliver abundant delights. ...more",
        "title": "House of Lost Worlds: Dinosaurs, Dynasties, and the Story of Life on Earth",
        "url": "http://books.toscrape.com/catalogue/category/books/history_32/index.html"
    },
    {
        "description": "Years ago, when House of Leaves was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth -- musicians, tattoo artists, programme Years ago, when House of Leaves was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth -- musicians, tattoo artists, programmers, strippers, environmentalists, and adrenaline junkies -- the book eventually made its way into the hands of older generations, who not only found themselves in those strangely arranged pages but also discovered a way back into the lives of their estranged children.Now, for the first time, this astonishing novel is made available in book form, complete with the original colored words, vertical footnotes, and newly added second and third appendices.The story remains unchanged, focusing on a young family that moves into a small home on Ash Tree Lane where they discover something is terribly wrong: their house is bigger on the inside than it is on the outside.Of course, neither Pulitzer Prize-winning photojournalist Will Navidson nor his companion Karen Green was prepared to face the consequences of that impossibility, until the day their two little children wandered off and their voices eerily began to return another story -- of creature darkness, of an ever-growing abyss behind a closet door, and of that unholy growl which soon enough would tear through their walls and consume all their dreams. ...more",
        "title": "House of Leaves",
        "url": "http://books.toscrape.com/catalogue/category/books/horror_31/index.html"
    },
    {
        "description": "When unworldly student Anastasia Steele first encountered the driven and dazzling young entrepreneur Christian Grey it sparked a sensual affair that changed both of their lives irrevocably. Shocked, intrigued, and, ultimately, repelled by Christian’s singular erotic tastes, Ana demands a deeper commitment. Determined to keep her, Christian agrees.Now, Ana and Christian hav When unworldly student Anastasia Steele first encountered the driven and dazzling young entrepreneur Christian Grey it sparked a sensual affair that changed both of their lives irrevocably. Shocked, intrigued, and, ultimately, repelled by Christian’s singular erotic tastes, Ana demands a deeper commitment. Determined to keep her, Christian agrees.Now, Ana and Christian have it all—love, passion, intimacy, wealth, and a world of possibilities for their future. But Ana knows that loving her Fifty Shades will not be easy, and that being together will pose challenges that neither of them would anticipate. Ana must somehow learn to share Christian’s opulent lifestyle without sacrificing her own identity. And Christian must overcome his compulsion to control as he wrestles with the demons of a tormented past.Just when it seems that their strength together will eclipse any obstacle, misfortune, malice, and fate conspire to make Ana’s deepest fears turn to reality.This book is intended for mature audiences. ...more",
        "title": "Fifty Shades Freed (Fifty Shades #3)",
        "url": "http://books.toscrape.com/catalogue/category/books/adult-fiction_29/index.html"
    },
    {
        "description": "A new holiday classic--six of the most profound Christmas stories by the author of the bestselling \"Naked\" and \"Barrel Fever\"--is now in a paperback edition perfect for stocking stuffing.",
        "title": "Holidays on Ice",
        "url": "http://books.toscrape.com/catalogue/category/books/humor_30/index.html"
    },
    {
        "description": "A comic and heartwarming memoir about childhood's second act from Real Simple journalist Catherine Newman. Much is written about a child's infancy and toddler years, which is good since children will never remember it themselves. It is ages 4-14 that make up the second act, as Catherine Newman puts it in this delightfully candid, outlandishly funny new memoir about the yea A comic and heartwarming memoir about childhood's second act from Real Simple journalist Catherine Newman. Much is written about a child's infancy and toddler years, which is good since children will never remember it themselves. It is ages 4-14 that make up the second act, as Catherine Newman puts it in this delightfully candid, outlandishly funny new memoir about the years that \"your children will remember as childhood.\" Following Newman's son and daughter as they blossom from preschoolers into teenagers, CATASTROPHIC HAPPINESS is about the bittersweet joy of raising children--and the ever-evolving landscape of issues parents traverse. In a laugh out-loud, heart-wrenching, relatable voice, Newman narrates events as momentous as grief and as quietly moving as the moonlit face of a sleeping child. From tantrums and friendship to fear and even sex, Newman's fresh take will appeal to any parent riding this same roller coaster of laughter and heartbreak. ...more",
        "title": "Catastrophic Happiness: Finding Joy in Childhood's Messy Years",
        "url": "http://books.toscrape.com/catalogue/category/books/parenting_28/index.html"
    },
    {
        "description": "In the highly anticipated Thinking, Fast and Slow, Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think. System 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. Kahneman exposes the extraordinary capabilities—and also the faults and biases—of fast thinking, and reveals t In the highly anticipated Thinking, Fast and Slow, Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think. System 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. Kahneman exposes the extraordinary capabilities—and also the faults and biases—of fast thinking, and reveals the pervasive influence of intuitive impressions on our thoughts and behavior. The impact of loss aversion and overconfidence on corporate strategies, the difficulties of predicting what will make us happy in the future, the challenges of properly framing risks at work and at home, the profound effect of cognitive biases on everything from playing the stock market to planning the next vacation—each of these can be understood only by knowing how the two systems work together to shape our judgments and decisions.Engaging the reader in a lively conversation about how we think, Kahneman reveals where we can and cannot trust our intuitions and how we can tap into the benefits of slow thinking. He offers practical and enlightening insights into how choices are made in both our business and our personal lives—and how we can use different techniques to guard against the mental glitches that often get us into trouble. Thinking, Fast and Slow will transform the way you think about thinking. ...more",
        "title": "Thinking, Fast and Slow",
        "url": "http://books.toscrape.com/catalogue/category/books/psychology_26/index.html"
    },
    {
        "description": "WITH A NEW PREFACE BY THE AUTHORIn her bestselling classic, An Unquiet Mind, Kay Redfield Jamison changed the way we think about moods and madness.Dr. Jamison is one of the foremost authorities on manic-depressive (bipolar) illness;she has also experienced it firsthand. For evenwhile she was pursuing her career in academic medicine, Jamison found herself succumbing to the WITH A NEW PREFACE BY THE AUTHORIn her bestselling classic, An Unquiet Mind, Kay Redfield Jamison changed the way we think about moods and madness.Dr. Jamison is one of the foremost authorities on manic-depressive (bipolar) illness; she has also experienced it firsthand. For even while she was pursuing her career in academic medicine, Jamison found herself succumbing to the same exhilarating highs and catastrophic depressions that afflicted many of her patients, as her disorder launched her into ruinous spending sprees, episodes of violence, and an attempted suicide.Here Jamison examines bipolar illness from the dual perspectives of the healer and the healed, revealing both its terrors and the cruel allure that at times prompted her to resist taking medication. An Unquiet Mind is a memoir of enormous candor, vividness, and wisdom—a deeply powerful book that has both transformed and saved lives. ...more",
        "title": "An Unquiet Mind: A Memoir of Moods and Madness",
        "url": "http://books.toscrape.com/catalogue/category/books/psychology_26/index.html"
    },
    {
        "description": "\"This is a book about making art. Ordinary art. Ordinary art means something like: all art not made by Mozart. After all, art is rarely made by Mozart-like people; essentially—statistically speaking—there aren't any people like that. Geniuses get made once-a-century or so, yet good art gets made all the time, so to equate the making of art with the workings of genius remov \"This is a book about making art. Ordinary art. Ordinary art means something like: all art not made by Mozart. After all, art is rarely made by Mozart-like people; essentially—statistically speaking—there aren't any people like that. Geniuses get made once-a-century or so, yet good art gets made all the time, so to equate the making of art with the workings of genius removes this intimately human activity to a strangely unreachable and unknowable place. For all practical purposes making art can be examined in great detail without ever getting entangled in the very remote problems of genius.\"—-from the IntroductionArt & Fear explores the way art gets made, the reasons it often doesn't get made, and the nature of the difficulties that cause so many artists to give up along the way. The book's co-authors, David Bayles and Ted Orland, are themselves both working artists, grappling daily with the problems of making art in the real world. Their insights and observations, drawn from personal experience, provide an incisive view into the world of art as it is expeienced by artmakers themselves.This is not your typical self-help book. This is a book written by artists, for artists -— it's about what it feels like when artists sit down at their easel or keyboard, in their studio or performance space, trying to do the work they need to do. First published in 1994, Art & Fear quickly became an underground classic. Word-of-mouth response alone—now enhanced by internet posting—has placed it among the best-selling books on artmaking and creativity nationally.Art & Fear has attracted a remarkably diverse audience, ranging from beginning to accomplished artists in every medium, and including an exceptional concentration among students and teachers. The original Capra Press edition of Art & Fear sold 80,000 copies.An excerpt:Today, more than it was however many years ago, art is hard because you have to keep after it so consistently. On so many different fronts. For so little external reward. Artists become veteran artists only by making peace not just with themselves, but with a huge range of issues. You have to find your work... ...more",
        "title": "Art and Fear: Observations on the Perils (and Rewards) of Artmaking",
        "url": "http://books.toscrape.com/catalogue/category/books/art_25/index.html"
    },
    {
        "description": "Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an insightful Introduction by Cristina Garcia. More than eighty years after its publication, Twenty Love Poems and a Song of Despair stands as an essential collection that continues to inspire lovers and poets around the world. ...more",
        "title": "Twenty Love Poems and a Song of Despair",
        "url": "http://books.toscrape.com/catalogue/category/books/poetry_23/index.html"
    },
    {
        "description": "Like lightning/you strike/fast and free/legs zoom/down field/eyes fixed/on the checkered ball/on the goal/ten yards to go/can’t nobody stop you/can’t nobody cop you… In this follow-up to the Newbery-winning novel THE CROSSOVER, soccer, family, love, and friendship, take center stage as twelve-year-old Nick learns the power of words as he wrestles with problems at home, sta Like lightning/you strike/fast and free/legs zoom/down field/eyes fixed/on the checkered ball/on the goal/ten yards to go/can’t nobody stop you/can’t nobody cop you… In this follow-up to the Newbery-winning novel THE CROSSOVER,  soccer, family, love, and friendship, take center stage as twelve-year-old Nick learns the power of words as he wrestles with problems at home, stands up to a bully, and tries to impress the girl of his dreams. Helping him along are his best friend and sometimes teammate Coby, and The Mac, a rapping librarian who gives Nick inspiring books to read.   This electric and heartfelt novel-in-verse by poet Kwame Alexander bends and breaks as it captures all the thrills and setbacks, action and emotion of a World Cup match! ...more",
        "title": "Booked",
        "url": "http://books.toscrape.com/catalogue/category/books/poetry_23/index.html"
    },
    {
        "description": "The enchantment continues....The universe of the Lunar Chronicles holds stories—and secrets—that are wondrous, vicious, and romantic. How did Cinder first arrive in New Beijing? How did the brooding soldier Wolf transform from young man to killer? When did Princess Winter and the palace guard Jacin realize their destinies?With nine stories—five of which have never before b The enchantment continues....The universe of the Lunar Chronicles holds stories—and secrets—that are wondrous, vicious, and romantic. How did Cinder first arrive in New Beijing? How did the brooding soldier Wolf transform from young man to killer? When did Princess Winter and the palace guard Jacin realize their destinies?With nine stories—five of which have never before been published—and an exclusive never-before-seen excerpt from Marissa Meyer’s upcoming novel, Heartless, about the Queen of Hearts from Alice in Wonderland, Stars Above is essential for fans of the bestselling and beloved Lunar Chronicles.--The Little Android: A retelling of Hans Christian Andersen’s “The Little Mermaid,” set in the world of The Lunar Chronicles.Glitches: In this prequel to Cinder, we see the results of the plague play out, and the emotional toll it takes on Cinder. Something that may, or may not, be a glitch….The Queen’s Army: In this prequel to Scarlet, we’re introduced to the army Queen Levana is building, and one soldier in particular who will do anything to keep from becoming the monster they want him to be.Carswell’s Guide to Being Lucky: Thirteen-year-old Carswell Thorne has big plans involving a Rampion spaceship and a no-return trip out of Los Angeles.The Keeper: A prequel to the Lunar Chronicles, showing a young Scarlet and how Princess Selene came into the care of Michelle Benoit.After Sunshine Passes By: In this prequel to Cress, we see how a nine-year-old Cress ended up alone on a satellite, spying on Earth for Luna.The Princess and the Guard: In this prequel to Winter, we see a game called The PrincessThe Mechanic: In this prequel to Cinder, we see Kai and Cinder’s first meeting from Kai’s perspective.Something Old, Something New: In this epilogue to Winter, friends gather for the wedding of the century... ...more",
        "title": "Stars Above (The Lunar Chronicles #4.5)",
        "url": "http://books.toscrape.com/catalogue/category/books/young-adult_21/index.html"
    },
    {
        "description": "The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, you’d like to get to know Grace better.But it’s difficult, because you realise Jack and Grace are never apart.Some The 2016 debut bloggers can't stop raving about. Perfect for fans of The Girl on the Train and The Ice Twins Everyone knows a couple like Jack and Grace.He has looks and wealth, she has charm and elegance. You might not want to like them, but you do. Though, you’d like to get to know Grace better.But it’s difficult, because you realise Jack and Grace are never apart.Some might call this true love. Others might ask why Grace never answers the phone. Or how she can never meet for coffee, even though she doesn’t work. How she can cook such elaborate meals but remain so slim. And why there are bars on one of the bedroom windows.Sometimes, the perfect marriage is the perfect lie. ...more",
        "title": "Behind Closed Doors",
        "url": "http://books.toscrape.com/catalogue/page-2.html"
    },
    {
        "description": "In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And i In a dark, dark wood Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. There was a dark, dark houseUntil, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?And in the dark, dark house there was a dark, dark roomBut something goes wrong. Very wrong.And in the dark, dark room.... Some things can’t stay secret for ever. ...more",
        "title": "In a Dark, Dark Wood",
        "url": "http://books.toscrape.com/catalogue/page-2.html"
    },
    {
        "description": "Features: Over 900 new recipes -- 1,200 in all-reflect current eating habits and lifestyles; 500 new photographs -- over 700 in all-including 60 percent more of finished food than the last edition; Dozens of new recipes offer ethnic flavours, fresh ingredients, or vegetarian appeal; Many recipes feature make-ahead directions or quick-to-the-table meals; New chapter provide Features: Over 900 new recipes -- 1,200 in all-reflect current eating habits and lifestyles; 500 new photographs -- over 700 in all-including 60 percent more of finished food than the last edition; Dozens of new recipes offer ethnic flavours, fresh ingredients, or vegetarian appeal; Many recipes feature make-ahead directions or quick-to-the-table meals; New chapter provides recipes for crockery cookers; Efficient, easy-to-read format, with recipes categorised into 21 chapters, each thoroughly indexed for easy reference; Expanded chapter on cooking basics includes advice on food safety, menu planning, table setting, and make-ahead cooking, plus a thorough glossary on ingredients and techniques; Appliance-friendly recipes help cooks save time and creatively use new kitchen tools; Nutrition information with each recipe, plus diabetic exchanges; Contemporary food photography attracts browsers and helps cooks discover new recipes to make; Icons identify low-fat, no-fat, fast, and best-loved recipes; Every recipe tested and perfected by the Better Homes and Gardens Test Kitchen; Revised and updated cooking charts, ingredient photos, emergency substitutions, and equivalents; Respected, reliable kitchen reference with hundreds of cooking terms, tips, and techniques. ...more",
        "title": "Better Homes and Gardens New Cook Book",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "The instant New York Times and USA Today bestsellerHungry Girl Clean & Hungry: Healthy Recipes for Clean Eating in the Real WorldComplete with full-color photos of EVERY recipe, Hungry Girl Clean & Hungry combines the best of Hungry Girl with the best of clean eating. The food is still guilt-free, and the portions are still huge...but now Lisa Lillien is highlighti The instant New York Times and USA Today bestsellerHungry Girl Clean & Hungry: Healthy Recipes for Clean Eating in the Real WorldComplete with full-color photos of EVERY recipe, Hungry Girl Clean & Hungry combines the best of Hungry Girl with the best of clean eating. The food is still guilt-free, and the portions are still huge...but now Lisa Lillien is highlighting CLEAN ingredients and doing away with artificial and processed foods. This book gives mainstream America delicious, satisfying, and clean recipes, using healthy ingredients found in supermarkets everywhere. The best part? The recipes are so easy, anyone can make 'em!Featuring...90 vegetarian recipes108 gluten-free recipes56 recipes in 30 minutes or less43 recipes with 5 ingredients or lessRecipes like...PB&J Waffles (203 calories)BBQ Meatloaf (196 calories)Hawaiian Shrimp Fried Rice with Pineapple (229 calories)Fudgy Flourless Chocolate Cake (100 calories)Finally... a real-world (and DELICIOUS) approach to clean eating! ...more",
        "title": "Hungry Girl Clean & Hungry: Easy All-Natural Recipes for Healthy Eating in the Real World",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "Perhaps more responsible than anyone for the revolution in the way we eat, cook, and think about food, Alice Waters has “single-handedly chang[ed] the American palate” according to the New York Times. Her simple but inventive dishes focus on a passion for flavor and a reverence for locally produced, seasonal foods.With an essential repertoire of timeless, approachable reci Perhaps more responsible than anyone for the revolution in the way we eat, cook, and think about food, Alice Waters has “single-handedly chang[ed] the American palate” according to the New York Times. Her simple but inventive dishes focus on a passion for flavor and a reverence for locally produced, seasonal foods.With an essential repertoire of timeless, approachable recipes chosen to enhance and showcase great ingredients, The Art of Simple Food is an indispensable resource for home cooks. Here you will find Alice’s philosophy on everything from stocking your kitchen, to mastering fundamentals and preparing delicious, seasonal inspired meals all year long. Always true to her philosophy that a perfect meal is one that’s balanced in texture, color, and flavor, Waters helps us embrace the seasons’ bounty and make the best choices when selecting ingredients. Fill your market basket with pristine produce, healthful grains, and responsibly raised meat, poultry, and seafood, then embark on a voyage of culinary rediscovery that reminds us that the most gratifying dish is often the least complex. ...more",
        "title": "The Art of Simple Food: Notes, Lessons, and Recipes from a Delicious Revolution",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "The long-awaited cookbook by Deb Perelman of Smitten Kitchen—home cook, mom, photographer, and celebrated food blogger.Deb Perelman loves to cook. It’s as simple as that. She isn’t a chef or a restaurant owner—she’s never even waitressed. Cooking in her tiny Manhattan kitchen was, at least at first, for special occasions—and, too often, an unnecessarily daunting venture. D The long-awaited cookbook by Deb Perelman of Smitten Kitchen—home cook, mom, photographer, and celebrated food blogger.Deb Perelman loves to cook. It’s as simple as that. She isn’t a chef or a restaurant owner—she’s never even waitressed. Cooking in her tiny Manhattan kitchen was, at least at first, for special occasions—and, too often, an unnecessarily daunting venture. Deb found herself overwhelmed by the number of recipes available to her. Have you ever searched for the perfect birthday cake on Google? You’ll get more than three million results. How do you choose? Where do you start? What if you pick a recipe that’s downright bad?So Deb founded her award-winning blog, smittenkitchen.com, on the premise that cooking should be a pleasure, and that the results of your labor can—and should be—delicious...every time. Deb is a firm believer that there are no bad cooks, just bad recipes. She has dedicated herself to finding the best of the best and adapting them for the everyday cook—the ones with little time to spare, little money to burn on unpronounceable ingredients, and little help in the kitchen. And now, with the same warmth, candor, and can-do spirit her blog is known for, Deb presents her first cookbook—more than 100 new recipes, plus a few favorites from her site, all gorgeously illustrated with hundreds of Deb’s beautiful color photographs.The Smitten Kitchen Cookbook is all about approachable, uncompromised home cooking: stepped-up comfort foods, stewy dishes for windy winter afternoons, an apple cake that will answer all questions: “What should my new signature dessert be?” “What is always welcome at a potluck?” “What did Deb consume almost single-handedly a week after having a baby?” These are the recipes you bookmark and use so often they become your own; recipes you slip to a friend who wants to impress her new in-laws; and recipes with simple ingredients that yield amazing results in a minimum amount of time. Deb tells you how to host a brunch and still sleep in—plus what to make for it!—and the essential items you need for your own kitchen. From salads and slaws that make perfect side dishes (or a full meal) to savory tarts and pizzas; from Mushroom Bourguignon to Pancetta, White Bean and Swiss Chard Pot Pies; from Buttered Popcorn Cookies to Chocolate Hazelnut Layer Cake, Deb knows just the thing for a Tuesday night, or your most special occasion. ...more",
        "title": "The Smitten Kitchen Cookbook",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "For years, Anna Thomas’s fans have cooked from her trailblazing vegetarian cookbooks. Now, Anna turns her thoughts to that larger question. We are eating differently: your daughter is a vegan, or you are but your in-laws don’t think it’s dinner without meat, or you’re hosting Thanksgiving for a mixed group… In this timely and useful new book, Anna offers her solutions for For years, Anna Thomas’s fans have cooked from her trailblazing vegetarian cookbooks. Now, Anna turns her thoughts to that larger question. We are eating differently: your daughter is a vegan, or you are but your in-laws don’t think it’s dinner without meat, or you’re hosting Thanksgiving for a mixed group… In this timely and useful new book, Anna offers her solutions for reuniting our divided tables.“My idea is simple,” says Anna. “Start with the food everyone eats, design a meal or a dish around that, then expand and elaborate with just the right amounts of the right cheeses, meats, or fish for your omnivores. Everyone feels welcome, and we eat the same meal—but in variations.”Anna shows us how to cook for today’s table, with over 150 recipes for all tastes, and menus for every occasion. For a casual evening with friends, Farro with Lentils and Lavender served with Ratatouille from the Charcoal Grill makes a beautiful vegan supper—and also pairs wonderfully with garlic-and-herb rubbed lamb chops for the omnivores. Anna’s crowd-pleasing Easy Fish Soup begins as a robust vegetable soup, with seafood added five minutes before serving—an ideal two-way dish. A vegetarian Lemon Risotto with Sautéed Fresh Fava Beans is perfect on its own, and can easily take on tender shrimp. For dessert, have vegan Pumpkin Gingerbread and add vanilla ice cream, or serve a delectable Dark Chocolate Almond Bark studded with ginger and dried cherries.Anna’s festive “Thanksgiving for Everyone” menu centers on a sumptuous Polenta Torta with Roasted Squash and onion marmalade, surrounded by an array of seasonal vegetables—all pairing equally well with roast turkey for the traditionalists. “Taco Night at Home” allows everyone to design their perfect meal, mixing and matching from a spread of Spicy Black Beans, Poblano Peppers with Portobello Mushrooms, Carnitas, and Guajillo Chile Salsa. Anna’s exuberant Mediterranean mezze menu is a relaxed summer party, featuring vegan Roasted Eggplant and Poblano Chile Spread with flatbread, Tabbouleh with Chickpeas and Preserved Lemon, Charred Zucchini with Lemon and Mint, and Baked Lamb Kibbeh Wedges for the omnivores.With dishes inspired by the vibrant produce of farmers’ markets, Anna shares her love of cooking and of hospitality. Vegan Vegetarian Omnivore shows us how to navigate a world of change, and bring all our friends and family together at one big, generous table. ...more",
        "title": "Vegan Vegetarian Omnivore: Dinner for Everyone at the Table",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "Intriguing recipes for everyday meals from the host of the PBS series Pati’s Mexican Table On her PBS TV series, now in its fifth season, as well as in frequent appearances on shows like The Chew, Pati Jinich, a busy mother of three, has shown a flair for making Mexican cooking irresistibly accessible. In Mexican Today, she shares easy, generous dishes, both traditional on Intriguing recipes for everyday meals from the host of the PBS series Pati’s Mexican Table On her PBS TV series, now in its fifth season, as well as in frequent appearances on shows like The Chew, Pati Jinich, a busy mother of three, has shown a flair for making Mexican cooking irresistibly accessible. In Mexican Today, she shares easy, generous dishes, both traditional ones and her own new spins. Some are regional recipes she has recovered from the past and updated, like Miners’ Enchiladas with fresh vegetables and cheese or Drunken Rice with Chicken and Chorizo, a specialty of the Yucatán. “Sweaty” Tacos with ripe tomatoes and cheese are so convenient they’re sold on Mexican streets by bicyclists. Her grandmother’s Cornflake Cookies feel just as contemporary now as they did then.  Pati has “Mexed up” other recipes in such family favorites as Mexican Pizza with Grilled Skirt Steak and Onions. Still other dishes show the evolution of Mexican food north and south of the border, including Mexican Dreamboat Hotdogs and Cal-Mex Fish Tacos with Creamy Slaw. This food will draw everyone together—a family at the end of a working day, a book club, or a neighborhood potluck.  Throughout, Pati is an infectious cheerleader, sharing stores of the food, people, and places behind the recipes. ...more",
        "title": "Mexican Today: New and Rediscovered Recipes for Contemporary Kitchens",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "The Power Greens Cookbook presents 140 delicious, healthy recipes for dark, leafy greens that will please your palate and inspire you to clean your plate.Kale and collards don’t have to be the only greens on your shopping list anymore. Rising stars include romaine and parsley, Brussels sprouts and beet greens, and more. But say the words “Eat your greens,” and even though The Power Greens Cookbook presents 140 delicious, healthy recipes for dark, leafy greens that will please your palate and inspire you to clean your plate. Kale and collards don’t have to be the only greens on your shopping list anymore. Rising stars include romaine and parsley, Brussels sprouts and beet greens, and more. But say the words “Eat your greens,” and even though we know they’re good for us, many people are afraid that they won’t taste good. Fear no more! The Power Greens Cookbook provides go-to recipes that are both nutritious and delicious.   Acclaimed cookbook author and blogger Dana Jacobi expands your culinary repertoire and introduces the fifteen Power Greens—from arugula to watercress—that are loaded with health-supporting nutrients and phytochemicals that enhance vitality, all the while protecting against diabetes, heart disease, and high blood pressure, fortifying eyes and muscles, even making your skin glow. Jacobi also shares simple cooking techniques that help you prepare these super veggies quickly. Including main dishes and hearty salads, dips, spreads, snacks, and even drinks, The Power Greens Cookbook offers myriad mouthwatering vegetable-centric recipes.  • Soups: Cabbage and Brussels Sprouts Soup, Spinach Gazpacho with Walnuts, Hoppin’ John Stew with Mustard Greens• Salads: Caesar Salad with Parmesan Chickpeas, Tuscan Kale Salad with Pomegranate Seeds and Walnuts, Beets and Beet Greens with Citrus Dressing• Main Dishes: Red Beans and Smoky Greens, Kale-Smothered Pork Chops with Carrot and Apple, Tortelloni with Broccoli Rabe Florets• Small Meals and Snacks: Avocado and Watercress Tartine, Grilled Cheese and Tomato Sandwich with Kimchi, Poached Eggs in a Nest of Bacon-Wilted Kale• Side Dishes and Condiments: Carrots with Wild Arugula Pesto, French Lettuce Stir-Fry, Tahini Creamed Spinach, Kale Za’atar  Shown in dozens of tantalizing photographs, these dishes are sure to become mainstays in your kitchen for weeknight family meals, casual entertaining, and elegant dinner parties. From the cruciferous and crunchy to the leafy and light, The Power Greens Cookbook is just what the doctor—and your taste buds—ordered. ...more",
        "title": "The Power Greens Cookbook: 140 Delicious Superfood Recipes",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "For more than twenty years, Barefoot Contessa, the acclaimed specialty food store, has been cooking and baking extraordinary dishes for enthusiastic customers in the Hamptons. For many of those years, people have tried to get the exuberant owner, Ina Garten, to share the secrets of her store. Finally, the energy and style that make Barefoot Contessa such a special place ar For more than twenty years, Barefoot Contessa, the acclaimed specialty food store, has been cooking and baking extraordinary dishes for enthusiastic customers in the Hamptons. For many of those years, people have tried to get the exuberant owner, Ina Garten, to share the secrets of her store. Finally, the energy and style that make Barefoot Contessa such a special place are shown here, with dozens of recipes and more than 160 breathtaking photographs, in The Barefoot Contessa Cookbook.Ina's most popular recipes use familiar ingredients, but they taste even better than you would expect. Her Pan-Fried Onion Dip is the real thing, with slowly car-amelized onions and fresh sour cream. Tomato soup is created from oven-roasted tomatoes and fresh basil to intensify the flavors. Meat loaf is as good as your grandmother's, but it's healthier because it's made with ground turkey and fresh herbs. The light and flaky Maple-Oatmeal Scones are baked with rolled oats, whole wheat, and real maple syrup. Now these and other famous Barefoot Contessa recipes can be prepared at home.Ina says that before she owned a specialty food store she often spent a week making dinner for six friends. Her experience at Barefoot Contessa has given her hundreds of ideas for creating wonderful parties in a few hours. And they're all in this book. Crab Cakes with Rémoulade Sauce can be stored overnight in the refrigerator and sautéed just before the guests arrive. Cheddar Corn Chowder can be made days ahead, reheated, and served with a salad and bread for a delicious autumn lunch. The ingredients for Grilled Salmon Salad can all be prepared ahead and tossed together before serving. The batter for the Raspberry Corn Muffins can be mixed a day before and popped into the oven just before breakfast.Ina Garten teaches us how to entertain with style, simplicity, and a relaxed sense of fun. There are notes throughout the book for giving cocktail parties, lunches, and dinner parties where everything is done before the guests arrive. And there are easy instructions for creating gorgeous party platters that don't even require you to cook!With Ina Garten and The Barefoot Contessa Cookbook, you have the perfect recipe for hosting parties that are easy and fun for everyone--including the cook. ...more",
        "title": "The Barefoot Contessa Cookbook",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "Nigella Lawson's How to Be a Domestic Goddess is about not only baking, but the enjoyment of being in the kitchen, taking sensuous pleasure in the entire process, and relishing the outcome. Nigella's deliciously reassuring and mouthwatering cookbook demonstrates that it's not terribly difficult to bake a batch of muffins or a layer cake, but the appreciation and satisfacti Nigella Lawson's How to Be a Domestic Goddess is about not only baking, but the enjoyment of being in the kitchen, taking sensuous pleasure in the entire process, and relishing the outcome. Nigella's deliciously reassuring and mouthwatering cookbook demonstrates that it's not terribly difficult to bake a batch of muffins or a layer cake, but the appreciation and satisfaction they bring are disproportionately high. At last, a book that understands our anxieties, feeds our fantasies, and puts cakes, pies, pastries, breads, and biscuits back into our own kitchens. ...more",
        "title": "How to Be a Domestic Goddess: Baking and the Art of Comfort Cooking",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "The ultimate one-stop vegetarian cookbook-from the author of the classic How to Cook EverythingHailed as \"a more hip Joy of Cooking\" by the Washington Post, Mark Bittman's award-winning book How to Cook Everything has become the bible for a new generation of home cooks, and the series has more than 1 million copies in print. Now, with How to Cook Everything: Vegetarian, Bi The ultimate one-stop vegetarian cookbook-from the author of the classic How to Cook EverythingHailed as \"a more hip Joy of Cooking\" by the Washington Post, Mark Bittman's award-winning book How to Cook Everything has become the bible for a new generation of home cooks, and the series has more than 1 million copies in print. Now, with How to Cook Everything: Vegetarian, Bittman has written the definitive guide to meatless meals-a book that will appeal to everyone who wants to cook simple but delicious meatless dishes, from health-conscious omnivores to passionate vegetarians.How to Cook Everything: Vegetarian includes more than 2,000 recipes and variations-far more than any other vegetarian cookbook. As always, Bittman's recipes are refreshingly straightforward, resolutely unfussy, and unfailingly delicious-producing dishes that home cooks can prepare with ease and serve with confidence. The book covers the whole spectrum of meatless cooking-including salads, soups, eggs and dairy, vegetables and fruit, pasta, grains, legumes, tofu and other meat substitutes, breads, condiments, desserts, and beverages. Special icons identify recipes that can be made in 30 minutes or less and in advance, as well as those that are vegan. Illustrated throughout with handsome line illustrations and brimming with Bittman's lucid, opinionated advice on everything from selecting vegetables to preparing pad Thai, How to Cook Everything: Vegetarian truly makes meatless cooking more accessible than ever.Praise for How to Cook Everything Vegetarian\"Mark Bittman's category lock on definitive, massive food tomes continues with this well-thought-out ode to the garden and beyond. Combining deep research, tasty information, and delicious easy-to-cook recipes is Mark's forte and everything I want to cook is in here, from chickpea fries to cheese soufflés.\"—Mario Batali, chef, author, and entrepreneur\"How do you make an avid meat eater (like me) fall in love with vegetarian cooking? Make Mark Bittman's How to Cook Everything Vegetarian part of your culinary library.\"—Bobby Flay, chef/owner of Mesa Grill and Bar Americain and author of the Mesa Grill Cookbook\"Recipes that taste this good aren't supposed to be so healthy. Mark Bittman makes being a vegetarian fun.\"—Dr. Mehmet Oz, Professor of Surgery, New York-Presbyterian/Columbia Medical Center and coauthor of You: The Owner's Manual ...more",
        "title": "How to Cook Everything Vegetarian: Simple Meatless Recipes for Great Food (How to Cook Everything)",
        "url": "http://books.toscrape.com/catalogue/category/books/food-and-drink_33/page-2.html"
    },
    {
        "description": "This new edition of Maude (1883-1993) has been updated by Mardo Williams’ daughters, adding historical details their dad wished to make, twice as many photos, and nine appendices not present in the 1996 hardcover (which won an Ohioana Library Award for its author). During her 110-year lifetime, Maude went from a 400-lb. wood-burning stove to a microwave oven, from an outdo This new edition of Maude (1883-1993) has been updated by Mardo Williams’ daughters, adding historical details their dad wished to make, twice as many photos, and nine appendices not present in the 1996 hardcover (which won an Ohioana Library Award for its author). During her 110-year lifetime, Maude went from a 400-lb. wood-burning stove to a microwave oven, from an outdoor privy to indoor plumbing. She got the vote in 1920 and voted in the next 18 Presidential elections.With poetry and human dramas (two murders and a suicide), written by a master journalist, the book shows the impact of the changing times on shy, unassuming Maude, her fun-loving husband Lee, and their four active children. They farmed 100 acres on the banks of Rush Creek in Logan County (Ohio).A favorite with book discussion groups, Maude has been adopted by several colleges for use as a supplemental American history text. ...more",
        "title": "Maude (1883-1993):She Grew Up with the country",
        "url": "http://books.toscrape.com/catalogue/page-2.html"
    },
    {
        "description": "Sent to yet another foster family, Penny decides that the way to claim a sense of self is to swim Lake Ontario. Although this seems impossible, she finds the courage to ask her physics teacher to be her coach, and wins the support of her new foster mother.",
        "title": "Penny Maybe",
        "url": "http://books.toscrape.com/catalogue/page-2.html"
    },
    {
        "description": "A page-turning novel that is also an exploration of the great philosophical concepts of Western thought, Sophie’s World has fired the imagination of readers all over the world, with more than twenty million copies in print.One day fourteen-year-old Sophie Amundsen comes home from school to find in her mailbox two notes, with one question on each: “Who are you?” and “Where A page-turning novel that is also an exploration of the great philosophical concepts of Western thought, Sophie’s World has fired the imagination of readers all over the world, with more than twenty million copies in print.One day fourteen-year-old Sophie Amundsen comes home from school to find in her mailbox two notes, with one question on each: “Who are you?” and “Where does the world come from?” From that irresistible beginning, Sophie becomes obsessed with questions that take her far beyond what she knows of her Norwegian village. Through those letters, she enrolls in a kind of correspondence course, covering Socrates to Sartre, with a mysterious philosopher, while receiving letters addressed to another girl. Who is Hilde? And why does her mail keep turning up? To unravel this riddle, Sophie must use the philosophy she is learning—but the truth turns out to be far more complicated than she could have imagined. ...more",
        "title": "Sophie's World",
        "url": "http://books.toscrape.com/catalogue/page-2.html"
    },
    {
        "description": "One day, a young bear stumbles upon something he has never seen before in the forest. As time passes, he teaches himself how to play the strange instrument, and eventually the beautiful sounds are heard by a father and son who are picnicking in the woods. The bear goes with them on an incredible journey to New York, where his piano playing makes him a huge star. He has fam One day, a young bear stumbles upon something he has never seen before in the forest. As time passes, he teaches himself how to play the strange instrument, and eventually the beautiful sounds are heard by a father and son who are picnicking in the woods. The bear goes with them on an incredible journey to New York, where his piano playing makes him a huge star. He has fame, fortune and all the music in the world, but he misses the friends and family he has left behind. A moving tale of exploration and belonging from an exciting debut author-illustrator. ...more",
        "title": "The Bear and the Piano",
        "url": "http://books.toscrape.com/catalogue/page-2.html"
    },
    {
        "description": "Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time dr Mark Fallon is an overworked detective investigating a spate of attacks at a string of high profile city centre nightclubs. Scott is a dejected 24 year old struggling to make ends meet working for his brother and supplementing his income with a small-scale drug dealing operation. Angela is an attractive 23 year old, raised by her father, a career criminal and small time drug dealer who supplies Scott with cannabis. This is a chilling tale spanning a few months in the lives of Scott and Angela, where realizations about the present combine with shocking revelations from the past leading to an apocalyptic climax where they no longer know whom they can trust. ...more",
        "title": "The Elephant Tree",
        "url": "http://books.toscrape.com/catalogue/page-2.html"
    },
    {
        "description": "A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't sp A simple task, Attorney Chester Morgan thinks. Get a copy of a public record for a young man whose only friend has died in an unexplained accidental death. Except... The police file regarding the demise of sex worker Tanya Everly has been sealed by the order of the chief of police, and no one will talk. Warned to drop the matter, Attorney Morgan knows that if he doesn't speak for the dead young woman, no one will. Haunted by his discovery of the body of a prominent local oilman, Morgan pursues a quest for justice that puts his reputation, career, and life at risk. A journey that takes him into the dark shadows of the sex-for-sale business, into the marble courtrooms of Oklahoma, and into the aching loneliness of his own soul. Set in the American Southwest in the days before 9/11, The Past Never Ends is both a complex murder mystery and a meditation on the self-perpetuating nature of injustice and the ethereal nature of justice itself. ...more",
        "title": "The Past Never Ends",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "A princess and a peasant girl must embark on a dangerous quest to outwit a centuries-old warning foretelling the fall of the Monarchy in this modern fairytale. In the center of the verdant Monarchy lies Dreadwillow Carse, a black and desolate bog that the happy people of the land do their best to ignore. Little is known about it, except for one dire warning: If any monarc A princess and a peasant girl must embark on a dangerous quest to outwit a centuries-old warning foretelling the fall of the Monarchy in this modern fairytale.   In the center of the verdant Monarchy lies Dreadwillow Carse, a black and desolate bog that the happy people of the land do their best to ignore. Little is known about it, except for one dire warning: If any monarch enters Dreadwillow Carse, then the Monarchy will fall. Twelve-year-old Princess Jeniah yearns to know what the marsh could possibly conceal that might topple her family’s thousand-year reign of peace and prosperity. Meanwhile, in the nearby town of Emberfell, where everyone lives with unending joy, a girl named Aon hides a sorrow she can never reveal. She knows that something in the carse--something that sings a haunting tune only Aon can hear--holds the cure for her sadness. Yet no matter how many times she tries to enter, the terror-inducing dreadwillow trees keep her away. After a chance meeting, Princess Jeniah and Aon hatch a plan to send Aon into the heart of the carse to unlock its darkest secret. But when Aon doesn’t return, a guilt-stricken Jeniah must enter the carse to try and rescue her friend--even if it means risking the entire Monarchy. ...more",
        "title": "The Secret of Dreadwillow Carse",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "Andrea Harding is a recent college graduate looking forward to attending Duke Law School when her world is turned upside down by the shooting of her father, Nicholas, and uncle, Michael, in a surprising and puzzling attack. They are the only family she has, aside from her paternal grandmother Dorothy, so when her uncle dies from the attack and her father lays comatose in I Andrea Harding is a recent college graduate looking forward to attending Duke Law School when her world is turned upside down by the shooting of her father, Nicholas, and uncle, Michael, in a surprising and puzzling attack. They are the only family she has, aside from her paternal grandmother Dorothy, so when her uncle dies from the attack and her father lays comatose in ICU, it falls to Andrea to not only investigate who would want to kill her father and uncle, but also to oversee Harding Industries, the family company. When her father’s longtime attorney and one of a handful of family friends, Beth Cowling, rushes to help Andrea long distance, the youngest Harding soon finds herself surrounded by a bevy of intriguing new friends and helpers. First to arrive is Beth’s own daughter, Riva, acting as Andrea’s attorney after Andrea is violently attacked in her father’s home, where she grew up, forcing her to kill both would-be assassins. When Nicholas’s on again/off again lover, state prosecutor and gubernatorial hopeful Kerry Marcus, is equally at a loss to name suspects in the Harding family attacks, Riva begins her own investigation into the short list of family friends and colleagues, including Don Marshall, former colleague of Nicholas’s at Marshall Pharmaceutical, which Don now runs, and Don’s wife Karen. Marshall has a shady past, including an incident at his company that also involved Andrea’s father. She also looks closely at Marcus Ricci, father of Andrea’s closest high school friend, Jason. After Jason’s death from leukemia, Ricci becomes like a second father to Andrea. Ricci is also widely believed to have ties to the New Jersey mob. But Beth has another contact she wants involved in the investigation, Deirdre Southington, daughter of Beth’s old friend Cordelia Southington. The Southington family has more money than God, as well as, through Deirdre, more contacts in the intriguing world of international espionage. A former NSA agent, Deirdre is mysterious and beautiful in a cold way. An eccentric who travels via private rail car, she is also extraordinarily persuasive, holding a PhD in forensic psychology that she has put to great use in both her work with the NSA and on her own, as a defender of good, rooting out evil doers and ensuring they are brought to her own brand of justice. Andrea, Riva, and Deirdre all also cast a suspicious eye on the Oakes brothers, Carlton and Jefferson, who run Oakes Industries along with their silent partner and cousin, New Jersey state senator Schuyler Colfax, who also has his eye on the governor’s seat. Oakes Industries has recently made an attempt to purchase Harding Industries, a seemingly irrational move that is rebuffed by Nicholas. What no one knows until much later is that the Oakes brothers have entered into a business deal with Russian mobster Viktor Roman, who represents the real party interested in acquiring Harding Industries, a Vor, Russian organized crime unit, with heavy international interests in the energy sector. Andrea matures quickly as she rapidly learns who she can and cannot trust during her search for the people out to kill her family. Along with her new friends and advocates, she discovers Harding Industries holds a soon to expire option to buy property that could become the source of untold billions from oil reserves, and moves in the nick of time to exercise their right to purchase. But the biggest blow for the Harding family is yet to come—the discovery that Viktor Roman has promised Kerry Marcus the governor’s seat in exchange for information about the Hardings, including Nicholas and Michael’s whereabouts on the night they are shot. Ultimately, Andrea chooses to forego law school and becomes her father’s new partner in Harding Industries, no doubt with many adventures yet to come. Masterfully told using a smattering of historical facts along with a soundtrack of classical music masterpieces, this thriller keeps readers on edge until the very end. ...more",
        "title": "The Torch Is Passed: A Harding Family Story",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "On a searing summer Friday, Eddie Chapman has been stuck for hours in a traffic jam. There are accidents along the highway, but ambulances and police are conspicuously absent. When he decides to abandon his car and run home, he sees that the trees along the edge of a stream have been burnt, and the water in the streambed is gone. Something is very wrong.When he arrives hom On a searing summer Friday, Eddie Chapman has been stuck for hours in a traffic jam. There are accidents along the highway, but ambulances and police are conspicuously absent. When he decides to abandon his car and run home, he sees that the trees along the edge of a stream have been burnt, and the water in the streambed is gone. Something is very wrong.When he arrives home, the power is out and there is no running water. The pipes everywhere, it seems, have gone dry. Eddie and his wife, Laura, find themselves thrust together with their neighbors while a sense of unease thickens in the stifling night air. Thirst takes place in the immediate aftermath of a mysterious disaster--the Chapmans and their neighbors suffer the effects of the heat, their thirst, and the terrifying realization that no one is coming to help. As violence rips through the community, Eddie and Laura are forced to recall secrets from their past and question their present humanity. In crisp and convincing prose, Ben Warner compels readers to do the same. What might you do to survive? ...more",
        "title": "Thirst",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. It's a summer of secrets and sorrow and growing up, and it's a good thing Rose and Windy have each other.In This One Summer two stellar creators redefine the teen graphic novel. Cousins Mariko and Jillian Tamaki, the team behind Skim, have collaborated on this gorgeous, heartbreaking, and ultimately hopeful story about a girl on the cusp of her teen age — a story of renewal and revelation. ...more",
        "title": "This One Summer",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "Capital in the Twenty-First Century meets The Second Machine Age in this stunning and optimistic tour de force on the promise and peril of the digital economy, from one of the most brilliant social critics of our time. Digital technology was supposed to usher in a new age of endless prosperity, but so far it has been used to put industrial capitalism on steroids, makin Capital in the Twenty-First Century meets The Second Machine Age in this stunning and optimistic tour de force on the promise and peril of the digital economy, from one of the most brilliant social critics of our time. Digital technology was supposed to usher in a new age of endless prosperity, but so far it has been used to put industrial capitalism on steroids, making it harder for people and businesses to keep up. Social networks surrender their original missions to more immediately profitable data mining, while brokerage houses abandon value investing for algorithms that drain markets and our 401ks alike--all tactics driven by the need to stoke growth by any means necessary. Instead of taking this opportunity to reprogram our economy for sustainability, we have doubled down on growth as its core command. We have reached the limits of this approach. We must escape the growth trap, once and for all. Media scholar and technology author Douglas Rushkoff--one of today's most original and influential thinkers--argues for a new economic program that utilizes the unique distributive power of the internet while breaking free of the winner-take-all system the growth trap leaves in its wake. Drawing on sources both contemporary and historical, Rushkoff pioneers a new understanding of the old economic paradigm, from central currency to debt to corporations and labor.Most importantly, he offers a series of practical steps for businesses, consumers, investors, and policymakers to remake the economic operating system from the inside out--and prosper along the way. Instead of boycotting Wal-Mart or overtaxing the wealthy, we simply implement strategies that foster the creation of value by stakeholders other than just ourselves. From our currency to our labor to the corporation, every aspect of the economy can be reprogrammed with minimal disruption to create a more equitably distributed prosperity for all.Inspiring and challenging, Throwing Rocks at the Google Bus provides a pragmatic, optimistic, and human-centered model for economic progress in the digital age. ...more",
        "title": "Throwing Rocks at the Google Bus: How Growth Became the Enemy of Prosperity",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "DUAL WORLDS, DUAL SIGHTS In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepa DUAL WORLDS, DUAL SIGHTS   In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepancy mean, and what can they do to overcome it?! ...more",
        "title": "Tsubasa: WoRLD CHRoNiCLE 2 (Tsubasa WoRLD CHRoNiCLE #2)",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "After a savage attack drives her from her home, sixteen-year-old Mnemba finds a place in her cousin Tumelo’s successful safari business, where she quickly excels as a guide. Surrounding herself with nature and the mystical animals inhabiting the savannah not only allows Mnemba’s tracking skills to shine, it helps her to hide from the terrible memories that haunt her.Mnemba After a savage attack drives her from her home, sixteen-year-old Mnemba finds a place in her cousin Tumelo’s successful safari business, where she quickly excels as a guide. Surrounding herself with nature and the mystical animals inhabiting the savannah not only allows Mnemba’s tracking skills to shine, it helps her to hide from the terrible memories that haunt her.Mnemba is employed to guide Mr. Harving and his daughter, Kara, through the wilderness as they study unicorns. The young women are drawn to each other, despite that fact that Kara is betrothed. During their research, they discover a conspiracy by a group of poachers to capture the Unicorns and exploit their supernatural strength to build a railway. Together, they must find a way to protect the creatures Kara adores while resisting the love they know they can never indulge. ...more",
        "title": "Unicorn Tracks",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "It all started with Nathanael Johnson’s decision to teach his daughter the name of every tree they passed on their walk to day care in San Francisco. This project turned into a quest to discover the secrets of the neighborhood’s flora and fauna, and yielded more than names and trivia: Johnson developed a relationship with his nonhuman neighbors.Johnson argues that learning It all started with Nathanael Johnson’s decision to teach his daughter the name of every tree they passed on their walk to day care in San Francisco. This project turned into a quest to discover the secrets of the neighborhood’s flora and fauna, and yielded more than names and trivia: Johnson developed a relationship with his nonhuman neighbors.Johnson argues that learning to see the world afresh, like a child, shifts the way we think about nature: Instead of something distant and abstract, nature becomes real—all at once comical, annoying, and beautiful. This shift can add tremendous value to our lives, and it might just be the first step in saving the world.No matter where we live—city, country, oceanside, ormountains—there are wonders that we walk past every day. Unseen City widens the pinhole of our perspective by allowing us to view the world from the high-altitude eyes of a turkey vulture and the distinctly low-altitude eyes of a snail. The narrative allows us to eavesdrop on the comically frenetic life of a squirrel and peer deep into the past with a ginkgo biloba tree. Each of these organisms has something unique to tell us about our neighborhoods and, chapter by chapter, Unseen City takes us on a journey that is part nature lesson and part love letter to the world’s urban jungles. With the right perspective, a walk to the subway can be every bit as entrancing as a walk through a national park. ...more",
        "title": "Unseen City: The Majesty of Pigeons, the Discreet Charm of Snails & Other Wonders of the Urban Wilderness",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "The Freeman family--Charles, Laurel, and their daughters, teenage Charlotte and nine-year-old Callie--have been invited to the Toneybee Institute in rural Massachusetts to participate in a research experiment. They will live in an apartment on campus with Charlie, a young chimp abandoned by his mother. The Freemans were selected for the experiment because they know sign la The Freeman family--Charles, Laurel, and their daughters, teenage Charlotte and nine-year-old Callie--have been invited to the Toneybee Institute in rural Massachusetts to participate in a research experiment. They will live in an apartment on campus with Charlie, a young chimp abandoned by his mother. The Freemans were selected for the experiment because they know sign language; they are supposed to teach it to Charlie and welcome him as a member of their family. Isolated in their new, nearly all-white community not just by their race but by their strange living situation, the Freemans come undone. And when Charlotte discovers the truth about the Institute’s history of questionable studies, the secrets of the past begin to invade the present. The power of this novel resides in Kaitlyn Greenidge’s undeniable storytelling talents. What appears to be a story of mothers and daughters, of sisterhood put to the test, of adolescent love and grown-up misconduct, and of history’s long reach, becomes a provocative and compelling exploration of America’s failure to find a language to talk about race. ...more",
        "title": "We Love You, Charlie Freeman",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "We are seventeen and shattered and still dancing. We have messy, throbbing hearts, and we are stronger than anyone could ever know…Jonah never thought a girl like Vivi would come along.Vivi didn’t know Jonah would light up her world.Neither of them expected a summer like this…a summer that would rewrite their futures.In an unflinching story about new love, old wounds, and We are seventeen and shattered and still dancing. We have messy, throbbing hearts, and we are stronger than anyone could ever know…Jonah never thought a girl like Vivi would come along.Vivi didn’t know Jonah would light up her world.Neither of them expected a summer like this…a summer that would rewrite their futures.In an unflinching story about new love, old wounds, and forces beyond our control, two teens find that when you collide with the right person at just the right time, it will change you forever. ...more",
        "title": "When We Collided",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "For Annie London, a month in a Central American rainforest means handing out mosquito nets, giving medical aid, and teaching children about the birds and the bees. With any luck, it will also land her application in the “accepted” pile at a top tier medical school. But as soon as she steps off the plane, Annie realizes her bug spray, feeble Spanish, and medical supplies wo For Annie London, a month in a Central American rainforest means handing out mosquito nets, giving medical aid, and teaching children about the birds and the bees. With any luck, it will also land her application in the “accepted” pile at a top tier medical school. But as soon as she steps off the plane, Annie realizes her bug spray, feeble Spanish, and medical supplies won’t help her deal with her new feelings for Felipe—her best friend's older brother, who's much hotter than she remembers, and who also happens to be the doctor in charge of the trip.Gawking “volun-tourists” may keep his family’s medical clinic afloat, but Dr. Felipe Gutierrez doesn’t have to like them. Or the way they make snap judgments about his practice and the people he cares for. But when his old crush, Annie, shows up to volunteer, her killer curves and kind smile fan the embers of a flame Felipe didn’t realize he’d been carrying. A flame that makes him question all his preconceived notions.As ideas and cultures clash, Annie and Felipe must decide how far outside their comfort zones they are willing to go—both for their work and for one another. ...more",
        "title": "Without Borders (Wanderlove #1)",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "There is a cosmic alarm clock going off around the world! #HigherSelfie's aim is to unite all those waking up spiritually in this digital age. This book is a guide to love, connection, and kickass surrendered action for young people who have at least a toe in the door of spirituality. With a no-nonsense approach and full of wit and humor, this book shares age-old concepts There is a cosmic alarm clock going off around the world! #HigherSelfie's aim is to unite all those waking up spiritually in this digital age. This book is a guide to love, connection, and kickass surrendered action for young people who have at least a toe in the door of spirituality. With a no-nonsense approach and full of wit and humor, this book shares age-old concepts in a language that is accessible to the modern spiritual audience. Whether you have just bought a yoga mat or have been meditating for years, this book will offer you guidance and support, whatever stage of the journey you're at. Life coaches Jo Westwood and Lucy Sheridan touch upon timeless topics such as forgiveness, surrender and the ego, as well as subjects specific to the current age, such as using social media in a healthy way, finding a like-minded tribe, and following your own spiritual and life paths without comparing yourself to others. Whether you're a Reiki master, climbing the corporate ladder or working in a suburban garden center #HigherSelfie will be the perfect ‘gateway drug’ for those looking for something deeper and more meaningful. ...more",
        "title": "#HigherSelfie: Wake Up Your Life. Free Your Soul. Find Your Tribe.",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "Paris is burning--and only Private's Jack Morgan can put out the fire.When Jack Morgan stops by Private's Paris office, he envisions a quick hello during an otherwise relaxing trip filled with fine food and sightseeing. But Jack is quickly pressed into duty after a call from his client Sherman Wilkerson, asking Jack to track down his young granddaughter who is on the run f Paris is burning--and only Private's Jack Morgan can put out the fire.When Jack Morgan stops by Private's Paris office, he envisions a quick hello during an otherwise relaxing trip filled with fine food and sightseeing. But Jack is quickly pressed into duty after a call from his client Sherman Wilkerson, asking Jack to track down his young granddaughter who is on the run from a brutal drug dealer.Before Jack can locate her, several members of France's cultural elite are found dead--murdered in stunning, symbolic fashion. The only link between the crimes is a mysterious graffiti tag. As religious and ethnic tensions simmer in the City of Lights, only Jack and his Private team can connect the dots before the smoldering powder keg explodes. ...more",
        "title": "Private Paris (Private #10)",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying. I want life. I want to read it and write it and feel it and live it. I want, for as much of the time as possible in this blink-of-an-eye existence we have, to feel all that can be felt. I hate depression. I am scared of it. Terrified, in fact. But at the same time, it has made me who I am. And if - for me - it is the price of feeling life, it's a price always worth paying.Reasons to Stay Alive is about making the most of your time on earth. In the western world the suicide rate is highest amongst men under the age of 35. Matt Haig could have added to that statistic when, aged 24, he found himself staring at a cliff-edge about to jump off. This is the story of why he didn't, how he recovered and learned to live with anxiety and depression. It's also an upbeat, joyous and very funny exploration of how live better, love better, read better and feel more. ...more",
        "title": "Reasons to Stay Alive",
        "url": "http://books.toscrape.com/catalogue/page-3.html"
    },
    {
        "description": "Having survived the end of the world, the Queens follow Hannah back to where it all began: Mage University. A long perilous journey awaits the Rat Queens as they attempt to find out what happened to Hannah's father while battling their own demons. Collects RAT QUEENS #11-15",
        "title": "Rat Queens, Vol. 3: Demons (Rat Queens (Collected Editions) #11-15)",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "From Katherine Newman, award-winning author of No Shame in My Game, and sociologist Hella Winston, a sharp and irrefutable call to reenergize this nation's long-neglected system of vocational trainingAfter decades of off-shoring and downsizing that have left blue collar workers obsolete and stranded, the United States is now on the verge of an industrial renaissance. But w From Katherine Newman, award-winning author of No Shame in My Game, and sociologist Hella Winston, a sharp and irrefutable call to reenergize this nation's long-neglected system of vocational trainingAfter decades of off-shoring and downsizing that have left blue collar workers obsolete and stranded, the United States is now on the verge of an industrial renaissance. But we don't have a skilled enough labor pool to fill the positions that will be created, which are in many cases technically demanding and require specialized skills. A decades-long series of idealistic educational policies with the expressed goal of getting every student to go to college has left a generation of potential workers out of the system. Touted as a progressive, egalitarian institution providing opportunity even to those with the greatest need, the American secondary school system has in fact deepened existing inequalities.We can do better, argue acclaimed sociologists Katherine Newman and Hella Winston. Taking a page from the successful experience of countries like Germany and Austria, where youth unemployment is a mere 7%, they call for a radical reevaluation of the idea of vocational training, long discredited as an instrument of tracking. The United States can prepare a new, high-performance labor force if we revamp our school system to value industry apprenticeship and rigorous technical education. By doing so, we will not only be able to meet the growing demand for skilled employees in dozens of sectors where employers decry the absence of well trained workers -- we will make the American Dream accessible to all. ...more",
        "title": "Reskilling America: Learning to Labor in the Twenty-First Century",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Multiple storylines collide in this cosmos-spanning new volume. While Gwendolyn and Lying Cat risk everything to find a cure for The Will, Marko makes an uneasy alliance with Prince Robot IV to find their missing children, who are trapped on a strange world with terrifying new enemies. Collects Saga #25-30.",
        "title": "Saga, Volume 5 (Saga (Collected Editions) #5)",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "After a dramatic time jump, the three-time Eisner Award winner for Best Continuing Series continues to evolve, as Hazel begins the most exciting adventure of her life: kindergarten. Meanwhile, her star-crossed family learns hard lessons of their own.Collects SAGA #31-36",
        "title": "Saga, Volume 6 (Saga (Collected Editions) #6)",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Along with magic realism and a plethora of literary references throughout issues such as free will and identity flood the pages. What if your destiny was decided for you? What if you were meant for more?",
        "title": "Soul Reader",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Marie Kondo’s unique KonMari Method of tidying up is nothing short of life-changing—and her first book, The Life-Changing Magic of Tidying Up, has become a worldwide sensation. In Spark Joy, Kondo presents an in-depth, illustrated manual on how to declutter and organize specific items throughout the house, from kitchen and bathroom items to work-related papers and hobby co Marie Kondo’s unique KonMari Method of tidying up is nothing short of life-changing—and her first book, The Life-Changing Magic of Tidying Up, has become a worldwide sensation. In Spark Joy, Kondo presents an in-depth, illustrated manual on how to declutter and organize specific items throughout the house, from kitchen and bathroom items to work-related papers and hobby collections. User-friendly line drawings illustrate Kondo’s patented folding method as it applies to shirts, pants, socks, and jackets, as well as images of properly organized drawers, closets, and cabinets. This book is perfect for anyone who wants a home—and life—that sparks joy. ...more",
        "title": "Spark Joy: An Illustrated Master Class on the Art of Organizing and Tidying Up",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Change and anger are in the air. Looking for answers to today’s wrenching challenges, William Martin turns to the Tao Te Ching and finds that while Taoism is known for its quiet, enigmatic wisdom, the Tao can also have the cleansing force of a rushing river.Through his interpretation of this ancient Chinese text, Martin elucidates revolutionary messages condemning power-se Change and anger are in the air. Looking for answers to today’s wrenching challenges, William Martin turns to the Tao Te Ching and finds that while Taoism is known for its quiet, enigmatic wisdom, the Tao can also have the cleansing force of a rushing river.Through his interpretation of this ancient Chinese text, Martin elucidates revolutionary messages condemning power-seeking and greed. He emphasizes that humans have a “natural virtue” that can help them heal the planet; shows how Taoism’s simplicity can be subversive and its flexibility a potent force; and reassures that “when injustice is the rule, justice always lies in wait.”Provocative and stirring, Martin’s Tao flows within and through those who ride the waves of anger and frustration and gently guides them to true freedom.“We have learned the secret of transformation: Injustice feeds our determination. Hate increases our love. Wounds bring forth our healing, and fear uncovers our courage and serenity.”— from The Activist’s Tao Te Ching ...more",
        "title": "The Activist's Tao Te Ching: Ancient Advice for a Modern Revolution",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "On March 18, 1990, thirteen works of art today worth over $500 million were stolen from the Isabella Stewart Gardner Museum in Boston. It remains the largest unsolved art heist in history, and Claire Roth, a struggling young artist, is about to discover that there’s more to this crime than meets the eye.Making a living reproducing famous artworks for a popular online retai On March 18, 1990, thirteen works of art today worth over $500 million were stolen from the Isabella Stewart Gardner Museum in Boston. It remains the largest unsolved art heist in history, and Claire Roth, a struggling young artist, is about to discover that there’s more to this crime than meets the eye.Making a living reproducing famous artworks for a popular online retailer and desperate to improve her situation, Claire is lured into a Faustian bargain with Aiden Markel, a powerful gallery owner. She agrees to forge a painting—a Degas masterpiece stolen from the Gardner Museum—in exchange for a one-woman show in his renowned gallery. But when that very same long-missing Degas painting is delivered to Claire’s studio, she begins to suspect that it may itself be a forgery.Her desperate search for the truth leads Claire into a labyrinth of deceit where secrets hidden since the late nineteenth century may be the only evidence that can now save her life. ...more",
        "title": "The Art Forger",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "In his midtwenties, Dave Asprey was a successful Silicon Valley multimillionaire. He also weighed 300 pounds, despite the fact that he was doing what doctors recommended: eating 1,800 calories a day and working out 90 minutes a day, six times a week. When his excess fat started causing brain fog and food cravings sapped his energy and willpower, Asprey turned to the same h In his midtwenties, Dave Asprey was a successful Silicon Valley multimillionaire. He also weighed 300 pounds, despite the fact that he was doing what doctors recommended: eating 1,800 calories a day and working out 90 minutes a day, six times a week. When his excess fat started causing brain fog and food cravings sapped his energy and willpower, Asprey turned to the same hacking techniques that made his fortune to \"hack\" his own biology, investing more than $300,000 and 15 years to uncover what was hindering his energy, performance, appearance, and happiness. From private brain EEG facilities to remote monasteries in Tibet, through radioactive brain scans, blood chemistry work, nervous system testing, and more, he explored traditional and alternative technologies to reach his physical and mental prime. The result? The Bulletproof Diet, an anti-inflammatory program for hunger-free, rapid weight loss and peak performance. The Bulletproof Diet will challenge—and change—the way you think about weight loss and wellness. You will skip breakfast, stop counting calories, eat high levels of healthy saturated fat, work out and sleep less, and add smart supplements.In doing so, you'll gain energy, build lean muscle, and watch the pounds melt off. By ditching traditional \"diet\" thinking, Asprey went from being overweight and sick in his twenties to maintaining a 100-pound weight loss, increasing his IQ, and feeling better than ever in his forties. The Bulletproof Diet is your blueprint to a better life. ...more",
        "title": "The Bulletproof Diet: Lose up to a Pound a Day, Reclaim Energy and Focus, Upgrade Your Life",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Do you believe human life is inherently valuable? Unfortunately, in the secularized age of state-sanctioned euthanasia and abortion-on-demand, many are losing faith in the simple value of human life. To the disillusioned, human beings are a cosmic accident whose intrinsic value is worth no more than other animals.The Death of Humanity explores our culture's declining respe Do you believe human life is inherently valuable? Unfortunately, in the secularized age of state-sanctioned euthanasia and abortion-on-demand, many are losing faith in the simple value of human life. To the disillusioned, human beings are a cosmic accident whose intrinsic value is worth no more than other animals.The Death of Humanity explores our culture's declining respect for the sanctity of human life, drawing on philosophy and history to reveal the dark road ahead for society if we lose our faith in human life. ...more",
        "title": "The Death of Humanity: and the Case for Life",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Deeds's subtle, meticulous, and wildly imaginative pencil and crayon drawings portray an unusual cast of characters: nineteenth-century dandies, Civil War soldiers, antique cars, fantastic boats and trains, country landscapes dotted with roaming animals, and fanciful architecture. None of these existed in the actual mid-twentieth-century landscape of Deeds's own life, but Deeds's subtle, meticulous, and wildly imaginative pencil and crayon drawings portray an unusual cast of characters: nineteenth-century dandies, Civil War soldiers, antique cars, fantastic boats and trains, country landscapes dotted with roaming animals, and fanciful architecture. None of these existed in the actual mid-twentieth-century landscape of Deeds's own life, but rather were representations of his inner world—an artist's poignant tribute to a faded past.Deeds lovingly bound his artwork in a cardboard and leather portfolio, a present for his mother. After being accidentally discarded in 1970, the album was rescued from the trash by a young boy and, thirty-six years later, came into the hands of artist and collector Harris Diamant, who provides the book's foreword. The Electric Pencil features all 283 of Deeds's arresting drawings—now avidly collected—done on ledger sheets from State Hospital No. 3 in Nevada, Missouri, and reproduced in the sequence of the original album. The Electric Pencil introduces readers to an astonishing record of one man's unwavering artistic vision in the face of the most inhospitable conditions. ...more",
        "title": "The Electric Pencil: Drawings from Inside State Hospital No. 3",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Why should girls miss out on the joy of adventure? They can jump off rocks, swing on ropes, and climb trees just as well as boys can. But girls often allow fear to stand in their way.In The Gutsy Girl, author Caroline Paul emboldens girls to seek out a life of exhilaration. Once a young scaredy-cat herself, Caroline decided that fear got in the way of the life she wanted-- Why should girls miss out on the joy of adventure? They can jump off rocks, swing on ropes, and climb trees just as well as boys can. But girls often allow fear to stand in their way.In The Gutsy Girl, author Caroline Paul emboldens girls to seek out a life of exhilaration. Once a young scaredy-cat herself, Caroline decided that fear got in the way of the life she wanted--of excitement, confidence, self-reliance, friendship, and fun. She has since flown planes, rafted big rivers, climbed tall mountains, and fought fires as one of the first female firefighters in San Francisco. In The Gutsy Girl, she shares her greatest escapades as well as those of other girls and women from throughout history, and offers engaging activities such as confidence-building stances, creating a compass, positive self-talk, and using crickets to estimate outside temperatures. Each section includes a place for girls to “journal” their adventures, thus encouraging a new generation to develop a zest for challenges and a healthy relationship to risk. The Gutsy Girl is Lean In for young girls, a book about the glorious things that happen when you unshackle from fear and open up to exhilaration. Fully illustrated and enlivened throughout by bestselling illustrator Wendy MacNaughton's whimsical pen-and-ink drawings. ...more",
        "title": "The Gutsy Girl: Escapades for Your Life of Epic Adventure",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Slay Procrastination, Distraction, and Overwhelm!Who doesn’t want more time and energy for family, friends, and personal passions? Author Helene Segura coaches real people in the real world to operate more efficiently during the workday, so they can have a life outside it. Her engaging time management program caters to diverse learning styles, offering case studies that al Slay Procrastination, Distraction, and Overwhelm!Who doesn’t want more time and energy for family, friends, and personal passions? Author Helene Segura coaches real people in the real world to operate more efficiently during the workday, so they can have a life outside it. Her engaging time management program caters to diverse learning styles, offering case studies that allow readers to self-diagnose and zero in on the strategies most appropriate for them. Anyone wanting to streamline workflow and improve productivity can employ her wonderfully doable techniques — for clearing task lists, handling reminder systems, scheduling a variety of priorities, and even managing emails and phone calls. Thanks to Segura’s astute attention to personality, The Inefficiency Assassin meets readers where they are struggling and details quick and easy-to-implement strategies to, as Segura promises, “kick chaos to the curb.” ...more",
        "title": "The Inefficiency Assassin: Time Management Tactics for Working Smarter, Not Longer",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Despite constant efforts to declutter your home, do papers still accumulate like snowdrifts and clothes pile up like a tangled mess of noodles?Japanese cleaning consultant Marie Kondo takes tidying to a whole new level, promising that if you properly simplify and organize your home once, you'll never have to do it again. Most methods advocate a room-by-room or little-by-li Despite constant efforts to declutter your home, do papers still accumulate like snowdrifts and clothes pile up like a tangled mess of noodles?Japanese cleaning consultant Marie Kondo takes tidying to a whole new level, promising that if you properly simplify and organize your home once, you'll never have to do it again. Most methods advocate a room-by-room or little-by-little approach, which doom you to pick away at your piles of stuff forever. The KonMari Method, with its revolutionary category-by-category system, leads to lasting results. In fact, none of Kondo's clients have lapsed (and she still has a three-month waiting list).With detailed guidance for determining which items in your house \"spark joy\" (and which don't), this international best seller featuring Tokyo's newest lifestyle phenomenon will help you clear your clutter and enjoy the unique magic of a tidy home - and the calm, motivated mindset it can inspire. ...more",
        "title": "The Life-Changing Magic of Tidying Up: The Japanese Art of Decluttering and Organizing",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Is anxiety and fear a problem for you? Have you tried to win the war with your anxious mind and body, only to end up feeling frustrated, powerless, and stuck? If so, you’re not alone. But there is a way forward, a path into genuine happiness, and a way back into living the kind of life you so desperately want. This workbook will help you get started on this new journey tod Is anxiety and fear a problem for you? Have you tried to win the war with your anxious mind and body, only to end up feeling frustrated, powerless, and stuck? If so, you’re not alone. But there is a way forward, a path into genuine happiness, and a way back into living the kind of life you so desperately want. This workbook will help you get started on this new journey today!Now in its second edition, The Mindfulness and Acceptance Workbook for Anxiety offers a new approach to your anxiety, fears, and your life. Within its pages, you’ll find a powerful and tested set of tools and strategies to help you gain freedom from fear, trauma, worry, and all the many manifestations of anxiety and fear. The book offers an empowering approach to help you create the kind of life you so desperately want to live.Based on a revolutionary approach to psychological health and wellness called acceptance and commitment therapy (ACT), this fully revised and updated second edition offers compelling new exercises to help you create the conditions for your own genuine happiness and peace of mind. You’ll learn how your mind can trap you, keeping you stuck and struggling in anxiety and fear. You’ll also discover ways to nurture your capacity for acceptance, mindfulness, kindness, and compassion, and use these qualities to weaken the power of anxiety and fear so that you can gain the space do what truly matters to you. Now is the time.Nobody chooses anxiety. And there is no healthy way to “turn off” anxious thoughts and feelings like a light switch. But you can learn to break free from the shackles of anxiety and fear and take back your life. The purpose of this workbook is to help you do just that. Your life is calling on you to make that choice, and the skills in this workbook can help you make it happen. You can live better, more fully, and more richly with or without anxiety and fear. This book will show you the way.This book has been awarded The Association for Behavioral and Cognitive Therapies Self-Help Seal of Merit — an award bestowed on outstanding self-help books that are consistent with cognitive behavioral therapy (CBT) principles and that incorporate scientifically tested strategies for overcoming mental health difficulties. Used alone or in conjunction with therapy, our books offer powerful tools readers can use to jump-start changes in their lives. ...more",
        "title": "The Mindfulness and Acceptance Workbook for Anxiety: A Guide to Breaking Free from Anxiety, Phobias, and Worry Using Acceptance and Commitment Therapy",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Given the opportunity, would you assume someone else's identity and leave your old life behind? A serendipitous crossing of paths between Lisa Barnes, a down-on-her-luck job seeker, and Julie Forman, a personal trainer to an Olympic hopeful, forever changes the course of both women's lives. One winds up dead and the other finds herself a fugitive, hiding behind one lie aft Given the opportunity, would you assume someone else's identity and leave your old life behind? A serendipitous crossing of paths between Lisa Barnes, a down-on-her-luck job seeker, and Julie Forman, a personal trainer to an Olympic hopeful, forever changes the course of both women's lives. One winds up dead and the other finds herself a fugitive, hiding behind one lie after another as a cold-blooded killer methodically hunts her. Desperately trying to stay alive, the terrified woman enlists the help of Forensic Instincts, a rogue investigative team that clandestinely operates in the gray area between legal and illegal. Safeguarding their client's deception, Forensic Instincts digs into dangerous territory as they try to find out who's after their client and why. Meanwhile, bodies are piling up in Chicago, New Jersey, and Vermont as a megalomaniacal genius will stop at nothing to eradicate anyone who threatens the success of his medical breakthrough. With an unhinged client and a monstrous criminal enterprise as its adversary, Forensic Instincts is forced into uncharted territory to protect their client and save one of their own from becoming the next corpse. Forensic Instincts is an unorthodox, criminal investigative team that carefully navigates the fine line between legal and illegal. The team consists of a behaviorist, a former Navy SEAL, a techo-wiz, an intuitive, a pickpocket, a retired FBI agent, and a human scent evidence dog.\" ...more",
        "title": "The Murder That Never Was (Forensic Instincts #5)",
        "url": "http://books.toscrape.com/catalogue/page-4.html"
    },
    {
        "description": "Since her twin brother, Eddie, drowned five years ago, sixteen-year-old Elsie Main has tried to remember what really happened that fateful day on the beach. One minute Eddie was there, and the next he was gone. Seventeen-year-old Tay McKenzie is a cute and mysterious boy that Elsie meets in her favorite boathouse hangout. When Tay introduces Elsie to the world of freedivin Since her twin brother, Eddie, drowned five years ago, sixteen-year-old Elsie Main has tried to remember what really happened that fateful day on the beach. One minute Eddie was there, and the next he was gone. Seventeen-year-old Tay McKenzie is a cute and mysterious boy that Elsie meets in her favorite boathouse hangout. When Tay introduces Elsie to the world of freediving, she vows to find the answers she seeks at the bottom of the sea. ...more",
        "title": "The Art of Not Breathing",
        "url": "http://books.toscrape.com/catalogue/category/books/young-adult_21/page-3.html"
    },
    {
        "description": "From Jesse Andrews, author of the New York Times bestselling Me and Earl and the Dying Girl and screenwriter of the Sundance award–winning motion picture of the same name, comes a groundbreaking young adult novel about music, love, friendship, and freedom as three young musicians follow a quest to escape the law long enough to play the amazing show they hope (but also doub From Jesse Andrews, author of the New York Times bestselling Me and Earl and the Dying Girl and screenwriter of the Sundance award–winning motion picture of the same name, comes a groundbreaking young adult novel about music, love, friendship, and freedom as three young musicians follow a quest to escape the law long enough to play the amazing show they hope (but also doubt) they have in them.Inspired by the years he spent playing bass in a band himself, The Haters is Jesse Andrews’s road trip adventure about a trio of jazz-camp escapees who, against every realistic expectation, become a band. For Wes and his best friend, Corey, jazz camp turns out to be lame. It’s pretty much all dudes talking in Jazz Voice. But then they jam with Ash, a charismatic girl with an unusual sound, and the three just click. It’s three and a half hours of pure musical magic, and Ash makes a decision: They need to hit the road. Because the road, not summer camp, is where bands get good. Before Wes and Corey know it, they’re in Ash’s SUV heading south, and The Haters Summer of Hate Tour has begun.In his second novel, Andrews again brings his brilliant and distinctive voice to YA, in the perfect book for music lovers, fans of The Commitments and High Fidelity, or anyone who has ever loved—and hated—a song or a band. This witty, funny coming-of-age novel is contemporary fiction at its best. ...more",
        "title": "The Haters",
        "url": "http://books.toscrape.com/catalogue/category/books/young-adult_21/page-3.html"
    }
]