[
    {
        "joke": "Yo mom is so dumb that she thought Dunkin' Donuts was a basketball team.",
        "likes": "11001",
        "dislikes": "2792",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "Q: What did one saggy boob say to the other saggy boob?",
        "likes": "21612",
        "dislikes": "5362",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "A mother is in the kitchen making dinner for her family when her daughter walks in.\r\n\r\n“Mother, where do babies come from?”\r\n\r\nThe mother thinks for a few seconds and says, “Well dear, Mommy and Daddy fall in love and get married. One night they go into their bedroom, they kiss and hug, and have sex.”\r\n\r\nThe daughter looks puzzled so the mother continues, “That means the daddy puts his penis in the mommy’s vagina. That’s how you get a baby, honey.” The child seems to comprehend.\r\n\r\n“Oh, I see, but the other night when I came into your room you had daddy’s penis in your mouth. What do you get when you do that?”\r\n\r\n“Jewelry, my dear. Jewelry.”",
        "likes": "77521",
        "dislikes": "18090",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "A science teacher tells his class, \"Oxygen is a must for breathing and life. It was discovered in 1773.\" A blonde student responds, \"Thank God I was born after 1773! Otherwise I would have died without it.\"",
        "likes": "5942",
        "dislikes": "2005",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "A teacher is teaching a class and she sees that Johnny isn't paying attention, so she asks him, \"If there are three ducks sitting on a fence, and you shoot one, how many are left?\" Johnny says, \"None.\" The teacher asks, \"Why?\" Johnny says, \"Because the shot scared them all off.\" The teacher says, \"No, two, but I like how you're thinking.\" Johnny asks the teacher, \"If you see three women walking out of an ice cream parlor, one is licking her ice cream, one is sucking her ice cream, and one is biting her ice cream, which one is married?\" The teacher says, \"The one sucking her ice cream.\" Johnny says, \"No, the one with the wedding ring, but I like how you're thinking!\"",
        "likes": "65432",
        "dislikes": "9864",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"",
        "likes": "12706",
        "dislikes": "4052",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"",
        "likes": "49180",
        "dislikes": "13061",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "I asked a Chinese girl for her number. She said, \"Sex! Sex! Sex! Free sex tonight!\" I said, \"Wow!\" Then her friend said, \"She means 666-3629.\"",
        "likes": "59751",
        "dislikes": "22609",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "Do not be racist; be like Mario. He's an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew!",
        "likes": "48790",
        "dislikes": "14607",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "I was walking down the street and I punched of a white guy and then I was arrested for assault. The next day after I got out, I punched a black guy and I was arrested for impersonating a police officer.",
        "likes": "4578",
        "dislikes": "1636",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\"",
        "likes": "10508",
        "dislikes": "4284",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "Mexico doesn't win Olympic medals because all the best runners, jumpers, and swimmers are in America.",
        "likes": "9033",
        "dislikes": "4381",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Teacher: \"Kids, what does the chicken give you?\"",
        "likes": "80133",
        "dislikes": "20697",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "Teacher: \"Kids, what does the chicken give you?\"",
        "likes": "80133",
        "dislikes": "20697",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "A man goes to a bar and sees a fat girl dancing on a table. He walks over to her and says, \"Wow, nice legs!\" She is flattered and replies, \"You really think so?\" The man says, \"Oh definitely! Most tables would have collapsed by now.\"",
        "likes": "3959",
        "dislikes": "656",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "Q: Why did the witches' team lose the baseball game?",
        "likes": "6692",
        "dislikes": "3992",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "A family is at the dinner table. The son asks the father, “Dad, how many kinds of boobs are there?” The father, surprised, answers, “Well, son, a woman goes through three phases. In her 20s, a woman’s breasts are like melons, round and firm. In her 30s and 40s, they are like pears, still nice, hanging a bit. After 50, they are like onions.” “Onions?” the son asks. “Yes. You see them and they make you cry.” This infuriated his wife and daughter. The daughter asks, “Mom, how many different kinds of willies are there?” The mother smiles and says, “Well, dear, a man goes through three phases also. In his 20s, his willy is like an oak tree, mighty and hard. In his 30s and 40s, it’s like a birch, flexible but reliable. After his 50s, it’s like a Christmas tree.” “A Christmas tree?” the daughter asks. “Yes, dead from the root up and the balls are just for decoration.”",
        "likes": "73847",
        "dislikes": "11908",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "There is an overweight guy who is watching TV. A commercial comes on for a guaranteed weight loss of 10 pounds in a week. So the guy, thinking what the hell, signs up for it. Next morning an incredibly beautiful woman is standing at his door in nothing but a pair of running shoes and a sign about her neck that reads, \"If you can catch me, you can have me.\" As soon as he sees her, she takes off running. He tries to catch her, but is unable. This continues for a week, at the end of which, the man has lost 10 pounds. After this he tries the next weight loss plan, 15 pounds in a week. The next morning an even more beautiful woman is standing at the door, in similar conditions. The same happens with her as the first woman, except he almost catches her. This continues for a week, at the end of which he, as suspected, weighs 15 pounds less. Excited about this success, he decides to do the master program. Before he signs up, he is required to sign a waiver and is warned about the intensity of this plan. Still he signs up. The next morning, waiting at the door, is a hulking 300 pound muscle man with nothing but a pair of running shoes, a raging erection, and a sign around his neck that says, \"If I catch you, you're mine!\" The man was supposed to lose 25 pounds in the week; he lost 34.",
        "likes": "7356",
        "dislikes": "1597",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "Three guys go to a ski lodge, and there aren't enough rooms, so they have to share a bed. In the middle of the night, the guy on the right wakes up and says, \"I had this wild, vivid dream of getting a hand job!\" The guy on the left wakes up, and unbelievably, he's had the same dream, too. Then the guy in the middle wakes up and says, \"That's funny, I dreamed I was skiing!\"",
        "likes": "4978",
        "dislikes": "1866",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "A man joins a soccer team and his new teammates inform him, \"At your first team dinner as the new guy, you will have to give us a talk about sex.\" The evening arrives and he gives a detailed, humorous account of his sex life. When he got home, his wife asked how the evening went and not wanting to lie, but also not wanting to explain exactly what happened, he said, \"Oh, I had to make a talk about yachting,\" his wife thought this a little peculiar but said nothing more and went to sleep. The next day she bumped into one of his new teammates at the supermarket and asked, \"I heard my husband had to make a speech last night. How did it go?\" His mate said smiling, 'Oh, it was excellent! Your husband is clearly very experienced!.\" The wife looked confused and replied to his mate, \"Strange, he has only done it twice and the second time he was sick.\"",
        "likes": "2441",
        "dislikes": "786",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "A guy and his wife are sitting and watching a boxing match on television. The husband sighs and complains, “This is disappointing. It only lasted for 30 seconds!” “Good,” replied his wife. “Now you know how I always feel.”",
        "likes": "2423",
        "dislikes": "659",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "Q: Why did the golfer wear two pairs of pants?",
        "likes": "1721",
        "dislikes": "422",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "Q: What's the difference between England and a teabag?",
        "likes": "1652",
        "dislikes": "704",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "Q: Is Google male or female?",
        "likes": "19417",
        "dislikes": "7837",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "As an airplane is about to crash, a female passenger jumps up frantically and announces, \"If I'm going to die, I want to die feeling like a woman.\" She removes all her clothing and asks, \"Is there someone on this plane who is man enough to make me feel like a woman?\"\r\n\r\nA man stands up, removes his shirt and says, \"Here, iron this!\".",
        "likes": "14764",
        "dislikes": "3475",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "A young woman was taking golf lessons and had just started playing her first round of golf when she suffered a bee sting. Her pain was so intense that she decided to return to the clubhouse for medical assistance.\r\n\r\nThe golf pro saw her heading back and said, “You are back early, what’s wrong?” “I was stung by a bee!” she said. “Where?” he asked. “Between the first and second hole.” she replied. He nodded and said, “Your stance is far too wide.”",
        "likes": "7997",
        "dislikes": "2523",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "How did the medical community come up with the term \"PMS\"? \"Mad Cow Disease\" was already taken.",
        "likes": "5062",
        "dislikes": "2478",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "A family is at the dinner table. The son asks the father, “Dad, how many kinds of boobs are there?” The father, surprised, answers, “Well, son, a woman goes through three phases. In her 20s, a woman’s breasts are like melons, round and firm. In her 30s and 40s, they are like pears, still nice, hanging a bit. After 50, they are like onions.” “Onions?” the son asks. “Yes. You see them and they make you cry.” This infuriated his wife and daughter. The daughter asks, “Mom, how many different kinds of willies are there?” The mother smiles and says, “Well, dear, a man goes through three phases also. In his 20s, his willy is like an oak tree, mighty and hard. In his 30s and 40s, it’s like a birch, flexible but reliable. After his 50s, it’s like a Christmas tree.” “A Christmas tree?” the daughter asks. “Yes, dead from the root up and the balls are just for decoration.”",
        "likes": "73847",
        "dislikes": "11908",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"",
        "likes": "49180",
        "dislikes": "13061",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "Q: How do astronomers organize a party?",
        "likes": "3316",
        "dislikes": "1277",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "A black Jewish boy runs home from school one day and asks his father, “Daddy, am I more Jewish or more black?” The dad replies, “Why do you want to know, son?” “Because a kid at school is selling a bike for $50 and I want to know if I should talk him down to $40 or just steal it!”",
        "likes": "31038",
        "dislikes": "10449",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "Teacher: \"If I gave you 2 cats and another 2 cats and another 2, how many would you have?\"",
        "likes": "16856",
        "dislikes": "3359",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "After picking her son up from school one day, the mother asks him what he did at school. The kid replies, \"I had sex with my teacher.\" She gets so mad that when they get home, she orders him to go straight to his room. When the father returns home that evening, the mother angrily tells him the news of what their son had done. As the father hears the news, a huge grin spreads across his face. He walks to his son's room and asks him what happened at school, the son tells him, \"I had sex with my teacher.\" The father tells the boy that he is so proud of him, and he is going to reward him with the bike he has been asking for. On the way to the store, the dad asks his son if he would like to ride his new bike home. His son responds, \"No thanks Dad, my butt still hurts.\"",
        "likes": "16380",
        "dislikes": "8291",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "A bus full of ugly people had a head on collision with a truck. When they died, God granted all of them one wish. The first person said, \"I want to be gorgeous.\" God snapped his fingers and it happened. The second person said the same thing and God did the same thing. This want on and on throughout the group. God noticed the last man in line was laughing hysterically. By the time God got to the last ten people, the last man was laughing and rolling on the ground. When the man's turn came, he laughed and said, \"I wish they were all ugly again.\"",
        "likes": "6742",
        "dislikes": "1323",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "Josey wasn't the best pupil at Sunday school. She often fell asleep and one day while she was sleeping, the teacher asked her a question. \"Who is the creator of the universe?\" Joe was sitting next to Josey and decided to poke her with a pin to wake her up. Josey jumped and yelled, \"God almighty!\" The teacher congratulated her. A little later the teacher asked her another question, \"Tell me who is our lord and savior?\" Joe poked Josey again and she yelled out, \"Jesus Christ!\" The teacher congratulated her again. Later on the teacher asked, \"What did Eve say to Adam after their 26th child?\" Joe poked Josey again and she shouted, \"If you stick that thing in me again, I'll snap it in half and stick it up your ass!\"",
        "likes": "5580",
        "dislikes": "952",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "There was a preacher who fell in the ocean and he couldn't swim. When a boat came by, the captain yelled, \"Do you need help, sir?\" The preacher calmly said \"No, God will save me.\" A little later, another boat came by and a fisherman asked, \"Hey, do you need help?\" The preacher replied again, \"No God will save me.\" Eventually the preacher drowned & went to heaven. The preacher asked God, \"Why didn't you save me?\" God replied, \"Fool, I sent you two boats!\"",
        "likes": "4546",
        "dislikes": "662",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "A man gets on a bus, and ends up sitting next to a very attractive nun. Enamored with her, he asks if he can have sex with her. Naturally, she says no, and gets off the bus. The man goes to the bus driver and asks him if he knows of a way for him to have sex with the nun. \"Well,\" says the bus driver, \"every night at 8 o'clock, she goes to the cemetery to pray. If you dress up as God, I'm sure you could convince her to have sex with you.\" The man decides to try it, and dresses up in his best God costume. At eight, he sees the nun and appears before her. \"Oh, God!\" she exclaims. \"Take me with you!\" The man tells the nun that she must first have sex with him to prove her loyalty. The nun says yes, but tells him she prefers anal sex. Before you know it, they're getting down to it, having nasty, grunty, loud sex. After it's over, the man pulls off his God disguise. \"Ha, ha!\" he says, \"I'm the man from the bus!\" \"Ha, ha!\" says the nun, removing her costume, \"I'm the bus driver!\"",
        "likes": "4176",
        "dislikes": "832",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "On their way to get married, a young Catholic couple is involved in a fatal car accident. The couple found themselves sitting outside the Pearly Gates waiting for St. Peter to process them into Heaven. While waiting, they began to wonder: Could they possibly get married in Heaven? When St. Peter showed up, they asked him. St. Peter said, \"I don't know. This is the first time anyone has asked. Let me go find out,'\" and he left. The couple sat and waited, and waited. Two months passed and the couple were still waiting. While waiting, they began to wonder what would happen if it didn't work out; could you get a divorce in heaven? After yet another month, St. Peter finally returned, looking somewhat bedraggled. \"Yes,\" he informed the couple, \"You can get married in Heaven.\" \"Great!\" said the couple, \"But we were just wondering, what if things don't work out? Could we also get a divorce in Heaven?\" St. Peter, red-faced with anger, slammed his clipboard onto the ground. \"What's wrong?\" asked the frightened couple. \"OH, COME ON!,\" St. Peter shouted, \"It took me three months to find a priest up here! Do you have any idea how long it'll take me to find a lawyer?\"",
        "likes": "3266",
        "dislikes": "1014",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "A man is talking to God. \"God, how long is a million years?\" God answers, \"To me, it's about a minute.\"\r\n\"God, how much is a million dollars?\" \"To me, it's a penny.\" \"God, may I have a penny?\" \"Wait a minute.\"",
        "likes": "3097",
        "dislikes": "779",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "Two guys are walking through a game park & they come across a lion that has not eaten for days. The lion starts chasing the two men. They run as fast as they can and the one guy starts getting tired and decides to say a prayer, \"Please turn this lion into a Christian, Lord.\" He looks to see if the lion is still chasing and he sees the lion on its knees. Happy to see his prayer answered, he turns around and heads towards the lion. As he comes closer to the lion, he hears the it saying a prayer: \"Thank you Lord for the food I am about to receive.\"",
        "likes": "3007",
        "dislikes": "606",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "Maria, a devout Catholic, got married and had 15 children. After her first husband died, she remarried and had 15 more children. A few weeks after her second husband died, Maria also passed away. At Maria's funeral, the priest looked skyward and said, \"At last, they're finally together.\" Her sister sitting in the front row said, \"Excuse me, Father, but do you mean she and her first husband, or she and her second husband?\" The priest replied, \"I mean her legs.\"",
        "likes": "2981",
        "dislikes": "603",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "Wife: \"How would you describe me?\"",
        "likes": "46177",
        "dislikes": "6311",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "Q: Is Google male or female?",
        "likes": "19417",
        "dislikes": "7837",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "A lady goes to the doctor and complains that her husband is losing interest in sex. The doctor gives her a pill, but warns her that it's still experimental. He tells her to slip it into his mashed potatoes at dinner, so that night, she does just that. About a week later, she’s back at the doctor, where she says, \"Doc, the pill worked great! I put it in the potatoes like you said! It wasn't five minutes later that he jumped up, raked all the food and dishes onto the floor, grabbed me, ripped all my clothes off, and ravaged me right there on the table!\" The doctor says, \"I’m sorry, we didn’t realize the pill was that strong! The foundation will be glad to pay for any damages.\" \"Nah,\" she says, \"that's okay. We're never going back to that restaurant anyway.\"",
        "likes": "9344",
        "dislikes": "1664",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "Teacher: \"Kids, what does the chicken give you?\"",
        "likes": "80133",
        "dislikes": "20697",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "On the roof of a very tall building are four men; one is asian, one is mexican, one is black, and the last one is white. The asian walks to the ledge and says, \"This is for all my people\" and jumps off the roof. Next, the mexican walks to the ledge and also says, \"This is for all my people\" and then he jumps off the roof. Next is the black guy's turn. The black guy walks to the ledge and says, \"This is for all my people\" and then throws the white guy off the roof.",
        "likes": "48880",
        "dislikes": "15920",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "Do not be racist; be like Mario. He's an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew!",
        "likes": "48790",
        "dislikes": "14607",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "Q: Do you know who was the first black guy to admit he is the father?",
        "likes": "6294",
        "dislikes": "1886",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "Sherlock Holmes and Dr. Watson went on a camping trip. After a good meal and a bottle of wine, they laid down for the night, and went to sleep. Some hours later, Holmes awoke and nudged his faithful friend. \"Watson, look up at the sky and tell me what you see.\" Watson replied, \"I see millions and millions of stars.\" \"What does that tell you?\" Watson pondered for a minute. \"Astronomically, it tells me that there are millions of galaxies, and potentially billions of planets. Astrologically, I observe that Saturn is in Leo. Horologically, I deduce that the time is approximately a quarter past three. Theologically, I can see that God is all powerful and that we are small and insignificant. Meteorologically, I suspect that we will have a beautiful day tomorrow. What does it tell you?\" Holmes was silent for a minute, then spoke. \"It tells me that someone has stolen our tent.\"",
        "likes": "4271",
        "dislikes": "1907",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "A worldwide survey was conducted by the UN. The only question asked was: \"Would you please give your honest opinion about solutions to the food shortage in the rest of the world?\" The survey was a huge failure. In Africa they didn't know what \"food\" meant. In Eastern Europe they didn't know what \"honest\" meant. In Western Europe they didn't know what \"shortage\" meant. In China they didn't know what \"opinion\" meant. In the Middle East they didn't know what \"solution\" meant. In South America they didn't know what \"please\" meant. And in the USA they didn't know what \"the rest of the world\" meant.",
        "likes": "3302",
        "dislikes": "965",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "If con is the opposite of pro, then is Congress the opposite of progress?",
        "likes": "3257",
        "dislikes": "787",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Politicians and diapers have one thing in common: they should both be changed regularly… and for the same reason.",
        "likes": "2432",
        "dislikes": "417",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Q: Have you heard about McDonald’s new Obama Value Meal?",
        "likes": "2047",
        "dislikes": "899",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Three contractors are bidding to fix a broken fence at the White House. One is from Chicago, another is from Tennessee, and the third is from Minnesota. All three go with a White House official to examine the fence. The Minnesota contractor takes out a tape measure and does some measuring, then works some figures with a pencil. \"Well,\" he says, \"I figure the job will run about $900. $400 for materials, $400 for my crew, and $100 profit for me.\" The Tennessee contractor also does some measuring and figuring, then says, \"I can do this job for $700. $300 for materials, $300 for my crew, and $100 profit for me.\" The Chicago contractor doesn't measure or figure, but leans over to the White House official and whispers, \"$2,700.\" The official, incredulous, says, \"You didn't even measure like the other guys! How did you come up with such a high figure?\" The Chicago contractor whispers back, \"$1000 for me, $1000 for you, and we hire the guy from Tennessee to fix the fence.\" \"Done!\" replies the government official. And that, my friends, is how the new stimulus plan will work.",
        "likes": "1921",
        "dislikes": "370",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Q: Why did the can crusher quit his job?",
        "likes": "3785",
        "dislikes": "1725",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "How is Christmas like your job? You do all the work and the fat guy in the suit gets all the credit.",
        "likes": "3635",
        "dislikes": "1799",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "An organization is like a tree full of monkeys, all on different limbs at different levels. The monkeys on top look down and see a tree full of smiling faces. The monkeys on the bottom look up and see nothing but assholes.",
        "likes": "2848",
        "dislikes": "571",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "Don't be racist; racism is a crime; and crime is for black people.",
        "likes": "11412",
        "dislikes": "6165",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "Q: Why do Chinese people have Chinese babies?",
        "likes": "6004",
        "dislikes": "1584",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Q: How do you stop a Mexican tank?",
        "likes": "4142",
        "dislikes": "1642",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Q: What do you call two Mexicans playing basketball?",
        "likes": "3560",
        "dislikes": "2495",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Q: What do you call stoned Mexicans?",
        "likes": "3553",
        "dislikes": "1534",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Why did I get divorced? Well, last week was my birthday. My wife didn't wish me a happy birthday. My parents forgot and so did my kids. I went to work and even my colleagues didn't wish me a happy birthday. As I entered my office, my secretary said, \"Happy birthday, boss!\" I felt so special. She asked me out for lunch. After lunch, she invited me to her apartment. We went there and she said, \"Do you mind if I go into the bedroom for a minute?\" \"Okay,\" I said. She came out 5 minutes later with a birthday cake, my wife, my parents, my kids, my friends, & my colleagues all yelling, \"SURPRISE!!!\" while I was waiting on the sofa... naked.",
        "likes": "25960",
        "dislikes": "4270",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "Teacher: \"If I gave you 2 cats and another 2 cats and another 2, how many would you have?\"",
        "likes": "16856",
        "dislikes": "3359",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "Kid 1: \"Hey, I bet you're still a virgin.\"",
        "likes": "12232",
        "dislikes": "6022",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "There is an overweight guy who is watching TV. A commercial comes on for a guaranteed weight loss of 10 pounds in a week. So the guy, thinking what the hell, signs up for it. Next morning an incredibly beautiful woman is standing at his door in nothing but a pair of running shoes and a sign about her neck that reads, \"If you can catch me, you can have me.\" As soon as he sees her, she takes off running. He tries to catch her, but is unable. This continues for a week, at the end of which, the man has lost 10 pounds. After this he tries the next weight loss plan, 15 pounds in a week. The next morning an even more beautiful woman is standing at the door, in similar conditions. The same happens with her as the first woman, except he almost catches her. This continues for a week, at the end of which he, as suspected, weighs 15 pounds less. Excited about this success, he decides to do the master program. Before he signs up, he is required to sign a waiver and is warned about the intensity of this plan. Still he signs up. The next morning, waiting at the door, is a hulking 300 pound muscle man with nothing but a pair of running shoes, a raging erection, and a sign around his neck that says, \"If I catch you, you're mine!\" The man was supposed to lose 25 pounds in the week; he lost 34.",
        "likes": "7356",
        "dislikes": "1597",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face.",
        "likes": "35034",
        "dislikes": "8280",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "Roses are red.",
        "likes": "30252",
        "dislikes": "5756",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "A teacher wanted to teach her students about self-esteem, so she asked anyone who thought they were stupid to stand up. One kid stood up and the teacher was surprised. She didn’t think anyone would stand up so she asked him, “Why did you stand up?” He answered, “I didn’t want to leave you standing up by yourself.”",
        "likes": "13577",
        "dislikes": "1723",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "Kid 1: \"Hey, I bet you're still a virgin.\"",
        "likes": "12232",
        "dislikes": "6022",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "Don't break anybody's heart; they only have 1. Break their bones; they have 206.",
        "likes": "2905",
        "dislikes": "985",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "Yo momma is so fat she uses a pillow for a tampon.",
        "likes": "2335",
        "dislikes": "1683",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "It was Christmas Eve. A woman came home to her husband after a day of busy shopping. Later on that night when she was getting undressed for bed, he noticed a mark on the inside of her leg. \"What is that?\" he asked. She said, \"I visited the tattoo parlor today. On the inside of one leg I had them tattoo 'Merry Christmas,' and on the inside of the other one they tattooed 'Happy New Year.'\" Perplexed, he asked, \"Why did you do that?\" \"Well,\" she replied, \"now you can't complain that there's never anything to eat between Christmas and New Years!\"",
        "likes": "5758",
        "dislikes": "2235",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "How is Christmas like your job? You do all the work and the fat guy in the suit gets all the credit.",
        "likes": "3635",
        "dislikes": "1799",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "On Thanksgiving day, a little boy overhears his mom and dad fighting. He hears his mom call his dad a bastard and hears his dad call his mom a bitch. He asks, \"Mommy, what does bastard mean?\" She answers, \"Um, it means boy.\" Then he asks, \"Daddy, what does bitch mean?\" He says, \"Uh, it means girl.\" Later that day, the boy sees his father in the bathroom shaving; the dad accidentally cuts himself and says, \"Sh*t.\" The son asks, \"What does that mean?\" The dad says, \"It means shaving cream.\" Then he sees his mom in the kitchen carving the turkey; she accidentally cuts herself and says, \"F*ck.\" The son asks her what that word means and she says, \"It means carving.\" That evening, the family's guests arrive for Thanksgiving dinner. The son opens the door to welcome them and says, \"Welcome bitches and bastards! My dad is in the bathroom rubbing sh*t on his face and my mom is in the kitchen f*cking the turkey.\"",
        "likes": "3384",
        "dislikes": "568",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "A teacher is teaching a class and she sees that Johnny isn't paying attention, so she asks him, \"If there are three ducks sitting on a fence, and you shoot one, how many are left?\" Johnny says, \"None.\" The teacher asks, \"Why?\" Johnny says, \"Because the shot scared them all off.\" The teacher says, \"No, two, but I like how you're thinking.\" Johnny asks the teacher, \"If you see three women walking out of an ice cream parlor, one is licking her ice cream, one is sucking her ice cream, and one is biting her ice cream, which one is married?\" The teacher says, \"The one sucking her ice cream.\" Johnny says, \"No, the one with the wedding ring, but I like how you're thinking!\"",
        "likes": "65432",
        "dislikes": "9864",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face.",
        "likes": "35034",
        "dislikes": "8280",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"",
        "likes": "12706",
        "dislikes": "4052",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "A blonde, a redhead, and a brunette were all lost in the desert. They found a lamp and rubbed it. A genie popped out and granted them each one wish. The redhead wished to be back home. Poof! She was back home. The brunette wished to be at home with her family. Poof! She was back home with her family. The blonde said, \"Awwww, I wish my friends were here.\"",
        "likes": "25987",
        "dislikes": "4132",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "Reporter: \"Excuse me, may I interview you?\"",
        "likes": "41427",
        "dislikes": "14980",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Yo momma so dumb, she tried to surf the microwave",
        "likes": "874",
        "dislikes": "2086",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "How many snowboarders does it take to screw in a lightbulb? 50: 3 to die trying, 1 to actually pull it off, and 46 other to say, \"man, I could do that!\"",
        "likes": "1452",
        "dislikes": "1063",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "It's game 7 of the NBA finals and a man makes his way to his seat at center court. He sits down and notices that the seat next to him is empty. He leans over and asks his neighbor if someone is sitting there. He responds, \"No, the seat's empty.\" \"The first man exclaims, \"What?!? Who in their right mind would have a seat like this for the NBA finals and not use it?\" The neighbor responds, \"Well the seat is mine, but my wife passed away and this is the first NBA finals we haven't been together.\" The first man responds,\" I'm sorry to hear that. Wasn't there anyone else, a friend or relative, that could've taken that seat?\" The neighbor responds, \"No, they're all at the funeral.\"",
        "likes": "1306",
        "dislikes": "472",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "Golfer: \"Do you think my game is improving?\"",
        "likes": "1135",
        "dislikes": "288",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "A man asks, “God, why did you make woman so beautiful?” God responded, ”So you would love her.” The man asks, “But God, why did you make her so dumb?” God replied, “So she would love you.”",
        "likes": "4888",
        "dislikes": "1394",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "Girl: \"Girls are better than boys.\"",
        "likes": "4624",
        "dislikes": "3812",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "A man is lying on the beach, wearing nothing but a cap over his crotch. A woman passing by remarks, \"If you were any sort of a gentleman, you would lift your hat to a lady.\" He replies, \"If you were any sort of a sexy lady, the hat would lift by itself.\"",
        "likes": "4430",
        "dislikes": "791",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "Yo momma is so fat, I took a picture of her last Christmas and it's still printing.",
        "likes": "129416",
        "dislikes": "35291",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "What happens to a frog's car when it breaks down?",
        "likes": "26159",
        "dislikes": "12214",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "A teacher is teaching a class and she sees that Johnny isn't paying attention, so she asks him, \"If there are three ducks sitting on a fence, and you shoot one, how many are left?\" Johnny says, \"None.\" The teacher asks, \"Why?\" Johnny says, \"Because the shot scared them all off.\" The teacher says, \"No, two, but I like how you're thinking.\" Johnny asks the teacher, \"If you see three women walking out of an ice cream parlor, one is licking her ice cream, one is sucking her ice cream, and one is biting her ice cream, which one is married?\" The teacher says, \"The one sucking her ice cream.\" Johnny says, \"No, the one with the wedding ring, but I like how you're thinking!\"",
        "likes": "65432",
        "dislikes": "9864",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "I asked a Chinese girl for her number. She said, \"Sex! Sex! Sex! Free sex tonight!\" I said, \"Wow!\" Then her friend said, \"She means 666-3629.\"",
        "likes": "59751",
        "dislikes": "22609",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "Reporter: \"Excuse me, may I interview you?\"",
        "likes": "41427",
        "dislikes": "14980",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "Mr. and Mrs. Brown had two sons. One was named Mind Your Own Business & the other was named Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, \"What are you doing?\" \"Playing a game,\" the boy replied. \"What is your name?\" the officer questioned. \"Mind Your Own Business.\" Furious the policeman inquired, \"Are you looking for trouble?!\" The boy replied, \"Why, yes.\"",
        "likes": "14872",
        "dislikes": "3134",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "A woman gets on a bus with her baby. The bus driver says, \"That's the ugliest baby that I've ever seen. Ugh!\" The woman goes to the rear of the bus and sits down, fuming. She says to a man next to her, \"The driver just insulted me!\" The man says, \"You go right up there and tell him off – go ahead, I'll hold your monkey for you.\"",
        "likes": "8840",
        "dislikes": "3284",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "A boy asks his father, \"Dad, are bugs good to eat?\" \"That's disgusting. Don't talk about things like that over dinner,\" the dad replies. After dinner the father asks, \"Now, son, what did you want to ask me?\" \"Oh, nothing,\" the boy says. \"There was a bug in your soup, but now it’s gone.\"",
        "likes": "7427",
        "dislikes": "1780",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "Q: Why did the witches' team lose the baseball game?",
        "likes": "6692",
        "dislikes": "3992",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "An elderly couple are in church. The wife leans over and whispers to her husband, \"I just let out a long, silent fart. What should I do?\" The husband replies, \"First off, replace the batteries in your hearing aid!\"",
        "likes": "6157",
        "dislikes": "1889",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "Q: Why couldn't the leopard play hide and seek?",
        "likes": "5740",
        "dislikes": "2565",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "Q: What starts with E, ends with E, and has only 1 letter in it?",
        "likes": "5453",
        "dislikes": "2635",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "There was an elderly couple who in their old age noticed that they were getting a lot more forgetful, so they decided to go to the doctor. The doctor told them that they should start writing things down so they don't forget. They went home and the old lady told her husband to get her a bowl of ice cream. \"You might want to write it down,\" she said. The husband said, \"No, I can remember that you want a bowl of ice cream.\" She then told her husband she wanted a bowl of ice cream with whipped cream. \"Write it down,\" she told him, and again he said, \"No, no, I can remember: you want a bowl of ice cream with whipped cream.\" Then the old lady said she wants a bowl of ice cream with whipped cream and a cherry on top. \"Write it down,\" she told her husband and again he said, \"No, I got it. You want a bowl of ice cream with whipped cream and a cherry on top.\" So he goes to get the ice cream and spends an unusually long time in the kitchen, over 30 minutes. He comes out to his wife and hands her a plate of eggs and bacon. The old wife stares at the plate for a moment, then looks at her husband and asks, \"Where's the toast?\"",
        "likes": "5283",
        "dislikes": "2101",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "Do not be racist; be like Mario. He's an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew!",
        "likes": "48790",
        "dislikes": "14607",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Scientists have proven that there are two things in the air that have been known to cause women to get pregnant: their legs.",
        "likes": "2631",
        "dislikes": "2426",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Q: Why can't you trust an atom?",
        "likes": "2223",
        "dislikes": "761",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "I just read a book about Helium. It was so good that I can't put it down.",
        "likes": "1761",
        "dislikes": "1562",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Q: Why shouldn't you make fun of a paleontologist?",
        "likes": "1674",
        "dislikes": "1005",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Sarah goes to school, and the teacher says, \"Today we are going to learn multi-syllable words, class. Does anybody have an example of a multi-syllable word?\" Sarah waves her hand, \"Me, Miss Rogers, me, me!\" Miss Rogers says, \"All right, Sarah, what is your multi-syllable word?\" Sarah says, \"Mas-tur-bate.\" Miss Rogers smiles and says, \"Wow, Sarah, that's a mouthful.\" Sarah says, \"No, Miss Rogers, you're thinking of a blowjob.\"",
        "likes": "13283",
        "dislikes": "4101",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "Kid 1: \"Hey, I bet you're still a virgin.\"",
        "likes": "12232",
        "dislikes": "6022",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "A teacher asked her students to use the word \"beans\" in a sentence. \"My father grows beans,\" said one girl. \"My mother cooks beans,\" said a boy. A third student spoke up, \"We are all human beans.\"",
        "likes": "10732",
        "dislikes": "5579",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "Q: What do you call a baptized Mexican?",
        "likes": "2390",
        "dislikes": "1303",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "Mother superior tells two new nuns that they have to paint their room without getting any paint on their clothes. One nun suggests to the other, \"Hey, let's take all our clothes off, fold them up, and lock the door.\" So they do this, and begin painting their room. Soon they hear a knock at the door. They ask, \"Who is it?\" \"Blind man!\" The nuns look at each other and one nun says, \"He's blind, so he can't see. What could it hurt?\" They let him in. The blind man walks in and says, \"Hey, nice tits. Where do you want me to hang the blinds?\"",
        "likes": "2264",
        "dislikes": "494",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "Yo mama is so ugly when the devil saw her, he started praying.",
        "likes": "2117",
        "dislikes": "582",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes"
    },
    {
        "joke": "Bob was in trouble. He forgot his wedding anniversary. His wife was really angry. She told him \"Tomorrow morning, I expect to find a gift in the driveway that goes from 0 to 200 in 6 seconds AND IT BETTER BE THERE!\" The next morning he got up early and left for work. When his wife woke up, she looked out the window and sure enough there was a box gift-wrapped in the middle of the driveway. Confused, the wife put on her robe and ran out to the driveway, brought the box back in the house. She opened it and found a brand new bathroom scale. Bob has been missing since Friday.",
        "likes": "6770",
        "dislikes": "1754",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "Girlfriend: \"Am I pretty or ugly?\"",
        "likes": "6394",
        "dislikes": "1121",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"",
        "likes": "5868",
        "dislikes": "1883",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "A husband exclaims to his wife one day, \"Your butt is getting really big. It's bigger than the BBQ grill!\" Later that night in bed, the husband makes some advances towards his wife who completely brushes him off. \"What's wrong?\" he asks. She answers, \"Do you really think I'm going to fire up this big-ass grill for one little weenie?\"",
        "likes": "5521",
        "dislikes": "976",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"",
        "likes": "49180",
        "dislikes": "13061",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face.",
        "likes": "35034",
        "dislikes": "8280",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "What happens to a frog's car when it breaks down?",
        "likes": "26159",
        "dislikes": "12214",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "Q: Is Google male or female?",
        "likes": "19417",
        "dislikes": "7837",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "Teacher: \"If I gave you 2 cats and another 2 cats and another 2, how many would you have?\"",
        "likes": "16856",
        "dislikes": "3359",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "Reporter: \"Excuse me, may I interview you?\"",
        "likes": "41427",
        "dislikes": "14980",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "A black Jewish boy runs home from school one day and asks his father, “Daddy, am I more Jewish or more black?” The dad replies, “Why do you want to know, son?” “Because a kid at school is selling a bike for $50 and I want to know if I should talk him down to $40 or just steal it!”",
        "likes": "31038",
        "dislikes": "10449",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "How do you blindfold a Chinese person?\r\nPut floss over their eyes.",
        "likes": "29885",
        "dislikes": "14891",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "A black boy walks into the kitchen where his mother is baking and accidentally pulls the flour over onto his head. He turns to his mother and says, “Look Mama, I’m a white boy!” His mother smacks him and says, “Go tell your Daddy what you just said!” The boy finds his father and says, “Look Daddy, I’m a white boy!” His Daddy bends him over, spanks him, stands the boy back up, and says, “Now, what do you have to say for yourself?” The boy replies, “I’ve only been a white boy for five minutes and I already hate you black people!”",
        "likes": "27653",
        "dislikes": "5667",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "Q: Why did Adele cross the road?",
        "likes": "3832",
        "dislikes": "2257",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "A little boy goes to his dad and asks, \"What is politics?\" The dad says, \"Well son, let me try to explain it this way: I'm the breadwinner of the family, so let's call me capitalism. Your mother, she's the administrator of the money, so we'll call her the government. We're here to take care of your needs, so we'll call you the people. The nanny, we'll consider her the working class. And your baby brother, we'll call him the future. Now, think about that and see if that makes sense.\" The little boy goes off to bed thinking about what dad had said. Later that night, he hears his baby brother crying, so he gets up to check on him. He finds that the baby has soiled his diaper. The little boy goes to his parents' room and finds his mother sound asleep. Not wanting to wake her, he goes to the nanny's room. Finding the door locked, he peeks in the keyhole and sees his father in bed with the nanny. He gives up and goes back to bed. The next morning, the little boy says to his father, \"Dad, I think I understand the concept of politics now.\" The father says, \"Good son, tell me in your own words what you think politics is all about.\" The little boy replies, \"Well, while capitalism is screwing the working class, the government is sound asleep, the people are being ignored and the future is in deep shit.\"",
        "likes": "1859",
        "dislikes": "331",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Q: Why is England the wettest country?",
        "likes": "1467",
        "dislikes": "1862",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "When asked if they would have sex with Bill Clinton, 86% of women in D.C. said, \"Not again.\"",
        "likes": "1352",
        "dislikes": "261",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Q: How many politicians does it take to change a light bulb?",
        "likes": "1321",
        "dislikes": "651",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "Did you hear about Monica Lewinsky becoming a Republican? The Democrats left a bad taste in her mouth.",
        "likes": "970",
        "dislikes": "485",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "We used to have Reagan, Jonny Cash, and Bob Hope. Now we have Obama, no cash, and no hope.",
        "likes": "927",
        "dislikes": "580",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes"
    },
    {
        "joke": "A lawyer runs a stop sign and gets pulled over by a sheriff. He thinks he's smarter being a big shot lawyer from New York and has a better education than an sheriff from West Virginia. The sheriff asks for license and registration. The lawyer asks, \"What for?\" The sheriff responds, \"You didn't come to a complete stop at the stop sign.\" The lawyer says, \"I slowed down and no one was coming.\" \"You still didn't come to a complete stop. License and registration please,\" say the sheriff impatiently. The lawyer says, \"If you can show me the legal difference between slow down and stop, I'll give you my license and registration and you can give me the ticket. If not, you let me go and don't give me the ticket.\" The sheriff says, \"That sounds fair, please exit your vehicle.\" The lawyer steps out and the sheriff takes out his nightstick and starts beating the lawyer with it. The sheriff says, \"Do you want me to stop or just slow down?\"",
        "likes": "2535",
        "dislikes": "389",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "Two factory workers are talking. The woman says, \"I can make the boss give me the day off.\" The man replies, \"And how would you do that?\" The woman says, \"Just wait and see.\" She then hangs upside down from the ceiling. The boss comes in and says, \"What are you doing?\" The woman replies, \"I'm a light bulb.\" The boss then says, \"You've been working so much that you've gone crazy. I think you need to take the day off.\" The man starts to follow her and the boss says, \"Where are you going?\" The man says, \"I'm going home, too. I can't work in the dark.\"",
        "likes": "2098",
        "dislikes": "312",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "A doctor reaches into his smock to get a pen to write a prescription and pulls out a rectal thermometer. \"Oh, damn it,\" he proclaims, \"Some asshole has my pen!\"",
        "likes": "1825",
        "dislikes": "535",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "A thief stuck a pistol in a man's ribs and said, \"Give me your money.\" The gentleman, shocked by the sudden attack, said, \"You cannot do this, I'm a congressman!\" The thief replied, \"In that case, give me MY money!\"",
        "likes": "1274",
        "dislikes": "277",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "How do you starve a black person? Put their food stamp card under their workboots!",
        "likes": "7859",
        "dislikes": "7374",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "Q: How does a black girl tell if she is pregnant? A: When she pulls the tampon out all the cotton is picked.",
        "likes": "7325",
        "dislikes": "3832",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "A worldwide survey was conducted by the UN. The only question asked was: \"Would you please give your honest opinion about solutions to the food shortage in the rest of the world?\" The survey was a huge failure. In Africa they didn't know what \"food\" meant. In Eastern Europe they didn't know what \"honest\" meant. In Western Europe they didn't know what \"shortage\" meant. In China they didn't know what \"opinion\" meant. In the Middle East they didn't know what \"solution\" meant. In South America they didn't know what \"please\" meant. And in the USA they didn't know what \"the rest of the world\" meant.",
        "likes": "3302",
        "dislikes": "965",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Q: What do you call a baptized Mexican?",
        "likes": "2390",
        "dislikes": "1303",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Q: Why do Chinese people have Chinese babies?",
        "likes": "6004",
        "dislikes": "1584",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"",
        "likes": "5868",
        "dislikes": "1883",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "Whenever your ex says, \"You'll never find someone like me,\" the answer to that is, \"That's the point.\"",
        "likes": "9875",
        "dislikes": "1992",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "Bob was in trouble. He forgot his wedding anniversary. His wife was really angry. She told him \"Tomorrow morning, I expect to find a gift in the driveway that goes from 0 to 200 in 6 seconds AND IT BETTER BE THERE!\" The next morning he got up early and left for work. When his wife woke up, she looked out the window and sure enough there was a box gift-wrapped in the middle of the driveway. Confused, the wife put on her robe and ran out to the driveway, brought the box back in the house. She opened it and found a brand new bathroom scale. Bob has been missing since Friday.",
        "likes": "6770",
        "dislikes": "1754",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "Girlfriend: \"Am I pretty or ugly?\"",
        "likes": "6394",
        "dislikes": "1121",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "Light travels faster than sound. This is why some people appear bright until you hear them speak.",
        "likes": "6357",
        "dislikes": "1662",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"",
        "likes": "5868",
        "dislikes": "1883",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "An old teacher asked her student, \"If I say, 'I am beautiful,' which tense is that?\" The student replied, \"It is obviously past.\"",
        "likes": "5414",
        "dislikes": "724",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "If you ever fart in public, just yell, \"Turbo power!\" and walk faster.",
        "likes": "2247",
        "dislikes": "519",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "Interviewer: \"What's your greatest weakness?\"",
        "likes": "1754",
        "dislikes": "463",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "Q: Can February march?",
        "likes": "3125",
        "dislikes": "1226",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "Yo momma is so short, when she went to meet Santa he said, \"Go back to work!\"",
        "likes": "2690",
        "dislikes": "1066",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "Q: What is the difference between Tiger Woods and Santa Claus?",
        "likes": "2624",
        "dislikes": "1215",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "A little kids sends a letter to Santa that says: \"Dear Santa I want a brother for Christmas.\"\r\n\r\nSanta writes back, \"Dear Timmy send me me your mommy.\"",
        "likes": "2374",
        "dislikes": "919",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "A teacher asked her students to use the word \"beans\" in a sentence. \"My father grows beans,\" said one girl. \"My mother cooks beans,\" said a boy. A third student spoke up, \"We are all human beans.\"",
        "likes": "10732",
        "dislikes": "5579",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "A man kills a deer and takes it home to cook for dinner. Both he and his wife decide that they won't tell the kids what kind of meat it is, but will give them a clue and let them guess. The dad said, \"Well it's what Mommy calls me sometimes.\" The little girl screamed to her brother, \"Don't eat it. Its an asshole!",
        "likes": "9503",
        "dislikes": "1781",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "A boy asks his father, \"Dad, are bugs good to eat?\" \"That's disgusting. Don't talk about things like that over dinner,\" the dad replies. After dinner the father asks, \"Now, son, what did you want to ask me?\" \"Oh, nothing,\" the boy says. \"There was a bug in your soup, but now it’s gone.\"",
        "likes": "7427",
        "dislikes": "1780",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "Q: Why did the can crusher quit his job?",
        "likes": "3785",
        "dislikes": "1725",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "Q: What do you call stoned Mexicans?",
        "likes": "3553",
        "dislikes": "1534",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "Blonde: \"What does IDK stand for?\"",
        "likes": "20840",
        "dislikes": "4430",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "Two blondes fell down a hole. One said, \"It's dark in here isn't it?\" The other replied, \"I don't know; I can't see.\"",
        "likes": "20797",
        "dislikes": "3528",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "There was a blonde, a redhead, and a brunette. They were all trapped on an island and the nearest shore was 50 miles away. The redhead swam trying to make it to the other shore she swam 15 miles, drowned, and died. The brunette swam 24 miles, drowned, and died. The blonde swam 25 miles, got tired, and swam back.",
        "likes": "17523",
        "dislikes": "3424",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "Q: Why can't a blonde dial 911?",
        "likes": "17283",
        "dislikes": "3680",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, \"I will go to the market and see if I can find one for under that amount.  If I can, I will send you a telegram.\"  She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word \"comfortable.\" Skeptical, the operator asks, \"How will she know to come with the trailer from just that word?\" The redhead replies, \"She's a blonde so she reads slow: 'Come for ta bull.'\"",
        "likes": "13115",
        "dislikes": "4558",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "What happens to a frog's car when it breaks down?",
        "likes": "26159",
        "dislikes": "12214",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Q: What did the duck say when he bought lipstick?",
        "likes": "16623",
        "dislikes": "9512",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, \"I will go to the market and see if I can find one for under that amount.  If I can, I will send you a telegram.\"  She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word \"comfortable.\" Skeptical, the operator asks, \"How will she know to come with the trailer from just that word?\" The redhead replies, \"She's a blonde so she reads slow: 'Come for ta bull.'\"",
        "likes": "13115",
        "dislikes": "4558",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"",
        "likes": "12706",
        "dislikes": "4052",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Me: Would you like to be the sun in my life?",
        "likes": "1799",
        "dislikes": "795",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "Teacher: How much is a gram?",
        "likes": "901",
        "dislikes": "1514",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "Why are frogs always so happy?                                     They eat what ever bugs them",
        "likes": "1329",
        "dislikes": "942",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "Some guy called me a tool. So I got hammered and nailed his girlfriend. Guess he was right.",
        "likes": "1188",
        "dislikes": "786",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "I went down the street to a 24-hour grocery store. When I got there, the guy was locking the front door. I said, \"Hey! The sign says you're open 24 hours.\" He Said, \"Yes, but not in a row!\"",
        "likes": "549",
        "dislikes": "1020",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "A football coach walked into the locker room before a game, looked over to his star player and said, \"I'm not supposed to let you play since you failed math, but we need you in there. So what I have to do is ask you a math question, and if you get it right, you can play.\" The player agreed, and the coach looked into his eyes intently and asks, \"Okay, now concentrate... what is two plus two?\" The player thought for a moment and then he answered, \"4?\" \"Did you say 4?!?\" the coach exclaimed, excited that he got it right. At that, all the other players on the team began screaming, \"Come on coach, give him another chance!\"",
        "likes": "1093",
        "dislikes": "283",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "One day, a man came home and was greeted by his wife dressed in stunningly sexy lingerie. \"Tie me up,\" she purred, \"And you can do anything you want.\" So he tied her up and went golfing.",
        "likes": "1083",
        "dislikes": "265",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes"
    },
    {
        "joke": "A man is being arrested by a female police officer, who informs him, \"Anything you say can and will be held against you.\" The man replies, \"Boobs!\"",
        "likes": "4281",
        "dislikes": "954",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "A tough looking group of hairy bikers are riding when they see a girl about to jump off a bridge, so they stop. The leader, a big burly man, gets off his bike and says, \"What are you doing?\" \"I'm going to commit suicide,\" she says. While he doesn’t want to appear insensitive, he also doesn’t want to miss an opportunity, so he asks, \"Well, before you jump, why don't you give me a kiss?\" She does, and it is a long, deep, lingering kiss. After she's finished, the tough, hairy biker says, \"Wow! That was the best kiss I’ve ever had! That's a real talent you’re wasting. You could be famous. Why are you committing suicide?\" \"My parents don't like me dressing up like a girl…\"",
        "likes": "4161",
        "dislikes": "729",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "For all the guys who think a woman's place is in the kitchen, remember that's where the knives are kept.",
        "likes": "3855",
        "dislikes": "2813",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "A boy asks his dad, “What’s the difference between potential and realistic?” The dad tells him to go ask the rest of his family if they’d sleep with Brad Pitt for a million dollars, and then he’d tell him the answer. The boy goes up to his mom and asks her. She responds, “A million dollars is a lot of money sweetheart. I could send you, your sister, and your brother to great colleges, so sure, I would!” He then goes and asks his sister to which she replies, “Brad Pitt? Hell ya, he’s the hottest guy ever!” Next, the boy asks his brother who replies, “A million dollars? Hell yes I would. I’d be rich!” When the boy excitedly returns to his dad with the family’s responses, the dad says, “Well son, potentially, we have three million dollars. Realistically, we have two sluts and a queer.”",
        "likes": "3597",
        "dislikes": "653",
        "title": "Sexist Jokes",
        "link": "http://www.laughfactory.com/jokes/sexist-jokes"
    },
    {
        "joke": "Yo momma is so fat when she got on the scale it said, \"I need your weight not your phone number.\"",
        "likes": "106164",
        "dislikes": "32265",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo momma is so fat that when she went to the beach a whale swam up and sang, \"We are family, even though you're fatter than me.\"",
        "likes": "80262",
        "dislikes": "35116",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo mamma is so ugly when she tried to join an ugly contest they said, \"Sorry, no professionals.\"",
        "likes": "76453",
        "dislikes": "26882",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo momma's so fat and old when God said, \"Let there be light,\" he asked your mother to move out of the way.",
        "likes": "64209",
        "dislikes": "26595",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo momma's so fat, that when she fell, no one was laughing but the ground was cracking up.",
        "likes": "62228",
        "dislikes": "15682",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, \"I will go to the market and see if I can find one for under that amount.  If I can, I will send you a telegram.\"  She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word \"comfortable.\" Skeptical, the operator asks, \"How will she know to come with the trailer from just that word?\" The redhead replies, \"She's a blonde so she reads slow: 'Come for ta bull.'\"",
        "likes": "13115",
        "dislikes": "4558",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"",
        "likes": "12706",
        "dislikes": "4052",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "Why did I get divorced? Well, last week was my birthday. My wife didn't wish me a happy birthday. My parents forgot and so did my kids. I went to work and even my colleagues didn't wish me a happy birthday. As I entered my office, my secretary said, \"Happy birthday, boss!\" I felt so special. She asked me out for lunch. After lunch, she invited me to her apartment. We went there and she said, \"Do you mind if I go into the bedroom for a minute?\" \"Okay,\" I said. She came out 5 minutes later with a birthday cake, my wife, my parents, my kids, my friends, & my colleagues all yelling, \"SURPRISE!!!\" while I was waiting on the sofa... naked.",
        "likes": "25960",
        "dislikes": "4270",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "A 3 years old boy sits near a pregnant woman.",
        "likes": "5235",
        "dislikes": "1110",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "Wife: \"In my dream, I saw you in a jewelry store and you bought me a diamond ring.\"",
        "likes": "5015",
        "dislikes": "1873",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "One day Jimmy got home early from school and his mom asked, \"Why are you home so early?\" He answered, \"Because I was the only one that answered a question in my class.\" She said, \"Wow, my son is a genius. What was the question?\" Jimmy replied, \"The question was 'Who threw the trash can at the principal's head?'\"",
        "likes": "4370",
        "dislikes": "822",
        "title": "Family Jokes",
        "link": "http://www.laughfactory.com/jokes/family-jokes"
    },
    {
        "joke": "Yo momma is so fat, when she sat on an iPod, she made the iPad!",
        "likes": "18918",
        "dislikes": "8521",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Want to hear a Potassium joke? K.",
        "likes": "1156",
        "dislikes": "1018",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Q. What do clouds do when they become rich?",
        "likes": "1093",
        "dislikes": "541",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Helium walks into a bar and asks for a drink. The bartender says, \"Sorry, we don't serve noble gases here.\" Helium doesn't react.",
        "likes": "1078",
        "dislikes": "522",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Molecule 1: I just lost an electron.",
        "likes": "1010",
        "dislikes": "289",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Little Sally came home from school with a smile on her face, and told her mother, \"Frankie Brown showed me his weenie today at the playground!\" Before the mother could raise a concern, Sally went on to say, \"It reminded me of a peanut.\" Relaxing with a hidden smile, Sally's mom asked, \"Really small, was it?\" Sally replied, \"No, salty.\" Mom fainted.",
        "likes": "9431",
        "dislikes": "1893",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "At school, Little Johnny's classmate tells him that most adults are hiding at least one dark secret, so it's very easy to blackmail them by saying, \"I know the whole truth.\" Little Johnny decides to go home and try it out.",
        "likes": "9262",
        "dislikes": "1465",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "In a Catholic school cafeteria, a nun places a note in front of a pile of apples, \"Only take one. God is watching.\" Further down the line is a pile of cookies. A little boy makes his own note, \"Take all you want. God is watching the apples.\"",
        "likes": "6854",
        "dislikes": "1505",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "A science teacher tells his class, \"Oxygen is a must for breathing and life. It was discovered in 1773.\" A blonde student responds, \"Thank God I was born after 1773! Otherwise I would have died without it.\"",
        "likes": "5942",
        "dislikes": "2005",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "Q: Did you hear about the kidnapping at school?",
        "likes": "5893",
        "dislikes": "2420",
        "title": "School Jokes",
        "link": "http://www.laughfactory.com/jokes/school-jokes"
    },
    {
        "joke": "Wife: \"In my dream, I saw you in a jewelry store and you bought me a diamond ring.\"",
        "likes": "5015",
        "dislikes": "1873",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "A wife comes home late one night and quietly opens the door to her bedroom. From under the blanket, she sees four legs instead of just her husband's two. She reaches for a baseball bat and starts hitting the blanket as hard as she can. Once she's done, she goes to the kitchen to have a drink. As she enters, she sees her husband there, reading a magazine. He says, \"Hi darling, your parents have come to visit us, so I let them stay in our bedroom. Did you say hello?\"",
        "likes": "4997",
        "dislikes": "690",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "Ralph is driving home one evening, when he suddenly realizes that it's his daughter's birthday and he hasn't bought her a present. He drives to the mall, runs to the toy store, and says to the shop assistant, \"How much is that Barbie in the window?\" In a condescending manner, she says, \"Which Barbie?\" She continues, \"We have Barbie Goes to the Gym for $19.95, Barbie Goes to the Ball for $19.95, Barbie Goes Shopping for $19.95, Barbie Goes to the Beach for $19.95, Barbie Goes Nightclubbing for $19.95, and Divorced Barbie for $265.00.\" Ralph asks, \"Why is the Divorced Barbie $265.00 when all the others are only $19.95?\" \"That's obvious,\" the saleslady says. \"Divorced Barbie comes with Ken's house, Ken's car, Ken's boat, Ken's furniture...\"",
        "likes": "3236",
        "dislikes": "511",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "Q: What did the duck say when he bought lipstick?",
        "likes": "16623",
        "dislikes": "9512",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "Mr. and Mrs. Brown had two sons. One was named Mind Your Own Business & the other was named Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, \"What are you doing?\" \"Playing a game,\" the boy replied. \"What is your name?\" the officer questioned. \"Mind Your Own Business.\" Furious the policeman inquired, \"Are you looking for trouble?!\" The boy replied, \"Why, yes.\"",
        "likes": "14872",
        "dislikes": "3134",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, \"I will go to the market and see if I can find one for under that amount.  If I can, I will send you a telegram.\"  She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word \"comfortable.\" Skeptical, the operator asks, \"How will she know to come with the trailer from just that word?\" The redhead replies, \"She's a blonde so she reads slow: 'Come for ta bull.'\"",
        "likes": "13115",
        "dislikes": "4558",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "Kid 1: \"Hey, I bet you're still a virgin.\"",
        "likes": "12232",
        "dislikes": "6022",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "A teacher asked her students to use the word \"beans\" in a sentence. \"My father grows beans,\" said one girl. \"My mother cooks beans,\" said a boy. A third student spoke up, \"We are all human beans.\"",
        "likes": "10732",
        "dislikes": "5579",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "There is a black man, a white man, and a Mexican man on a plane that is too heavy to fly and they are about to crash. They each have to throw something off the plane to save them from crashing. The black man throws out his Jordan shoes and says, \"We have too many in our country.” The Mexican tosses out his lawn mower and says, \"We have too many in our country.” The white man puts his item down, grabs the Mexican, throws him out the window and says, \"We have too many in our country.”",
        "likes": "21639",
        "dislikes": "7220",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "What is a Mexican's favorite sport? Cross-country.",
        "likes": "20581",
        "dislikes": "6231",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "Yo momma so stupid she thought Bruno Mars was a planet.",
        "likes": "2646",
        "dislikes": "711",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "Q: What is the difference between Tiger Woods and Santa Claus?",
        "likes": "2624",
        "dislikes": "1215",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "Yo momma's so fat, the Hogwarts Sorting Hat put her in all 4 houses!",
        "likes": "1927",
        "dislikes": "1339",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "Yo mama so ugly the Terminator said, \"I won't be back.\"",
        "likes": "1777",
        "dislikes": "564",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "A boss said to his secretary, \"I want to have sex with you, but I will make it very fast. I'll throw $1,000 on the floor and by the time you bend down to pick it up, I'll be done.\" She thought for a moment then called her boyfriend and told him the story. Her boyfriend said, \"Do it but ask him for $2,000. Then pick up the money so fast, he won't even have enough time to undress himself.\" She agrees. After half an hour passes, the boyfriend calls the girlfriend and asks, \"So what happened?\" She responds, \"The bastard used coins, so I'm still picking it up and he is still having sex with me!\"",
        "likes": "1119",
        "dislikes": "386",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "A doctor and a lawyer are talking at a party.\r\n\r\nTheir conversation is constantly interrupted by people describing their ailments and asking the doctor for free medical advice.\r\n\r\nAfter an hour of this, the exasperated doctor asks the lawyer, \"What do you do to stop people from asking you for legal advice when you're out of the office?\"\r\n\r\n\"I give it to them,\" replies the lawyer, \"and then I send them a bill.\"\r\n\r\nThe doctor is shocked, but agrees to give it a try.\r\n\r\nThe next day, still feeling slightly guilty, the doctor prepares the bills.\r\n\r\nWhen he goes to place them in his mailbox, he finds a bill from the lawyer.",
        "likes": "805",
        "dislikes": "127",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "Three doctors are discussing which types of patients they prefer. Doctor Watson says, ''I prefer librarians. All their organs are alphabetized.'' Doctor Fitzpatrick says, ''I prefer mathematicians. All their organs are numbered.'' Doctor Ahn says, ''I prefer lawyers. They’re gutless, heartless, brainless, spineless, and their heads and rear-ends are interchangeable.''",
        "likes": "751",
        "dislikes": "193",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "A lawyer is standing in a long line at the box office. Suddenly, he feels a pair of hands kneading his shoulders, back, and neck. The lawyer turns around. \"What the hell do you think you're doing?\" \"I'm a chiropractor, and I'm just keeping in practice while I'm waiting in line.\" \"Well, I'm a lawyer, but you don't see me screwing the guy in front of me, do you?\"",
        "likes": "702",
        "dislikes": "467",
        "title": "Office Jokes",
        "link": "http://www.laughfactory.com/jokes/office-jokes"
    },
    {
        "joke": "I was at my bank today waiting in a short line. There was just one lady in front of me, an Asian lady, who was trying to exchange yen for dollars. It was obvious she was a little irritated. She asked the teller, \"Why it change? Yesterday, I get two hunat dolla of yen. Today I only get hunat eighty? Why it change?\"\r\n\r\nThe teller shrugged his shoulders and said, \"Fluctuations.\" The Asian lady says, \"Fluc you white people too!\"",
        "likes": "2394",
        "dislikes": "801",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "An old man takes his grandson fishing in a local pond one day. After 20 minutes of fishing, the old man fires up a cigar. The young boy asks, \"Grandpa, can I have a cigar?\" The old man asks, \"Son, can your d*ck touch your asshole?\" The young boy says no. \"Then u can't have a cigar.\" Another 20 minutes passes, and the old man opens a beer. The young boy asks, \"Grandpa, can I have a beer?\" The old man asks, \"Son, can your d*ck touch your asshole?\" The young boy says no. \"Well, then u can't have a beer.\" Another 20 minutes passes, and the young boy opens a bag of potato chips. The old man asks, \"Son, can I have some of your chips?\" The boy asks, \"Well, Grandpa, can your d*ck touch your asshole?\" The old man says, \"It sure can.\" The boy says, \"Well good, then go f*ck yourself, these are my chips.\"",
        "likes": "1789",
        "dislikes": "330",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "A German asks a Mexican if they have any Jews in Mexico. The Mexican says, “Sí, we have orange jews, apple jews, and grape jews!”",
        "likes": "2044",
        "dislikes": "630",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "In the beginning, God created the heaven and the earth... After that, everything else was made in China.",
        "likes": "1778",
        "dislikes": "479",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Q: Why couldn't the leopard play hide and seek?",
        "likes": "5740",
        "dislikes": "2565",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "Q: What starts with E, ends with E, and has only 1 letter in it?",
        "likes": "5453",
        "dislikes": "2635",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "Girl: \"Girls are better than boys.\"",
        "likes": "4624",
        "dislikes": "3812",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes"
    },
    {
        "joke": "A kid from Mississippi is on Harvard campus for the first time, he stops a student and asks, \"Excuse me, can you tell me where the library is at?\" The Harvard student replies \"At Harvard, you don’t end a sentence with a preposition.\" The kid said, \"Sorry about that. Can you tell me where the library is at, asshole?\"",
        "likes": "1708",
        "dislikes": "286",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "How to be Insulting in Theaters: If the person sitting in front of you is blocking your view, try adopting an irritating cough, or kicking your feet under their seat. Nasty, wet sneezes down the back of their neck are also effective in persuading them to look elsewhere for a seat.",
        "likes": "1515",
        "dislikes": "911",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "Mother: \"Sweetie, make a Christmas wish.\"",
        "likes": "2094",
        "dislikes": "538",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "Yo momma is so stupid when I told her Christmas is right around the corner she went looking for it.",
        "likes": "1840",
        "dislikes": "1174",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "Q: Why is Santa Claus' sack so big? A: He only comes once a year.",
        "likes": "1472",
        "dislikes": "961",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "Q: Why are ghosts bad liars?",
        "likes": "876",
        "dislikes": "464",
        "title": "Holiday Jokes",
        "link": "http://www.laughfactory.com/jokes/holiday-jokes"
    },
    {
        "joke": "Q: Why do hamburgers go to the gym A: To get better buns!",
        "likes": "2757",
        "dislikes": "1435",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "Q. How much room is needed for fungi to grow?",
        "likes": "2428",
        "dislikes": "1324",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "Q: What do you call a baptized Mexican?",
        "likes": "2390",
        "dislikes": "1303",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes"
    },
    {
        "joke": "A guy took his blonde girlfriend to her first football game. They had great seats right behind their team's bench. After the game, he asked her how she liked the experience.\r\n\r\n\"Oh, I really liked it,\" she replied, \"especially the tight pants and all the big muscles, but I just couldn't understand why they were killing each other over 25 cents.\"\r\n\r\nDumbfounded, her date asked, \"What do you mean?\"\r\n\r\n\"Well, they flipped a coin, one team got it, and then for the rest of the game, all they kept screaming was, 'Get the quarterback! Get the quarterback!' I'm like, hello? It's only 25 cents!\"",
        "likes": "13060",
        "dislikes": "2093",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "A robber comes into the store & steals a TV. A blonde runs after him and says, \"Wait, you forgot the remote!\"",
        "likes": "10737",
        "dislikes": "2115",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "There was a blonde who just got sick and tired of all the blonde jokes. One evening, she went home and memorized all the state capitals.\r\n\r\nBack in the office the next day, some guy started telling a dumb blonde joke. She interrupted him with a shrill announcement, \"I've had it up to here with these blonde jokes. I want you to know that this blonde went home last night and did something probably none of you could do. I memorized all the state capitals.\"\r\n\r\nOne of the guys, of course, said, \"I don't believe you. What is the capital of Nevada?\" \"N,\" she answered.",
        "likes": "9384",
        "dislikes": "1920",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "Q: Can a kangaroo jump higher than the Empire State Building?",
        "likes": "7410",
        "dislikes": "3340",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Q: Why did the witches' team lose the baseball game?",
        "likes": "6692",
        "dislikes": "3992",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Q: Why couldn't the leopard play hide and seek?",
        "likes": "5740",
        "dislikes": "2565",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Q. What did the elephant say to the naked man? A. \"How do you breathe through something so small?\"",
        "likes": "5243",
        "dislikes": "3315",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Yo mama is so ugly she made my happy meal cry",
        "likes": "924",
        "dislikes": "1077",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "I couldn't figure out why the baseball kept getting larger. Then it hit me.",
        "likes": "1093",
        "dislikes": "568",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "Boy: The principal is so dumb!",
        "likes": "1618",
        "dislikes": "425",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "A blonde drops off her dress to the dry cleaners",
        "likes": "1044",
        "dislikes": "694",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "Beer Bottle: You break me, you get 1 year of bad luck!",
        "likes": "991",
        "dislikes": "532",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "Yo momma is so fat when she sat on WalMart, she lowered the prices.",
        "likes": "56512",
        "dislikes": "17151",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo momma is so stupid when an intruder broke   into her house, she ran downstairs, dialed 9-1-1 on the microwave, and couldn't find the \"CALL\" button.",
        "likes": "47599",
        "dislikes": "18716",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo momma is so fat that Dora can't even explore her!",
        "likes": "46158",
        "dislikes": "16636",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Your momma is so ugly she made One Direction go another direction.",
        "likes": "43695",
        "dislikes": "18635",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo momma is so fat her bellybutton gets home 15 minutes before she does.",
        "likes": "40699",
        "dislikes": "12975",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "Yo momma's so stupid, she put two quarters in her ears and thought she was listening to 50 Cent.",
        "likes": "37075",
        "dislikes": "13743",
        "title": "Yo Momma Jokes",
        "link": "http://www.laughfactory.com/jokes/yo-momma-jokes"
    },
    {
        "joke": "A teacher asked her students to use the word \"beans\" in a sentence. \"My father grows beans,\" said one girl. \"My mother cooks beans,\" said a boy. A third student spoke up, \"We are all human beans.\"",
        "likes": "10732",
        "dislikes": "5579",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "Q: Why was six scared of seven?",
        "likes": "8554",
        "dislikes": "7939",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "Q: Can a kangaroo jump higher than the Empire State Building?",
        "likes": "7410",
        "dislikes": "3340",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "A little girl and boy are fighting about the differences between the sexes, and which one is better. Finally, the boy drops his pants and says, “Here’s something I have that you’ll never have!” The little girl is pretty upset by this, since it is clearly true, and runs home crying. A while later, she comes running back with a smile on her face. She drops her pants and says, “My mommy says that with one of these, I can have as many of those as I want!”",
        "likes": "20642",
        "dislikes": "4139",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "A boy says to a girl, \"So, sex at my place?\" \"Yeah!\" \"Okay, but I sleep in a bunk bed with my younger brother, and he thinks we're making sandwiches, so we have to have a code. Cheese means faster and tomato means harder, okay?\" Later on the girl is yelling, \"Cheese cheese, tomato tomato!\" The younger brother says, \"Stop making sandwiches! You're getting mayo all over my bed!\"",
        "likes": "17232",
        "dislikes": "3414",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "After picking her son up from school one day, the mother asks him what he did at school. The kid replies, \"I had sex with my teacher.\" She gets so mad that when they get home, she orders him to go straight to his room. When the father returns home that evening, the mother angrily tells him the news of what their son had done. As the father hears the news, a huge grin spreads across his face. He walks to his son's room and asks him what happened at school, the son tells him, \"I had sex with my teacher.\" The father tells the boy that he is so proud of him, and he is going to reward him with the bike he has been asking for. On the way to the store, the dad asks his son if he would like to ride his new bike home. His son responds, \"No thanks Dad, my butt still hurts.\"",
        "likes": "16380",
        "dislikes": "8291",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\"",
        "likes": "10508",
        "dislikes": "4284",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Q: Why couldn't the blonde add 10 + 5 on a calculator?",
        "likes": "6862",
        "dislikes": "5945",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Your momma is so stupid she put airbags on her computer in case it crashed.",
        "likes": "5638",
        "dislikes": "1478",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Yo momma so fat when she registered for MySpace there was no space left.",
        "likes": "3123",
        "dislikes": "959",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Q: What do computers eat for a snack?",
        "likes": "2337",
        "dislikes": "1278",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Mother: \"Sweetie, make a Christmas wish.\"",
        "likes": "2094",
        "dislikes": "538",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "When Magnesium and Oxygen started dating I was like, \"O MG!\"",
        "likes": "879",
        "dislikes": "351",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "Q: Why are Helium, Curium, and Barium the medical elements?",
        "likes": "695",
        "dislikes": "172",
        "title": "Science Jokes",
        "link": "http://www.laughfactory.com/jokes/science-jokes"
    },
    {
        "joke": "A married man was having an affair with his secretary. One day, their passions overcame them in the office and they took off for her house. Exhausted from the afternoon's activities, they fell asleep and awoke at around 8 p.m. As the man threw on his clothes, he told the woman to take his shoes outside and rub them through the grass and dirt. Confused, she nonetheless complied and he slipped into his shoes and drove home. \"Where have you been?\" demanded his wife when he entered the house. \"Darling,\" replied the man, \"I can't lie to you. I've been having an affair with my secretary. I fell asleep in her bed and didn't wake up until eight o'clock.\" The wife glanced down at his shoes and said, \"You liar! You've been playing golf!\"",
        "likes": "3231",
        "dislikes": "487",
        "title": "Relationship Jokes",
        "link": "http://www.laughfactory.com/jokes/relationship-jokes"
    },
    {
        "joke": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\"",
        "likes": "10508",
        "dislikes": "4284",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes"
    },
    {
        "joke": "A black guy walks into a bar with a parrot on his shoulder and asks for a beer. The bartender brings a beer and notices the parrot on his shoulder and says, \"Hey that's really neat. Where did you get it?\" The parrot responds, \"In the jungle, there's millions of them.\"",
        "likes": "14386",
        "dislikes": "5677",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "There was a redneckwho hit every black man he saw with his truck. One day he saw a priest walking down the road and thought, \"For all the bad things I done, let me give this priest a ride.\" So he picked the priest up and they drove along. The redneck saw a black guy down the road and decided he would pretend to fall asleep and so the priest would think it was an accident. The redneck closed his eyes and heard a loud bang. \"What happened?\" he asked. \"You missed him,\" the priest said, \"but I got him with the door.\"",
        "likes": "13288",
        "dislikes": "3879",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "How do you get the little black kids to stop jumping on the bed? Put Velcro on the ceiling. How do you get them down? Tell the Mexican kids it's a piñata.",
        "likes": "12466",
        "dislikes": "4484",
        "title": "Racist Jokes",
        "link": "http://www.laughfactory.com/jokes/racist-jokes"
    },
    {
        "joke": "The energizer bunny was arrested on a charge of battery.",
        "likes": "1576",
        "dislikes": "930",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "So a man dies, goes to Heaven, and sees St. Peter. There are many clocks surrounding him so the man asks, \"What are these clocks for?\" St. Peter replies, \"These are lie clocks, they tick once for every lie you tell. Here we have Mother Teresa's clock. She has never lied so the clock has not moved. Honest Abe has only lied twice in his life, so it has only ticked twice.\" The man then asks, \"So where is George Bush's clock?\" St. Peter replies, \"Oh, that is in Jesus' office, he is using it as a ceiling fan!\"",
        "likes": "1358",
        "dislikes": "376",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "Q: How does Albus get into Hogwarts?",
        "likes": "1258",
        "dislikes": "1081",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "Jill goes home one night with a guy she met at a club. He's tall, super hot, and seems different than most guys she meets. They arrive at his place and head straight to his room. Jill can't help but notice a shelf full of teddy bears. On the bottom are small teddy bears, on the middle are medium-sized teddy bears, and finally, on the top are large teddy bears, all lined up beside each other. She begins to think that he is sentimental and sweet, and isn't afraid to show it. Her heart melts and she want to give him the best night of his life. She gives him a bl*wjob, and lets him really give it to her, and even takes it in the rear! In the morning, she slowly gets dressed, and smiles at him and asks, \"How was that?\" He nods and says, \"Not too f*ckin' bad at all. Help yourself to a prize on the second shelf!\"",
        "likes": "1130",
        "dislikes": "354",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "What happens if a Asian with an erection walks into a wall?",
        "likes": "1116",
        "dislikes": "314",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "Helen Keller walks into a bar, then a table, then a chair.",
        "likes": "1067",
        "dislikes": "876",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "Q: What's the difference between England and a teabag?",
        "likes": "1652",
        "dislikes": "704",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "So two Irishmen are traveling to Australia. Before they leave home, one of their dads gives them both a bit of advice: \"You watch them Aussie cab drivers. They'll rob you blind. Don't you go paying them what they ask. You haggle.\" At the Sydney airport, the Irishmen catch a cab to their hotel. When they reach their destination, the cabbie says, \"That'll be twenty dollars, lads.\" \"Oh no you don't! My dad warned me about you. You'll only be getting fifteen dollars from me,\" says one of the men. \"And you'll only be getting fifteen from me too,\" adds the other.",
        "likes": "1623",
        "dislikes": "663",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "Q: What’s the best thing about Switzerland?",
        "likes": "1520",
        "dislikes": "678",
        "title": "National Jokes",
        "link": "http://www.laughfactory.com/jokes/national-jokes"
    },
    {
        "joke": "There was an elderly couple who in their old age noticed that they were getting a lot more forgetful, so they decided to go to the doctor. The doctor told them that they should start writing things down so they don't forget. They went home and the old lady told her husband to get her a bowl of ice cream. \"You might want to write it down,\" she said. The husband said, \"No, I can remember that you want a bowl of ice cream.\" She then told her husband she wanted a bowl of ice cream with whipped cream. \"Write it down,\" she told him, and again he said, \"No, no, I can remember: you want a bowl of ice cream with whipped cream.\" Then the old lady said she wants a bowl of ice cream with whipped cream and a cherry on top. \"Write it down,\" she told her husband and again he said, \"No, I got it. You want a bowl of ice cream with whipped cream and a cherry on top.\" So he goes to get the ice cream and spends an unusually long time in the kitchen, over 30 minutes. He comes out to his wife and hands her a plate of eggs and bacon. The old wife stares at the plate for a moment, then looks at her husband and asks, \"Where's the toast?\"",
        "likes": "5283",
        "dislikes": "2101",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "A 3 years old boy sits near a pregnant woman.",
        "likes": "5235",
        "dislikes": "1110",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "Q: Why did Adele cross the road?",
        "likes": "3832",
        "dislikes": "2257",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes"
    },
    {
        "joke": "How to be insulting when giving directions: Point with four fingers when they ask.",
        "likes": "1241",
        "dislikes": "911",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "Some guy called me a tool. So I got hammered and nailed his girlfriend. Guess he was right.",
        "likes": "1188",
        "dislikes": "786",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "How to be Insulting at Christmas: Try to find what you were given last year and give it back to the person who gave it to you.",
        "likes": "1128",
        "dislikes": "368",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "Fun fact: If you cut off all your body hair and laid it end to end you'd be a fucking weirdo.",
        "likes": "633",
        "dislikes": "314",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "How to be Insulting on Public Transportation: Pretend to be foreign when the conductor asks for your fare and try to give him the wrong denomination of money.",
        "likes": "576",
        "dislikes": "352",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting"
    },
    {
        "joke": "A guy was driving in a car with a blonde. He told her to stick her head out the window and see if the blinker worked. She stuck her head out and said, \"Yes, No, Yes, No, Yes...\"",
        "likes": "9209",
        "dislikes": "1851",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "There are 11 people hanging onto a rope that comes down from an airplane. 10 of them are blonde, and one is a brunette. They all decide that one person should get off because if they don't, the rope will break and everyone will die. No one can decide who should go, so finally the brunette delivers a very touching speech, ending with the words, \"I'll get off.\" The blondes, all moved by the brunette's speech, start clapping. Problem solved.",
        "likes": "8064",
        "dislikes": "1313",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "A blonde, wanting to earn some money, decided to hire herself out as a handyman-type and started canvassing a wealthy neighborhood. She went to the front door of the first house and asked the owner if he had any jobs for her to do.\r\n\r\n\"Well, you can paint my porch. How much will you charge?\"\r\nThe blonde said, \"How about 50 dollars?\" The man agreed and told her that the paint and ladders that she might need were in the garage. The man's wife, inside the house, heard the conversation and said to her husband, \"Does she realize that the porch goes all the way around the house?\"\r\nThe man replied, \"She should. She was standing on the porch.\"\r\n\r\nA short time later, the blonde came to the door to collect her money.\r\n\"You're finished already?\" he asked. \"Yes,\" the blonde answered, \"and I had paint left over, so I gave it two coats. \"Impressed, the man reached in his pocket for the $50. \"And by the way,\" the blonde added, \"that's not a Porch, it's a Ferrari.\"",
        "likes": "7819",
        "dislikes": "1305",
        "title": "Blonde Jokes",
        "link": "http://www.laughfactory.com/jokes/blonde-jokes"
    },
    {
        "joke": "Q: How do you count cows?",
        "likes": "4865",
        "dislikes": "2186",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Late one night a burglar broke into a house and while he was sneaking around he heard a voice say, \"Jesús is watching you.\" He looked around and saw nothing. He kept on creeping and again heard, \"Jesús is watching you.\" In a dark corner, he saw a cage with a parrot inside. The burglar asked the parrot, \"Was it you who said Jesús is watching me\" The parrot replied, \"Yes.\" Relieved, the burglar asked, \"What is your name?\" The parrot said, \"Clarence.\" The burglar said, \"That's a stupid name for a parrot. What idiot named you Clarence?\" The parrot answered, \"The same idiot that named the rottweiler Jesús.\"",
        "likes": "4099",
        "dislikes": "1566",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Yo mama so stupid, she tried to save a fish from drowning.",
        "likes": "3678",
        "dislikes": "994",
        "title": "Animal Jokes",
        "link": "http://www.laughfactory.com/jokes/animal-jokes"
    },
    {
        "joke": "Yo mama so fat, she doesn't need internet, she's already worldwide.",
        "likes": "582",
        "dislikes": "737",
        "title": "Latest Jokes",
        "link": "http://www.laughfactory.com/jokes/latest-jokes"
    },
    {
        "joke": "Instead of \"the John,\" I call my toilet \"the Jim.\" That way it sounds better when I say I go to the Jim first thing every morning.",
        "likes": "6372",
        "dislikes": "1570",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "Q: Did you hear about the kidnapping at school?",
        "likes": "5893",
        "dislikes": "2420",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"",
        "likes": "5868",
        "dislikes": "1883",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "Q: Why couldn't the leopard play hide and seek?",
        "likes": "5740",
        "dislikes": "2565",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "Q: What starts with E, ends with E, and has only 1 letter in it?",
        "likes": "5453",
        "dislikes": "2635",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "A man and woman had been married for 30 years, and in those 30 years, they always left the lights off when having sex. He was embarrassed and scared that he couldn't please her, so he always used a big dildo on her. All these years she had no clue. One day, she decided to reach over and flip the light switch on and saw that he was using a dildo. She said \"I knew it, asshole, explain the dildo!\" He said, \"Explain the kids!\"",
        "likes": "14868",
        "dislikes": "3251",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "Maria went home happy, telling her mother about how she earned $20 by climbing a tree. Her mom responded, \"Maria, they just wanted to see your panties!\" Maria replied, \"See Mom, I was smart, I took them off!\"",
        "likes": "14415",
        "dislikes": "3005",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "Sarah goes to school, and the teacher says, \"Today we are going to learn multi-syllable words, class. Does anybody have an example of a multi-syllable word?\" Sarah waves her hand, \"Me, Miss Rogers, me, me!\" Miss Rogers says, \"All right, Sarah, what is your multi-syllable word?\" Sarah says, \"Mas-tur-bate.\" Miss Rogers smiles and says, \"Wow, Sarah, that's a mouthful.\" Sarah says, \"No, Miss Rogers, you're thinking of a blowjob.\"",
        "likes": "13283",
        "dislikes": "4101",
        "title": "Sex Jokes",
        "link": "http://www.laughfactory.com/jokes/sex-jokes"
    },
    {
        "joke": "The energizer bunny was arrested on a charge of battery.",
        "likes": "1576",
        "dislikes": "930",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "I named my hard drive \"dat ass,\" so once a month my computer asks if I want to \"back dat ass up.\"",
        "likes": "1440",
        "dislikes": "413",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Q: What computer sings the best?",
        "likes": "1101",
        "dislikes": "466",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Q: What's Forrest Gump’s password?",
        "likes": "844",
        "dislikes": "390",
        "title": "Technology Jokes",
        "link": "http://www.laughfactory.com/jokes/technology-jokes"
    },
    {
        "joke": "Q: What computer sings the best?",
        "likes": "1101",
        "dislikes": "466",
        "title": "Pop Culture Jokes",
        "link": "http://www.laughfactory.com/jokes/pop-culture-jokes"
    },
    {
        "joke": "A man siting at a bar asked a pretty woman sitting next to him, Excuse me, but can I smell your pussy?\" \"Get away from me, you pervert,\" she replied. \"Oh, I'm sorry,\" exclaims the man, \"It must be your feet.\"",
        "likes": "1062",
        "dislikes": "1256",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "Q: What did the cannibal do after dumping his girlfriend?",
        "likes": "977",
        "dislikes": "1047",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "Four gay guys are sitting in a Jacuzzi when all of a sudden, a condom starts floating. One of the gay guys turns around and asks, \"Okay, who farted?\"",
        "likes": "928",
        "dislikes": "336",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "So this dude comes home from work one day, and his wife is watching the Food Network. The husband asks, \"Why do you watch that? You still cant cook,\" and the wife responds, \"Why do you watch porn? You still cant f*ck.\"",
        "likes": "902",
        "dislikes": "147",
        "title": "Boycott These Jokes",
        "link": "http://www.laughfactory.com/jokes/boycott-these-jokes"
    },
    {
        "joke": "Q: What is the difference between snowmen and snowwomen?",
        "likes": "4867",
        "dislikes": "1380",
        "title": "Word Play Jokes",
        "link": "http://www.laughfactory.com/jokes/word-play-jokes"
    },
    {
        "joke": "Mahatma Gandhi often walked barefoot which produced an impressive set of callouses on his feet. He also ate very little, making him rather frail and with his odd diet he often suffered from bad breath. This made him a super calloused fragile mystic hexed with halitosis.",
        "likes": "794",
        "dislikes": "899",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "If Mary had Jesus, and Jesus is the lamb of God, does that mean Mary had a little lamb?",
        "likes": "1936",
        "dislikes": "951",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "Yo mama so fat the bears have to hide their food from her when she goes camping.",
        "likes": "1910",
        "dislikes": "873",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "How to be insulting at the library: Find the coziest reading nook and start snoring.",
        "likes": "526",
        "dislikes": "253",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "After numerous rounds of, \"We don't know if Osama is still alive,\" Osama himself decided to send Ted Kennedy a letter in his own handwriting to let him know he was still in the game. Kennedy opened the letter which appeared to contain a single line of coded message, 370HSSV-0773H. Kennedy was baffled, so he e-mailed it to John Kerry. Kerry and his aides had no clue either, so they sent it to the FBI. Noone could solve it at the FBI, so it went to the CIA, then to the NSA. With no clue as to its meaning, the FBI finally asked Marine Corps Intelligence for help. Within a few seconds the Marine Corps cabled back with this reply, \"Tell Kennedy he's holding the message upside down.\"",
        "likes": "572",
        "dislikes": "68",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "What happens when you give a politician Viagra? He gets taller.",
        "likes": "500",
        "dislikes": "521",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "Monica Lewinsky walks into the dry cleaners. The old man behind the counter is hard of hearing and doesn't understand her request, so he says, \"Come again.\" Monica responds, \"No, this time it's mustard.\"",
        "likes": "476",
        "dislikes": "233",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "George W. Bush and his VP running mate, Dick Cheney, were talking, when George W. said, \"I hate all the dumb jokes people tell about me.\" Wise Old Cheney, feeling sorry for his old boss, said sage-like, \"Oh, they are only jokes. There are a lot of stupid people out there. Here, I'll prove it to you.\" Cheney took George W. outside and hailed a taxi driver. \"Please take me to 29 Nickel Street to see if I'm home,\" said Cheney. The cab driver, without saying a word, drove them to Nickel Street, and when they finally got out, Cheney looked at George W. and said, \"See! That guy was really stupid!\" \"No kidding,\" replied George W., \"There was a pay phone just around the corner. You could have called instead.\"",
        "likes": "469",
        "dislikes": "515",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "A man is lying on the beach, wearing nothing but a cap over his crotch. A woman passing by remarks, \"If you were any sort of a gentleman, you would lift your hat to a lady.\" He replies, \"If you were any sort of a sexy lady, the hat would lift by itself.\"",
        "likes": "4430",
        "dislikes": "791",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "Jesus, Moses, and an old man go golfing. The first one to tee off is Moses. He smashes the ball and it is heading right for the water hazard before the green. Moses raises his club, the water parts, and the ball makes it to the green. Jesus gets up to swing, cranks it out, and it is headed for the water hazard. Jesus closes his eyes and prays. The ball skips across the water and lands on the green two feet from the hole. The old man's turn comes and he drives the ball. The ball looks like it is going to drop directly into the water. A fish jumps from the water hazard swallowing the ball, as an eagle drops from the sky, grabbing the fish. As the eagle flies over the green, a bolt of lightning strikes the eagle, making it drop the fish. As the fish hits the green, it spits out the ball and the ball falls into the hole, making a hole in one. Jesus looks at Moses and says, \"I really think I'm leaving Dad at home next time!\"",
        "likes": "1554",
        "dislikes": "375",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "A nun and a priest were crossing the Sahara desert on a camel. On the third day out the camel suddenly dropped dead without warning. After dusting themselves off, the nun and the priest surveyed their situation. After a long period of silence, the priest spoke. \"Well sister, this looks pretty grim.\" \"I know, father.\" \"In fact, I don't think it likely that we can survive more than a day or two.\" \"I agree.\" \"Sister, since we are unlikely to make it out of here alive, would you do something for me?\" \"Anything father.\" \"I have never seen a woman's breasts and I was wondering if I might see yours.\" \"Well, under the circumstances I don't see that it would do any harm.\" The nun opened her habit and the priest enjoyed the sight of her shapely breasts, commenting frequently on their beauty. \"Sister would you mind if I touched them?\" She consented and he fondled them for several minutes. \"Father, could I ask something of you?\" \"Yes sister?\" \"I have never seen a man's penis. Could I see yours?\" \"I supposed that would be OK,\" the priest replied lifting his robe. \"Oh father, may I touch it?\" This time the priest consented and after a few minutes of fondling he was sporting a huge erection. \"Sister, you know that if I insert my penis in the right place, it can give life.\" \"Is that true father?\" \"Yes it is, sister.\" \"Then why don't you stick it up that camel's ass and lets get the hell out of here.\"",
        "likes": "1503",
        "dislikes": "259",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "An old man goes to a church, and is making a confession:",
        "likes": "1491",
        "dislikes": "742",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "Two little boys were known troublemakers, stealing everything they could get their hands, even from the church. One day a priest stopped one of the boys and asked, \"Where is God?\" The boy shrugged and the priest repeated, \"Where is God?\" The boy ran out of the cathedral crying to his home where he hid in a closet. Eventually his brother found him and asked, \"What's wrong?\" The crying boy replied, \"We're in trouble now! God is missing and they think we took him!\"",
        "likes": "1385",
        "dislikes": "430",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "A priest, a minister, and a rabbi want to see who’s best at his job. So they each go into the woods, find a bear, and attempt to convert it. Later they get together. The priest begins: “When I found the bear, I read to him from the Catechism and sprinkled him with holy water. Next week is his first communion.” “I found a bear by the stream,” says the minister, “and preached God’s holy word. The bear was so mesmerized that he let me baptize him.” They both look down at the rabbi, who is lying on a gurney in a body cast. “Looking back,” he says, “maybe I shouldn't have started with the circumcision.”",
        "likes": "1289",
        "dislikes": "621",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "A drunk staggers into a Catholic Church, enters a confessional booth, sits down, but says nothing. The Priest coughs a few times to get his attention, but the drunk continues to sit there. Finally, the Priest pounds three times on the wall. The drunk mumbles, \"Ain't no use knockin'! There's no paper on this side either!\"",
        "likes": "1240",
        "dislikes": "394",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "Four nuns are in line to go into heaven. God asks the first nun if she has ever sinned. She says, \"Well, I've seen a penis.\" So God puts holy water on her eyes and lets her enter. He asks the second nun the same thing and she says, \"I've held a penis,\" so he puts holy water on her hands and lets her enter. Then the fourth nun skips the third nun in line and God asks why she did that. The 4th nun replies, \"Well, I need to gargle it before she sits in it.\"",
        "likes": "1112",
        "dislikes": "318",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "During lunch at work, I ate 3 plates of beans (which I know I shouldn't). When I got home, my husband seemed excited to see me and exclaimed delightedly, \"Darling I have a surprise for dinner tonight.\" He then blindfolded me and led me to my chair at the dinner table. I took a seat and just as he was about to remove my blindfold, the telephone rang. He made me promise not to touch the blindfold until he returned and went to answer the call. The beans I had consumed were still affecting me and the pressure was becoming unbearable, so while my husband was out of the room I seized the opportunity, shifted my weight to one leg and let one go. It was not only loud, but it smelled like a fertilizer truck running over a skunk in front of a garbage dump! I took my napkin from my lap and fanned the air around me vigorously. Then, shifting to the other leg, I ripped off three more. The stink was worse than cooked cabbage. Keeping my ears carefully tuned to the conversation in the other room, I went on releasing atomic bombs like this for another few minutes. The pleasure was indescribable! Eventually the telephone farewells signaled the end of my freedom, so I quickly fanned the air a few more times with my napkin, placed it on my lap and folded my hands back on it feeling very relieved and pleased with myself. My face must have been the picture of innocence when my husband returned, apologizing for taking so long. He asked me if I had peaked through the blindfold, and I assured him I had not. At this point, he removed the blindfold, and twelve dinner guests seated around the table, with their hands to their noses, chorused, \"Happy Birthday!\"",
        "likes": "3600",
        "dislikes": "476",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Q: Why was six scared of seven?",
        "likes": "8554",
        "dislikes": "7939",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Golfer: \"I'd move heaven & earth to break 100 on this course.\" Caddy: \"Try heaven; you've already moved most of the earth.\"",
        "likes": "1022",
        "dislikes": "234",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Q: If you have 13 apples in one hand and 10 oranges in the other, what do you have?",
        "likes": "1802",
        "dislikes": "787",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "Your Halloween costume came in the mail today. I opened it. It was a rooster mask and a bag of lollipops. Going as a c*ck sucker again!?",
        "likes": "1707",
        "dislikes": "951",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "Scientists have discovered a food that diminishes a woman's sex drive by 90%. It's called a wedding cake.",
        "likes": "1547",
        "dislikes": "578",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "How to be Insulting at Christmas: Refuse to give any guests a drink, on the grounds that it's for their own good not to drink and drive. Have plenty of soft drinks to offer them though. Then pour yourself a large Scotch, on the grounds that you aren't going anywhere and don't have to worry.",
        "likes": "402",
        "dislikes": "114",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting in Church: Sing out of tune in all the hymns and try singing half a line behind everyone else.",
        "likes": "398",
        "dislikes": "196",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting in Theaters: Noisy wrappings on sweets can be unwrapped at moments of tension when the rest of the theatre is silent.",
        "likes": "397",
        "dislikes": "114",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting in the Street: Walk along as if you have stepped in something unpleasant, by pretending to scrape your feet along the pavement, or rubbing your soles on any available patches of grass. Then look daggers at anyone walking a dog.",
        "likes": "350",
        "dislikes": "130",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "Q: What do you call a lawyer who has gone bad?",
        "likes": "468",
        "dislikes": "518",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "Bill Clinton is no longer playing the saxophone. He is now playing the whore-Monica.",
        "likes": "468",
        "dislikes": "408",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "Bill Clinton and the Pope both died on the same day. Due to a minor clerical error, the Pope went to Hell, while Clinton went to Heaven. When the Pope arrived in Hell, everyone realized the mistake. Due to an issue with the union, they couldn't swap the two until the next day, and the Pope had to spend the night in Hell, while Clinton spent the night in Heaven. The next day the paperwork got worked out. On his way up to Heaven, the Pope ran into Clinton. Clinton asked the Pope, \"How was your night in Hell?\" \"Very educational,\" responded the Pope. \"I've learned a lot from the experience, but now I'm glad I'm going to Heaven. I've been waiting all my life to meet the Virgin Mary.\" \"Ooh, sorry,\" said Clinton, \"you should have been there yesterday.\"",
        "likes": "447",
        "dislikes": "193",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "The NSA: a government organization that actually listens to you!",
        "likes": "428",
        "dislikes": "121",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "Did you hear about the two bald guys who put their heads together? They made an ass out of themselves!",
        "likes": "3892",
        "dislikes": "1539",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "A wife asked her husband, \"What do you like most in me, my pretty face or my sexy body?\" He looked at her from head to toe and replied, \"I like your sense of humor!\"",
        "likes": "3803",
        "dislikes": "627",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "A mother said to her son, \"Look at that kid over there; he's not misbehaving.\" The son replied, \"Maybe he has good parents then!\"",
        "likes": "3770",
        "dislikes": "935",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "My friend told me he had the body of a Greek god. I had to explain to him that Buddha is not Greek.",
        "likes": "3473",
        "dislikes": "1368",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "A worldwide survey was conducted by the UN. The only question asked was: \"Would you please give your honest opinion about solutions to the food shortage in the rest of the world?\" The survey was a huge failure. In Africa they didn't know what \"food\" meant. In Eastern Europe they didn't know what \"honest\" meant. In Western Europe they didn't know what \"shortage\" meant. In China they didn't know what \"opinion\" meant. In the Middle East they didn't know what \"solution\" meant. In South America they didn't know what \"please\" meant. And in the USA they didn't know what \"the rest of the world\" meant.",
        "likes": "3302",
        "dislikes": "965",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "Q: What kind of car does Jesus drive?",
        "likes": "1033",
        "dislikes": "1315",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "A Sunday school teacher asked her children on the way to service, \"And why is it necessary to be quiet in church?\" One little girl replied, \"Because people are sleeping.\"",
        "likes": "1014",
        "dislikes": "147",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "Contest in a girl's college: write a short story which contains religion, sex and mystery.",
        "likes": "1011",
        "dislikes": "278",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "Q: Why do Jewish mothers make great parole officers?",
        "likes": "935",
        "dislikes": "1645",
        "title": "Religious Jokes",
        "link": "http://www.laughfactory.com/jokes/religious-jokes/2"
    },
    {
        "joke": "There was this guy at a bar, just looking at his drink. He stays like that for a half hour. Then a big trouble making truck driver steps next to him, takes the drink from the guy, & just drinks it all down. The poor man starts crying. The truck driver says, \"Come on man, I was just joking. Here, I'll buy you another drink. I just can't stand to see a man cry.\" \"No, it's not that,\" the man replies, wiping his tears, \"This day is the worst of my life. First, I oversleep & I go in late to my office. My outraged boss fires me. When I leave the building to go to my car, I find out it was stolen. The police say they can do nothing. I get a cab to go home, & when I get out, I remember I left my wallet. The cab driver just drives away. I go inside my house where I find my wife in bed with the gardener. I leave my home, come to this bar, & just when I was thinking about putting an end to my life, you show up & drink my poison.\"",
        "likes": "3387",
        "dislikes": "849",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "On their way to get married, a young Catholic couple is involved in a fatal car accident. The couple found themselves sitting outside the Pearly Gates waiting for St. Peter to process them into Heaven. While waiting, they began to wonder: Could they possibly get married in Heaven? When St. Peter showed up, they asked him. St. Peter said, \"I don't know. This is the first time anyone has asked. Let me go find out,'\" and he left. The couple sat and waited, and waited. Two months passed and the couple were still waiting. While waiting, they began to wonder what would happen if it didn't work out; could you get a divorce in heaven? After yet another month, St. Peter finally returned, looking somewhat bedraggled. \"Yes,\" he informed the couple, \"You can get married in Heaven.\" \"Great!\" said the couple, \"But we were just wondering, what if things don't work out? Could we also get a divorce in Heaven?\" St. Peter, red-faced with anger, slammed his clipboard onto the ground. \"What's wrong?\" asked the frightened couple. \"OH, COME ON!,\" St. Peter shouted, \"It took me three months to find a priest up here! Do you have any idea how long it'll take me to find a lawyer?\"",
        "likes": "3266",
        "dislikes": "1014",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Q: Can February march?",
        "likes": "3125",
        "dislikes": "1226",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Two guys are walking through a game park & they come across a lion that has not eaten for days. The lion starts chasing the two men. They run as fast as they can and the one guy starts getting tired and decides to say a prayer, \"Please turn this lion into a Christian, Lord.\" He looks to see if the lion is still chasing and he sees the lion on its knees. Happy to see his prayer answered, he turns around and heads towards the lion. As he comes closer to the lion, he hears the it saying a prayer: \"Thank you Lord for the food I am about to receive.\"",
        "likes": "3007",
        "dislikes": "606",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "A boy asks his father, \"Dad, are bugs good to eat?\" \"That's disgusting. Don't talk about things like that over dinner,\" the dad replies. After dinner the father asks, \"Now, son, what did you want to ask me?\" \"Oh, nothing,\" the boy says. \"There was a bug in your soup, but now it’s gone.\"",
        "likes": "7427",
        "dislikes": "1780",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Q: Can a kangaroo jump higher than the Empire State Building?",
        "likes": "7410",
        "dislikes": "3340",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Q: Why couldn't the blonde add 10 + 5 on a calculator?",
        "likes": "6862",
        "dislikes": "5945",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "In a Catholic school cafeteria, a nun places a note in front of a pile of apples, \"Only take one. God is watching.\" Further down the line is a pile of cookies. A little boy makes his own note, \"Take all you want. God is watching the apples.\"",
        "likes": "6854",
        "dislikes": "1505",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "If at first you don't succeed, skydiving is not for you!",
        "likes": "979",
        "dislikes": "351",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "A Giants fan, a Padre fan, and a Dodger fan are climbing a mountain and arguing about who loves his team more. The Padre fan insists he's the most loyal. \"This is for San Diego!\" he yells and jumps off the side of the mountain. Not to be outdone, the Giants fan is next to profess his love for his team. He yells, \"This is for San Francisco!\" and pushes the Dodger fan off the mountain.",
        "likes": "977",
        "dislikes": "182",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "The huge college freshman decided to try out for the football team. \"Can you tackle?\" asked the coach. \"Watch this,\" said the freshman, who proceeded to run smack into a telephone pole, shattering it to splinters. \"Wow,\" said the coach. \"I'm impressed. Can you run?\" \"Of course I can run,\" said the freshman. He was off like a shot, and, in just over nine seconds, he had run a hundred yard dash. \"Great!\" enthused the coach. \"But can you pass a football?\" The freshman hesitated for a few seconds. \"Well, sir,\" he said, \"if I can swallow it, I can probably pass it.\"",
        "likes": "951",
        "dislikes": "132",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Q: What has eight arms and an IQ of 60?",
        "likes": "775",
        "dislikes": "1061",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Q: Why do the French eat snails?",
        "likes": "1381",
        "dislikes": "365",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "An Italian mother says, \"If you don't eat all the food on this plate, I'll kill you.\" A Jewish mother says, \"If you don't eat all the food on this plate, I'll kill myself.\"",
        "likes": "1339",
        "dislikes": "2165",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "Q: What do cats eat for breakfast?",
        "likes": "1247",
        "dislikes": "1088",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "Yo momma so fat her favorite food is seconds.",
        "likes": "1126",
        "dislikes": "787",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "Q: How come oysters never donate to charity?",
        "likes": "988",
        "dislikes": "496",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "Q: What do you call a sad coffee?",
        "likes": "976",
        "dislikes": "404",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "How to be Insulting in the Street: Approach a complete stranger as if you are about to welcome them warmly, but instead walk straight past and disappear into a shop.",
        "likes": "297",
        "dislikes": "97",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting on the Beach: Sit by the water with a fishing rod, and throw revolting lumps of old bread into the water where the children are enjoying themselves.",
        "likes": "289",
        "dislikes": "218",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting in the Street: Wave frantically across the street to people who are trying to ignore you and try to attract as much attention to them as you can.",
        "likes": "268",
        "dislikes": "92",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting in Banks: Take a tape recorder with you to the meeting with the manager. Say nothing the entire time, but simply record all he says to you. Then when he's finished play it back to him at twice the speed and leave.",
        "likes": "260",
        "dislikes": "104",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting in the Street: Find a bus stop with a waste bin attached to it. Hide a small bottle of champagne and a leg of chicken in the bottom. Wait for a queue to form at the bus stop, then go and rummage in the gutter, and finally look in the bin. Find the things you've hidden, and devour them in front of the people waiting for the bus.",
        "likes": "243",
        "dislikes": "118",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "Q: Whats the difference between a politician and a snail?",
        "likes": "409",
        "dislikes": "286",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "Q: What do you call a lawyer with an IQ of 100?",
        "likes": "397",
        "dislikes": "113",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "A Scotsman who was driving home one night, ran into a car driven by an Englishman. The Scotsman got out of the car to apologize and offered the Englishman a drink from a bottle of whisky. The Englishman was glad to have a drink. \"Go on,\" said the Scot, \"have another drink.\" The Englishman drank gratefully. \"But don't you want one, too?\" he asked the Scotsman. \"Perhaps,\" replied the Scotsman, \"after the police have gone.\"",
        "likes": "348",
        "dislikes": "70",
        "title": "Political Jokes",
        "link": "http://www.laughfactory.com/jokes/political-jokes/2"
    },
    {
        "joke": "I saw a young teenage kid on the subway today. He had a Mohawk hairstyle dyed yellow, green, and red. He caught me staring at him and in a nasty voice asked, \"What the f*ck are you looking at?\" I replied, \"Sorry, but when I was about your age I had sex with a parrot. I thought maybe you were my son.\"",
        "likes": "2742",
        "dislikes": "515",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "Man: I want to give myself to you.",
        "likes": "2408",
        "dislikes": "490",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "When somebody calls you gay, say, \"I'm straighter than the pole your mom dances on.\"",
        "likes": "2218",
        "dislikes": "393",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "Q: Why are blonde jokes so short?",
        "likes": "2215",
        "dislikes": "2218",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "A guy and girl had sex poem competition.",
        "likes": "2212",
        "dislikes": "717",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "Maria, a devout Catholic, got married and had 15 children. After her first husband died, she remarried and had 15 more children. A few weeks after her second husband died, Maria also passed away. At Maria's funeral, the priest looked skyward and said, \"At last, they're finally together.\" Her sister sitting in the front row said, \"Excuse me, Father, but do you mean she and her first husband, or she and her second husband?\" The priest replied, \"I mean her legs.\"",
        "likes": "2981",
        "dislikes": "603",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Three dead men go to hell at the same time. There is a white man, a Chinese man, and a Mexican man. Satan tells them that they can only leave hell if he can't do what they ask. The white man asks for the fastest sports car in the world; he goes to into hell. The Chinese man asks for the most advanced computer in the world; he goes into to hell. The Mexican man gets a glass soda bottle, farts into it, closes the lid, pokes many holes in the lid, and asks Satan which hole the fart came from. After pointing to every hole on the lid, the Mexican turns around, points at his butt hole, and says, \"Nope, this one.\"",
        "likes": "2968",
        "dislikes": "2328",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Don't break anybody's heart; they only have 1. Break their bones; they have 206.",
        "likes": "2905",
        "dislikes": "985",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "A: I have the perfect son.",
        "likes": "2788",
        "dislikes": "874",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Mother superior tells two new nuns that they have to paint their room without getting any paint on their clothes. One nun suggests to the other, \"Hey, let's take all our clothes off, fold them up, and lock the door.\" So they do this, and begin painting their room. Soon they hear a knock at the door. They ask, \"Who is it?\" \"Blind man!\" The nuns look at each other and one nun says, \"He's blind, so he can't see. What could it hurt?\" They let him in. The blind man walks in and says, \"Hey, nice tits. Where do you want me to hang the blinds?\"",
        "likes": "2264",
        "dislikes": "494",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "A bus full of ugly people had a head on collision with a truck. When they died, God granted all of them one wish. The first person said, \"I want to be gorgeous.\" God snapped his fingers and it happened. The second person said the same thing and God did the same thing. This want on and on throughout the group. God noticed the last man in line was laughing hysterically. By the time God got to the last ten people, the last man was laughing and rolling on the ground. When the man's turn came, he laughed and said, \"I wish they were all ugly again.\"",
        "likes": "6742",
        "dislikes": "1323",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Q: Why did the witches' team lose the baseball game?",
        "likes": "6692",
        "dislikes": "3992",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Instead of \"the John,\" I call my toilet \"the Jim.\" That way it sounds better when I say I go to the Jim first thing every morning.",
        "likes": "6372",
        "dislikes": "1570",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Q: Did you hear about the kidnapping at school?",
        "likes": "5893",
        "dislikes": "2420",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Q: Why couldn't the leopard play hide and seek?",
        "likes": "5740",
        "dislikes": "2565",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Q: What starts with E, ends with E, and has only 1 letter in it?",
        "likes": "5453",
        "dislikes": "2635",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "A husband and wife were driving through Louisiana. As they approached Natchitoches, they started arguing about the pronunciation of the town. They argued back and forth, then they stopped for lunch. At the counter, the husband asked the blonde waitress, \"Before we order, could you please settle an argument for us? Would you please pronounce where we are very slowly?\" She leaned over the counter and said, \"Burrr-gerrr Kiiing.\"",
        "likes": "5406",
        "dislikes": "1543",
        "title": "Clean Jokes",
        "link": "http://www.laughfactory.com/jokes/clean-jokes/2"
    },
    {
        "joke": "Q: Why is a baseball game a good place to go on a hot day?",
        "likes": "735",
        "dislikes": "339",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Q: Why did the coach go back to the bank?",
        "likes": "524",
        "dislikes": "239",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Two guys were playing golf. On the tee, Jack hit his shot way left of the fairway in some buttercups. Bob proceeded to hit and his ball went way off to the right in the bushes. Jack eventually found his ball and proceeded to hit in the buttercups. All of a sudden, he heard a big *POOF* and a fairy appeared. She proceeded to say to Jack that she was Mother Nature and that she was really upset at him for damaging the buttercups. She said, ''Jack, for all the damage that you did to my buttercups, you will not have any butter to put on your toast in the morning for the next month. No, as a matter of fact, I am so upset at you that you won't have any butter for the whole next year! That should teach you a lesson so you won't hurt my creations.\" *POOF* She disappeared. Jack, stunned by what just happened, called out, \"Bob! Bob! Come over here here quick!\" Bob replied, \"Wait a sec. I'm hitting my shot and I'll be right over.\" Jack yelled back at Bob, \"Where are you?\" Bob answered, \"I'm over here in the pussy willows.\" Jack shouted back, \"Don't swing Bob! For the love of God, don't swing!\"",
        "likes": "338",
        "dislikes": "228",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "A panda walks into a bar, sits down, and orders a sandwich. He eats, pulls out a gun, and shoots the waiter dead. As the panda stands up to go, the bartender shouts, \"Hey! Where are you going? You just shot my waiter and you didn't pay for the food!\" The panda yells back, \"Hey man, I'm a panda. Look it up!\" The bartender opens his dictionary to panda, \"A tree climbing mammal of Asian origin, characterized by distinct black and white coloring. Eats, shoots, and leaves.\"",
        "likes": "889",
        "dislikes": "364",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "You've got your head so far up your ass you can chew your food twice.",
        "likes": "815",
        "dislikes": "398",
        "title": "Food Jokes",
        "link": "http://www.laughfactory.com/jokes/food-jokes/2"
    },
    {
        "joke": "How to be Insulting in Hotels: If you have to get up early, do it with the maximum amount of noise. Run a bath loudly and sing in it.",
        "likes": "239",
        "dislikes": "149",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "How to be Insulting at Christmas: Turn up the television when the carol singers arrive and turn off the lights until they go away.",
        "likes": "196",
        "dislikes": "56",
        "title": "How to be Insulting",
        "link": "http://www.laughfactory.com/jokes/how-to-be-insulting/2"
    },
    {
        "joke": "A husband says to his wife, \"You know, our son got his brain from me.\" The wife replies, \"I think he did. I still got mine with me!\"",
        "likes": "2098",
        "dislikes": "621",
        "title": "Insult Jokes",
        "link": "http://www.laughfactory.com/jokes/insult-jokes/2"
    },
    {
        "joke": "If you ever fart in public, just yell, \"Turbo power!\" and walk faster.",
        "likes": "2247",
        "dislikes": "519",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Why is it that your nose runs, but your feet smell?",
        "likes": "2228",
        "dislikes": "1048",
        "title": "Miscellaneous Jokes",
        "link": "http://www.laughfactory.com/jokes/miscellaneous-jokes/2"
    },
    {
        "joke": "Kobe Bryant wears the number 24 to remind himself about how many seconds he has to hog the ball.",
        "likes": "294",
        "dislikes": "83",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Yo mamma so fat, when she plays paintball her teammates hide behind her.",
        "likes": "252",
        "dislikes": "158",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Q: How do you make NY Jets cookies?",
        "likes": "229",
        "dislikes": "159",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    },
    {
        "joke": "Q: How do you make NY Jets cookies?",
        "likes": "229",
        "dislikes": "159",
        "title": "Sports Jokes",
        "link": "http://www.laughfactory.com/jokes/sports-jokes/2"
    }
]