[
    {
        "title": "Junior Estimator/Coordinator",
        "url": "https://newyork.craigslist.org/que/egr/d/maspeth-junior-estimator-coordinator/6812793769.html",
        "description": "Construction company seeking junior estimator/project coordinator to perform takeoffs, request quotes for materials and availability, prepare product data and submittals, to keep close contact with other estimating departments for new projects to bid, Answer phones and take messages for others as needed. Work duties may also include other normal office/secretarial tasks as well. Good negotiation skills a plus.",
        "compensation": "To be deteremined",
        "employment_type": "full-time",
        "address": "5513 69TH ST"
    },
    {
        "title": "Facade / Building Envelope Junior Architect",
        "url": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-junior/6811577488.html",
        "description": "New York City's leading professional firm dedicated to the preservation of buildings and infrastructure is currently seeking an  \nentry-level junior architect.As a building envelope restoration consultant SUPERSTRUCTURES works on an array of challenging projects on many of New York's most prominent buildings. We've won frequent awards, as well as the loyalty of some of the premier clients in the region -- public, corporate and residential.  Our work embraces all components of the building envelope and underlying structure - facades, roofs, windows, and plazas - and the full complement of materials, from landmark terra cotta to high performance curtain walls. We take pride in being an industry leader in such practice areas as Local Law 11 inspections and repairs.We work in teams. Teams are assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a \"small office experience\" coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state of the art non-destructive diagnostic equipment and techniques.Employees typically participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see the designs you draw executed in the field, and you'll take on greater responsibility and client exposure as soon as you are ready.Frequent lunchtime seminars by industry experts, including our own in-house personnel, keep us current on developments in the profession (with the additional benefit of a free lunch).SUPERSTRUCTURES offers top-level compensation for top-level people, and the advancement potential of a thriving company.We are committed to a work / life balance, and to a work week of 40 hours.  When, on occasion, more than 40 hours are required, our employees are compensated for every additional hour worked. \nOur benefits include paid holidays, vacation and sick days, health insurance for employee and family, 401(k) with automatic employer contribution, a continuing education allowance, and free NYC Transit MetroCards.Our light-filled office is in a landmarked building with 16' high ceilings, 8' tall windows, and drop dead views in three directions - not a bad place to spend the workday.Our Tribeca location is one of New York City's most convenient and vibrant, easily accessible via public transportation. The A, C, and E subway lines stop right in the building. The N, R, #1, and #6 lines are each just a few blocks away.SUPERSTRUCTURES welcomes applications in reply to this posting. Please include a cover letter with salary requirements, your resume, and a few pages of attachments that display your capabilities (maximum of 10MB please).Note: Our thanks in advance to those submitting applications; only those candidates under consideration will be contacted.For additional information, visit our website at",
        "compensation": "Commensurate with experience",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Project Architect - Design Build Firm",
        "url": "https://newyork.craigslist.org/mnh/egr/d/project-architect-design-build-firm/6811588623.html",
        "description": "Design office needs project architect.Three to five years of prior experience required.The candidate must be able to draft well (AutoCAD required, plus Revit a bonus!).Knowledge of construction documents and the ability to compile a set of drawings is a must.With your resume, please indicate your experience level and interests in a cover letter.Please indicate your current hourly rate.Note: This position is for someone with 3-5 years experience.  No offsite drafting.",
        "compensation": "Hourly rate determined during interview.  We will email you if you fit the criteria and arrange for a phone interview first.",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "PLUMBING CAD DESIGNER/DRAFTER",
        "url": "https://newyork.craigslist.org/brk/egr/d/brooklyn-plumbing-cad-designer-drafter/6811978026.html",
        "description": "A Union PLUMBING company based in Brooklyn is looking for a CAD designer with a minimum of 5 years' experience in drafting plumbing and sprinkler shop, as-built, and coordination drawings in 2D/3D. The candidate must have knowledge of plumbing standards and understanding of NYC Building Code. Compensation and benefits based on experience.Responsibilities include:• Create 2D and 3D models using AutoCAD MEP• Prepare Plumbing Shops, As-Builts and Coordination drawings• Clash detection and coordinating with other trades",
        "compensation": "TBD",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "JUNIOR ESTIMATOR - PLUMBING COMPANY",
        "url": "https://newyork.craigslist.org/brk/egr/d/brooklyn-junior-estimator-plumbing/6811992114.html",
        "description": "A Union Plumbing company is looking for a junior Estimator. This is a full-time position.Qualifications:- 2+ YEARS OF EXPERIENCE IN PLUMBING, FIRE SUPPRESSION, AND MEP ESTIMATING- ABILITY TO DO TAKEOFFS FROM PLUMBING AND FIRE SUPPRESSION DRAWINGS- KNOWLEDGE OF BUILDING CODE AND INDUSTRY STANDARDS- EXPERIENCE WORKING WITH THE NYCSCA, NYCHA AND DDC IS A PLUS- PERFORM BUYOUTS OF MATERIALS AND SERVICES- EXCELLENT COMMUNICATION AND COMPUTER SKILLS",
        "compensation": "TBD",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Construction Site Superintendent for New Construction Project",
        "url": "https://newyork.craigslist.org/que/egr/d/bellerose-construction-site/6812050593.html",
        "description": "Construction Site Superintendent for New Construction project:General Contractor looking for experienced and qualified Field Site Supervisors for immediate hire to manage a NEW CONSTRUCTION jobsite located in Queens, NY.•\tMust be knowledgeable with new construction projects, masonry, roofing and related work. Similar experience working on catering/banquet hall, and/or restaurant/hotel projects and references required.•\tMUST HAVE EXPERIENCE managing new construction jobsite till completion.•\tAble to professionally deal with Architect, all sub-contractors of various trades, and all crews involved. Create and manage Safety Logs, time sheets, daily reports and be proactive in maintaining a safe jobsite complaint with  OSHA and NYCDOB requirements. Be able to expedite the progress schedule to completion.•\tMust be have managerial skills, be able to resolve problems, be organized with a can-do fix-it personality. Must be adept with specs, drawings and identify inconsistencies and resolve them in a timely manner.•\tKnowledgeable to read blueprints drawings have necessary OSHA (30-Hour)/DOB certifications (32 Hour Supported & Suspended Scaffold User). 40 Hour Site Safety Manager Course & the Construction Site Fire Safety Manager (CSFSM)•\tList all managed projects and certifications on resume.•\tPlease fax resume to (718) 707-9701 or e-mail resume to hr@mstgc.usLooking forward to hearing from the best in the industry!LONG TERM CAREER POSSIBILITY",
        "compensation": "EXCELLENT Compensation.",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Structural engineer needed immediately",
        "url": "https://newyork.craigslist.org/brk/egr/d/valley-stream-structural-engineer/6812173520.html",
        "description": "Our Engineer's firm is looking for a full time structural engineer to join our office in Valley Stream, Long Island. The candidate must have 3+ years of experience working in the Structural Engineering field, EIT, Master degree and AUTOCAD proficiency is a must. Experience with engineering software such as RAM, ETABS, and RISA are a major plus.We are a small but growing, fast paced engineering firm.The candidate will be working on structural engineering projects from start to finish. The perfect candidate must have the ability to multitask, must have great communication and writing skills, he/she will be working closely with office engineers and support staff to assure our project goals are met in a timely manner. The hourly rate will be determined according to experience.Please forward us your resume along with a cover letter introducing yourself and your related experience to:We are conveniently located by the Valley Stream Long Island Rail Road station. Thanks and best regards, we look forward to hearing from you!Job Type: Full-time",
        "compensation": "TBD",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Plumbing -Fire Protection Engineers and Designers-REVIT",
        "url": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-plumbing-fire-protection/6812783731.html",
        "description": "For over 50 years Ettinger Engineering Associates, a premier MEP/FP consulting engineering firm located in midtown Manhattan has been partnering with select developers, architects, institutions and municipal agencies to provide exceptional building design and application services.Currently we offer excellent career opportunities to Plumbing and Fire Protection engineers and designers with proficiency in REVIT modeling and Autocad for the design of new and hi-mid and low-rise residential buildings, hotels, schools and more.General Responsibilities Under Supervision of Senior Engineer/Project Managers include:Design and layout of systems with minimal directionBuilding inspections of existing services and trades (when appropriate)-Good sense of coordination and follow through.-Possess sufficient knowledge of drawings consistent with instruction, guidelines, standards-Learn/be familiar with building codes-Learn/be familiar with equipment and able to make basic selections-Ability to perform engineering calculationsGeneral Qualifications include:A BS in Engineering, 2-3 years experience,  REVIT and Autocad proficiency required. Willing to be team player, seek knowledge from others, remain enthusiastic about work and being productive. Available to work overtime and meet project deadlines.Compensation and Benefits:We offer a competitive salary based on the candidate's experience and credentialsMedical, vision and dental insurance offered with substantial contributions by the firmDisability insurance for the employee paid for by the Firm401k plan with firm matching schedule.PTO schedule increases with years of servicePaid holidaysEEA CultureEEA is a mid-size firm with enough capability, experience and resource to take on the largest of development projects. At the same time, our company is organized in smaller studios which provide for numerous client and employee benefits. As an example of an outward benefit, our studio model ensures that repeat clients interact with consistent managerial and engineering staff that is familiar with client operational models, expectations, norms, etc. Inwardly, studios and the smaller project teams within them, allow our employees to form tight-knit and collegial professional relationships, allow for seamless work sharing and more.Beyond a culture which rewards excellence, \"sets the bar high\", and strives to consistently and relentlessly exceed expectations, our internal culture is centered around five additional tenets:Staff Appreciation - People Are Our Most Valuable AssetProfessional Development - Your Growth is Shared GrowthFlexibilityEnvironmental ConsciousnessDiversityRead more about us at:Send resume with minimum salary requirements.Label resume file with your full name.Candidates must be authorized to work in USAEqual Opportunity EmployerNO PHONE CALLS",
        "compensation": "Commensurate with experience",
        "employment_type": "full-time",
        "address": "8th. Avenue at 35th. Street"
    },
    {
        "title": "Sr. Project/PM MEP Engineers -MECH/ELEC/PL-FP",
        "url": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-sr-project-pm-mep/6812791404.html",
        "description": "For over 50 years Ettinger Engineering Associates, a premier MEP/FP consulting engineering firm located in midtown Manhattan has been partnering with select developers, architects, institutions and municipal agencies to provide exceptional building design and application services.Currently we offer an excellent career opportunities for  Senior Level MEP Engineers with Project Management experience who will be responsible for project design with the ability to project manage including coordinating all trades for a diverse set of projects.You will be expected to lead and provide intelligent building systems for a variety of project types in varying sizes and levels of complexity simultaneously.   Your responsibilities will also include creating plans, schematics, equipment selection, load calculations, response to shop drawings/submittals/RFIs, systems narratives and specifications etc.As a Project Manager, you will be expected to lead larger multi-discipline teams and resources and effectively manage project scopes, budget and scheduling/deadlines.General Qualifications include:-A BS in Engineering and 5+ years of experience in building design-EIT certificate and/or PE License preferred-LEED GA or AP certification a plus-PMI PMP Certification or similar preferred-REVIT & CAD experience required-Exceptional communication, writing and interpersonal skills-Must be organized, energetic and accountable-Must be able to work overtime to meet project deadlines-Must have demonstrated familiarity with NYC and NYS building codes-Proficiency in MSOFFICE & Google Drive tools-Must be able to professionally represent the company to clients and agencies at meetings and through written correspondence.-Must be able to demonstrate the ability to solve complex technical and project level problemsCompensation and Benefits:We offer a competitive salary based on the candidate's experience and credentialsMedical, vision and dental insurance offered with substantial contributions by the firmDisability insurance for the employee paid for by the Firm401k plan with firm matching schedule.PTO schedule increases with years of servicePaid holidaysEEA CultureEEA is a mid-size firm with enough capability, experience and resource to take on the largest of development projects. At the same time, our company is organized in smaller studios which provide for numerous client and employee benefits. As an example of an outward benefit, our studio model ensures that repeat clients interact with consistent managerial and engineering staff that is familiar with client operational models, expectations, norms, etc. Inwardly, studios and the smaller project teams within them, allow our employees to form tight-knit and collegial professional relationships, allow for seamless work sharing and more.Beyond a culture which rewards excellence, \"sets the bar high\", and strives to consistently and relentlessly exceed expectations, our internal culture is centered around five additional tenets:Staff Appreciation - People Are Our Most Valuable AssetProfessional Development - Your Growth is Shared GrowthFlexibilityEnvironmental ConsciousnessDiversityRead more about us at:Send resume file labeled with your full nameSend minimum salary requirementsCandidates must be authorized to work in the USASee our website at :www.ettingerengineering.comNO CALLSEqual Opportunity Employer",
        "compensation": "TOP DOLLAR SALARY",
        "employment_type": "full-time",
        "address": "8th. Avenue at 35th. Street"
    },
    {
        "title": "Construction project manager or superintendent needed",
        "url": "https://newyork.craigslist.org/que/egr/d/elmhurst-construction-project-manager/6812399533.html",
        "description": "Hiring a construction project manager or superintendent , need experience , knowledge of plan, know DOB rules.  drivers license is a plus . send your resume to BUILDERSINCNYC@gmail.com.",
        "compensation": "Paid weekly",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Senior MEP Design Engineers - Mech/Electrical/Plumb-FP",
        "url": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-senior-mep-design/6812786627.html",
        "description": "Ettinger Engineering Associates has openings for experienced Senior level Mechanical, Electrical, and Plumbing/Fire Protection engineers who are experienced in systems design, creating plans, schematics, equipment selection & calculations, response to shop drawings/submittals/RFIs, systems narratives and specifications.General Qualifications include:-A B.S. in Engineering and a number of years of experience in MEP Electrical+Fire Alarm field.-Must be familiar with local building codes & NEC.-Must be experienced with both AutoCad and Revit.-Proficiency in MSOFFICE & Google Drive tools.-Must be a strong communicator and have strong writing and interpersonal skills.-Must be able to seek information when needed and be a self-starter.-Well organized and energetic.Compensation and Benefits:We offer a competitive salary based on the candidate's experience and credentialsMedical, vision and dental insurance offered with substantial contributions by the firmDisability insurance for the employee paid for by the Firm401k plan with firm matching schedule.PTO schedule increases with years of servicePaid holidaysSend resume labeled with your first and last name.Send minimum salary requirementMust be authorized to work in United StatesNO CALLS.EEA CultureEEA is a mid-size firm with enough capability, experience and resource to take on the largest of development projects. At the same time, our company is organized in smaller studios which provide for numerous client and employee benefits. As an example of an outward benefit, our studio model ensures that repeat clients interact with consistent managerial and engineering staff that is familiar with client operational models, expectations, norms, etc. Inwardly, studios and the smaller project teams within them, allow our employees to form tight-knit and collegial professional relationships, allow for seamless work sharing and more.Beyond a culture which rewards excellence, \"sets the bar high\", and strives to consistently and relentlessly exceed expectations, our internal culture is centered around five additional tenets:Staff Appreciation - People Are Our Most Valuable AssetProfessional Development - Your Growth is Shared GrowthFlexibilityEnvironmental ConsciousnessDiversityRead more about us at:Equal Opportunity EmployerJob Type: Full-time",
        "compensation": "Top Dollar-Commensurate with experience",
        "employment_type": "full-time",
        "address": "8th. Avenue at 35th. Street"
    },
    {
        "title": "Junior Estimator/Coordinator",
        "url": "https://newyork.craigslist.org/que/egr/d/maspeth-junior-estimator-coordinator/6812793770.html",
        "description": "Construction company seeking junior estimator/project coordinator. Perform takeoffs, request quotes, locate materials and availability, prepare product data and submittals. Answer phones and take messages as needed. Other normal secretarial skills and good negotiation skills a plus.",
        "compensation": "To be deteremined",
        "employment_type": "full-time",
        "address": "5513 69TH ST"
    },
    {
        "title": "HVAC Service Technician",
        "url": "https://newyork.craigslist.org/que/egr/d/hvac-service-technician/6809464654.html",
        "description": "Fast growing Maspeth based company looking for a field HVAC Service Technician. The person will be responsible for PM's, installs, troubleshooting, diagnosing, and repairing commercial & residential HVAC systems, controls, chilled water systems, boilers, variable volume air systems, at our customer's location.Requirements:- AC experience- EPA certification- Very solid electrical and mechanical skills- Extremely strong customer communication skills and ability to follow all customer work rules- Computer and internet skills- Valid Driver License with good recordPrimary job responsibilities:- PM, install, troubleshoot, diagnose and repair HVAC systems- Complete work in a timely, neat, and workmanlike manner- Communicate effectively with customers, manager and dispatcher- Maintain service vehicle- Order parts and complete required paperwork- Other duties as assigned by the Manager- As with most HVAC companies, summer OT is highly required along with weekend stand-by.Company vehicle, tool replacement, a high level top paying position, paid holidays, paid vacation, sick days, medical, dental and vision insurance, AFLAC and matching 401K",
        "compensation": "TBD",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Intermediate Architectural Associate AZARK Design & Development",
        "url": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-intermediate/6810732994.html",
        "description": "Intermediate Architectural AssociateAZARK Design & Development - Manhattan, NYJob DescriptionAZARK is seeking an Architectural Associate/CAD drafter to join our team. As an Architectural Associate/CAD drafter you will work on Restaurant projects primarily in Manhattan to expand your knowledge of NYC building codes and regulations, NYC city agencies and expediting processes.Must know NYC Building Code and Zoning Resolution.RESPONSIBILITIES:• Survey existing and as-built conditions on sites located throughout the NYC area• Create Architectural Drawings and Construction Documents (Alteration Type 1 and Type 2)• Zoning Analysis and Diagrams• Drawing existing and proposed sections and elevations• Update drawing sets based on NYC Plan Examiner Objections• Prepare DOB filing set packages and coordinate with Expeditor to file with Department of Buildings.• Follow up with pertinent parties to ensure timely submission and fulfillment of DOB requirements.MINIMUM QUALIFICATIONS:•\tAssociate's degree or completion of a technical trade school in CAD, drafting or related field•\tAt least 3+ years of experience using AutoCAD•\tProficiency in Adobe Creative Suite•\tAbility to establish and maintain effective working relationships with departmental personnel, management, contractors, consultants and the general public•\tHighly attentive to details, accuracy and visual aesthetic•\tProvide resume and work samples in PDF formatPREFERRED QUALIFICATIONS:•\tDegree or Certificate in Architecture, Drafting or Surveying•\t5+ years work experience with New York City and New York State Code & Zoning Regulations•\tRendering capabilities•\tAbility to work independently in a fast-paced dynamic environment•\tProject management experience•\tKnowledge of Sketch Up and Revit•\tA fun, energetic approach to work and business interactionsInterested in applying? Please submit your resume, cover letter and relevant work samples with the subject line \"Architectural Associate / CAD Drafter Application via Indeed.\" AZARK is an EOE. All applicants must be U.S. citizens, U.S. permanent residents, or otherwise legally authorized to work in the U.S.office located in Midtown on 36th St. by 6th Ave.Job Type: Full-timeSalary: $65,000.00 to $80,000.00 /year",
        "compensation": "Salary: $65,000.00 to $80,000.00 /year",
        "employment_type": "full-time",
        "address": "36th st"
    },
    {
        "title": "Junior Interior Designer AZARK Architecture & Design - Manhattan, NY",
        "url": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-junior-interior-designer/6810739280.html",
        "description": "Junior Interior DesignerAZARK Architecture & Design - Manhattan, NYJob DescriptionAZARK is seeking a Junior Interior Designer to join our team for a contract position. As a Junior Interior Designer you will work on hospitality projects in New York City for a duration of three to six months with the potential to extend initial contract. A strongcandidate will have knowledge of NYC interior design market and resources.RESPONSIBILITIES:• Develop design ideas that match project's visual aesthetic• Research and select materials, color palettes, finishes, fixtures and furnishings• Draft design documents in CAD• Prepare client presentations (mood boards, drawings, 3D renderings)• Attend weekly client meetings• Site visits to assist with construction administration and furnishing installations• Track and coordinate project items and purchase orders• Coordinate with Filing Representative for construction documents• Follow up with pertinent parties to ensure timely submission and fulfillment of DOB requirementsMINIMUM QUALIFICATIONS:•\tAssociate's degree or completion of a technical trade school in Interior Design or related field•\tAt least 3+ years of experience using AutoCAD, Illustrator and Photoshop•\tProficiency in Adobe Creative Suite•\tAbility to establish and maintain effective working relationships with departmental personnel, management, contractors, consultants and the general public•\tHighly attentive to details, accuracy and visual aesthetic•\tProvide resume and work samples in PDF formatPREFERRED QUALIFICATIONS:•\tBachelor's degree in Interior Design or Architecture•\t5+ years work experience with New York City hospitality projects (restaurant design preferred)•\tRendering capabilities•\tAbility to work independently in a fast-paced dynamic environment•\tProject management experience•\tKnowledge of Sketch Up and Revit•\tA fun, energetic approach to work and business interactionsInterested in applying? Please submit your resume, cover letter and relevant work samples to Allen with the subject line \"Junior Interior Designer via Indeed.\" AZARK is an EOE. All applicants must be U.S. citizens, U.S. permanent residents, or otherwise legally authorized to work in the U.S.Job Type: Contract$3,000.00 to $4,500.00 /month",
        "compensation": "$3,000.00 to $4,500.00 /month",
        "employment_type": "contract",
        "address": "36th st"
    },
    {
        "title": "Lead Interior Designer w/ NY experience",
        "url": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-lead-interior-designer-ny/6811132099.html",
        "description": "Design Build firm is looking for an energetic, fun, and creative Lead Interior Designer for our NYC office.The Lead Interior Designer will assist our Design Director in managing our projects, in a fast-paced and hectic environment. They will be in charge of client interaction, schematics, design development, scheduling meetings, design presentations, material selection, coordinating and performing site visits.The Lead Interior Designer will also direct and supervise the work of junior level staff in preparation of drawings, presentations, FFE, specifications, models and other project tasks.Interior Designer Responsibilities and Duties- Thorough understanding of all project phases of work including programming, space planning, color, andmaterial selections, FF&E selections, schematic design, design development, construction documents, andconstruction contract administration.- Extensive hands-on experience and understanding of the design and construction of interior architecturalspaces.- A background and knowledge of  residential renovation, and commercial renovation experience- An enthusiastic willingness to mentor junior level design staff in a constructive and thoughtful manner.- Proficiency in AutoCAD and Sketchup drafting and Adobe Creative Suite- Excellent design skills and possesses attention to detail and appreciation for creative and thoughtful design.- Strong programming and conceptualization skills.Interior Designer Qualifications and Skills- Professional degree in Interior Design, Architecture or related field.REQUIREMENTS- Positive, Can-do Attitude (Problem Solver)- Must be a Team Player.- Possess a strong knowledge of the design process, including FF&E, and specifications- Understands and respects budgets, schedules, fees for a project, and most importantly deadlines.- Has the proven ability to self-manage under pressure while overseeing and mentoring junior designers in a fast-paced environment.**Interested applicants should email a Cover Letter, resume or CV, and Portfolio of workInterior Designer, Sr. Designer, Jr. Designer, Lead Designer, Architect, Senior, Junior, architecture",
        "compensation": "DOE: Salary + Bonus",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Architect / Drafter",
        "url": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-drafter/6799550436.html",
        "description": "Busy Design and Consulting firm is looking for a talented individual to help grow our practice.Our work includes renovations and ground ups of small, medium and large scale single and multi-family residential, commercial, community facility and mixed-use projects.Responsibilities will include production of design development and construction documents, Candidates must be self-motivated, reliable and able to manage all aspects of a project.Candidate Qualifications:Be familiar with NYC codes and zoning.Knowledge of construction materials, details and methods.Proficiency in Revit and AutoCAD.We are looking for highly motivated individuals who are willing to take on responsibility and grow with our team. Interested applicants must be quick to learn and adapt new drawing methods, related zoning & code rules, DOB and related agency requirements. detail-oriented, collaborative, and eager to take on challengesQualified individuals should submit a *brief description of your qualifications, *work samples, *starting salary requirements, in pdf or word format",
        "compensation": "Based on qualifications",
        "employment_type": "full-time",
        "address": "Unknown"
    },
    {
        "title": "Project Architect(s)",
        "url": "https://newyork.craigslist.org/que/egr/d/project-architects/6799644672.html",
        "description": "Mssa, a Small Successful 8-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.Requirements• BS or 5-year Professional degree in Architecture• Minimum 3 years' experience in an architecture office• Proven ability to produce Construction Documents• Working knowledge of NYC code and zoning regulations• Familiarity with DOB procedures a plus• Site visits and requisition review• Check submittals and respond to requests for information• Fluent with Autocad Architecture 2017/18• Revit 2017 Experience a plus• Strong work ethic• Fluent EnglishPlease submit your resume including work samples with a particular emphasis on construction documents.",
        "compensation": "Commensurate with Experience",
        "employment_type": "full-time",
        "address": "Unknown"
    }
]