[
    {
        "joke": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"",
        "likes": "49177",
        "dislikes": "13060"
    },
    {
        "joke": "Mr. and Mrs. Brown had two sons. One was named Mind Your Own Business & the other was named Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, \"What are you doing?\" \"Playing a game,\" the boy replied. \"What is your name?\" the officer questioned. \"Mind Your Own Business.\" Furious the policeman inquired, \"Are you looking for trouble?!\" The boy replied, \"Why, yes.\"",
        "likes": "14872",
        "dislikes": "3134"
    },
    {
        "joke": "A woman gets on a bus with her baby. The bus driver says, \"That's the ugliest baby that I've ever seen. Ugh!\" The woman goes to the rear of the bus and sits down, fuming. She says to a man next to her, \"The driver just insulted me!\" The man says, \"You go right up there and tell him off – go ahead, I'll hold your monkey for you.\"",
        "likes": "8840",
        "dislikes": "3284"
    },
    {
        "joke": "A boy asks his father, \"Dad, are bugs good to eat?\" \"That's disgusting. Don't talk about things like that over dinner,\" the dad replies. After dinner the father asks, \"Now, son, what did you want to ask me?\" \"Oh, nothing,\" the boy says. \"There was a bug in your soup, but now it’s gone.\"",
        "likes": "7427",
        "dislikes": "1780"
    },
    {
        "joke": "Q: Why did the witches' team lose the baseball game?",
        "likes": "6692",
        "dislikes": "3992"
    },
    {
        "joke": "An elderly couple are in church. The wife leans over and whispers to her husband, \"I just let out a long, silent fart. What should I do?\" The husband replies, \"First off, replace the batteries in your hearing aid!\"",
        "likes": "6157",
        "dislikes": "1889"
    },
    {
        "joke": "Q: Why couldn't the leopard play hide and seek?",
        "likes": "5740",
        "dislikes": "2565"
    },
    {
        "joke": "Q: What starts with E, ends with E, and has only 1 letter in it?",
        "likes": "5453",
        "dislikes": "2635"
    },
    {
        "joke": "There was an elderly couple who in their old age noticed that they were getting a lot more forgetful, so they decided to go to the doctor. The doctor told them that they should start writing things down so they don't forget. They went home and the old lady told her husband to get her a bowl of ice cream. \"You might want to write it down,\" she said. The husband said, \"No, I can remember that you want a bowl of ice cream.\" She then told her husband she wanted a bowl of ice cream with whipped cream. \"Write it down,\" she told him, and again he said, \"No, no, I can remember: you want a bowl of ice cream with whipped cream.\" Then the old lady said she wants a bowl of ice cream with whipped cream and a cherry on top. \"Write it down,\" she told her husband and again he said, \"No, I got it. You want a bowl of ice cream with whipped cream and a cherry on top.\" So he goes to get the ice cream and spends an unusually long time in the kitchen, over 30 minutes. He comes out to his wife and hands her a plate of eggs and bacon. The old wife stares at the plate for a moment, then looks at her husband and asks, \"Where's the toast?\"",
        "likes": "5283",
        "dislikes": "2101"
    },
    {
        "joke": "A 3 years old boy sits near a pregnant woman.",
        "likes": "5235",
        "dislikes": "1110"
    },
    {
        "joke": "Wife: \"In my dream, I saw you in a jewelry store and you bought me a diamond ring.\"",
        "likes": "5015",
        "dislikes": "1873"
    },
    {
        "joke": "One day Jimmy got home early from school and his mom asked, \"Why are you home so early?\" He answered, \"Because I was the only one that answered a question in my class.\" She said, \"Wow, my son is a genius. What was the question?\" Jimmy replied, \"The question was 'Who threw the trash can at the principal's head?'\"",
        "likes": "4370",
        "dislikes": "822"
    },
    {
        "joke": "A girl realized that she had grown hair between her legs. She got worried and asked her mom about that hair. Her mom calmly said, \"That part where the hair has grown is called your monkey. Be proud that your monkey has grown hair.\" The girl smiled. At dinner, she told her sister, \"My monkey has grown hair.\" Her sister smiled and said, \"That’s nothing; mine is already eating bananas.\"",
        "likes": "4246",
        "dislikes": "1145"
    },
    {
        "joke": "Q: Why did Adele cross the road?",
        "likes": "3832",
        "dislikes": "2257"
    },
    {
        "joke": "Dad: \"Can I see your report card, son?\"",
        "likes": "3792",
        "dislikes": "762"
    },
    {
        "joke": "Q: Why did the can crusher quit his job?",
        "likes": "3785",
        "dislikes": "1725"
    },
    {
        "joke": "A mother said to her son, \"Look at that kid over there; he's not misbehaving.\" The son replied, \"Maybe he has good parents then!\"",
        "likes": "3770",
        "dislikes": "935"
    },
    {
        "joke": "A mom texts, \"Hi! Son, what does IDK, LY, & TTYL mean?\" He texts back, \"I Don't Know, Love You, & Talk To You Later.\" The mom texts him, \"It's ok, don't worry about it. I'll ask your sister, love you too.\"",
        "likes": "3184",
        "dislikes": "714"
    },
    {
        "joke": "Q: Can February march?",
        "likes": "3125",
        "dislikes": "1226"
    },
    {
        "joke": "A: I have the perfect son.",
        "likes": "2788",
        "dislikes": "874"
    },
    {
        "joke": "Q. How much room is needed for fungi to grow?",
        "likes": "2428",
        "dislikes": "1324"
    },
    {
        "joke": "Q: How do you make a tissue dance?",
        "likes": "2384",
        "dislikes": "1867"
    },
    {
        "joke": "A young boy came home from school and told his mother, \"I had a big fight with my classmate. He called me a sissy.\" The mother asked, \"What did you do?\" The boy replied, \"I hit him with my purse!\"",
        "likes": "2255",
        "dislikes": "847"
    },
    {
        "joke": "Q: What's the difference between a guitar and a fish?",
        "likes": "2111",
        "dislikes": "1532"
    },
    {
        "joke": "A father passing by his son's bedroom, was astonished to see the bed was nicely made, and everything was picked up. Then, he saw an envelope, propped up prominently on the pillow. It was addressed, \"Dad.\" With the worst premonition, he opened the envelope and read the letter, with trembling hands...",
        "likes": "2075",
        "dislikes": "319"
    },
    {
        "joke": "Q: Why did the fish blush?",
        "likes": "2047",
        "dislikes": "871"
    },
    {
        "joke": "A young boy comes home from school in a bad mood. His father asks him, \"What's wrong, son?\" The kid tells his dad that he's upset because another kid has been teasing him and calling him gay. The father says, \"Punch him in the face next time he does that. I bet he'll stop.\" The kid replies, \"Yeah, but he's so cute!\"",
        "likes": "1806",
        "dislikes": "788"
    },
    {
        "joke": "There are five cows on a farm, one mamma cow and four baby calves. The first baby walks up to the mom and asks, \"Momma, why is my name Rose?\" The mommy cow replies, \"Well honey, a rose petal fell on your head when you were born.\" The next calf comes up and asks, \"Momma, why is my name Lily?\" The mother replies, \"Because honey, a lily petal fell on your head when you were born.\" The third baby comes up and asks, \"Momma, why is my name Daisy?\" The momma cow again replieds\" Well, when you were born a daisy petal fell on your head.\" The final baby walks over and says, \"Duh huh guh nuh!\" The momma cow says, \"Shut up, Cinderblock.\"",
        "likes": "1803",
        "dislikes": "880"
    },
    {
        "joke": "Q: If you have 13 apples in one hand and 10 oranges in the other, what do you have?",
        "likes": "1802",
        "dislikes": "787"
    },
    {
        "joke": "Teacher: \"Answer this math problem: if your father earns $500 a week and gives half to your mother. What will he have?\"",
        "likes": "1647",
        "dislikes": "446"
    },
    {
        "joke": "Mother: \"Are you talking back to me?!\"",
        "likes": "1406",
        "dislikes": "240"
    },
    {
        "joke": "Q: What type of sandals do frogs wear?",
        "likes": "1386",
        "dislikes": "876"
    },
    {
        "joke": "There is a senior citizen driving on the highway. His wife calls him on his cell phone and in a worried voice says, ''Herman, be careful! I just heard on the radio that there is a madman driving the wrong way on Route 280!''\r\n\r\nHerman says, ''I know, but there isn't just one, there are hundreds!''",
        "likes": "1351",
        "dislikes": "486"
    },
    {
        "joke": "Little Susie, a six-year-old, complained, \"Mother, I've got a stomach ache.\"\r\n\r\n\"That's because your stomach is empty,\" the mother replied. \"You would feel better if you had something in it.\"\r\n\r\nThat afternoon, her father came complaining that he had a severe headache all day.\r\n\r\nSusie perked up, \"That's because it's empty,\" she said. \"You'd feel better if you had something in it.\"",
        "likes": "1346",
        "dislikes": "187"
    },
    {
        "joke": "An Italian mother says, \"If you don't eat all the food on this plate, I'll kill you.\" A Jewish mother says, \"If you don't eat all the food on this plate, I'll kill myself.\"",
        "likes": "1339",
        "dislikes": "2165"
    },
    {
        "joke": "A mother went to pick up her daughter from elementary school and found her doing handstands against the wall. When they got into the car, the mother said, \"Darling, I wish you wouldn't do that because the boys can see your panties.\" \"Okay, mommy,\" the little girl replied. The next day, the mother noticed her little girls hands looked dirty, so she asked, \"You haven't been doing handstands again and letting those boys see your panties, have you?\" \"Oh no, mummy,\" the daughter replied. \"Honestly! I took them off first.\"",
        "likes": "1285",
        "dislikes": "386"
    },
    {
        "joke": "A kid walks up to his mom and asks, \"Mom, can I go bungee jumping?\" The mom says \"No, you were born from broken rubber and I don't want you to go out the same way!\"",
        "likes": "1249",
        "dislikes": "595"
    },
    {
        "joke": "Q: What do cats eat for breakfast?",
        "likes": "1247",
        "dislikes": "1088"
    },
    {
        "joke": "Four men are in the hospital waiting room because their wives are having babies. A nurse approaches the first guy and says, “Congratulations! You're the father of twins.” “That's odd,” answers the man. “I work for the Minnesota Twins!” A nurse then yells the second man, “Congratulations! You're the father of triplets!” “That's weird,” answers the second man. “I work for the 3M company!” A nurse goes up to the third man saying, “Congratulations! You're the father of quadruplets.\" “That's strange,” he answers. “I work for the Four Seasons hotel!” The last man begins groaning and banging his head against the wall. “What's wrong?” the others ask. “I work for 7 Up!”",
        "likes": "1223",
        "dislikes": "150"
    },
    {
        "joke": "Why did the chicken cross the playground? To get to the other slide!!",
        "likes": "1220",
        "dislikes": "2835"
    },
    {
        "joke": "Q: What do you get when you cross a fish and an elephant?",
        "likes": "1217",
        "dislikes": "625"
    },
    {
        "joke": "Q: What happens once in a minute and twice in a moment but never in a decade?",
        "likes": "1211",
        "dislikes": "711"
    },
    {
        "joke": "A young man goes into a drug store to buy condoms. The pharmacist tells him that the condoms come in packs of three, nine, or 12, and asks which ones the young man wants. \"Well,\" he says, \"Ive been seeing this girl for a while and she's really hot. I want the condoms because I think tonight's the night. We're having dinner with her parents and then we're going out. Once she's had me, she'll want me all the time, so you'd better give me the 12 pack!\" The young man makes his purchase and leaves.\r\n\r\nLater that evening, he sits down to dinner with his girlfriend and her parents. He asks if he may give the blessing and they agree. He begins the prayer, but continues praying for several minutes. The girl leans over and says, \"You never told me that you were such a religious person.\" He leans over to her and says, \"You never told me that your father is a pharmacist.\"",
        "likes": "1113",
        "dislikes": "233"
    },
    {
        "joke": "A little girl and her older brother were visiting their grandfather's farm. The older brother decided to play a trick on his younger sister. He told her that he discovered a man-eating chicken. The girl was frightened, and ran inside in fear. Then the older brother heard his little sister scream. He ran inside immediately. She was screaming at their grandfather, who was chowing down on a plate of fried chicken. \"What is it?\" he asked. The sister turned to him in fear and said,\" It- it's- IT'S A MAN EATING CHICKEN!!!\"",
        "likes": "1047",
        "dislikes": "522"
    },
    {
        "joke": "Little Johnny likes to gamble.\r\n\r\nOne day, his dad gets a new job, so his family has to move to a new city.\r\n\r\nJohnny's dad thinks, \"I'll get a head start on Johnny's gambling.\"\r\n\r\nHe calls the teacher and says, \"My son Johnny will be starting your class tomorrow, but he likes to gamble, so you'll have to keep an eye on him.\"\r\n\r\nThe teacher says, \"Okay,\" because she can handle it.\r\n\r\nThe next day, Johnny walks into class and hands the teacher an apple and says, \"Hi, my name is Johnny.\"\r\n\r\nShe says, \"Yes, I know who you are.\"\r\n\r\nJohnny smiles and says, \"I bet you $10 you've got a mole on your butt.\"\r\n\r\nThe teacher thinks that she will break his little gambling problem, so she takes him up on the bet.\r\n\r\nShe pulls her pants down, shows him her butt, and there is no mole.\r\n\r\nThat afternoon, Johnny goes home and tells his dad that he lost $10 to the teacher and explains why.\r\n\r\nHis dad calls the teacher and says, \"Johnny said that he bet you that you had a mole on your butt and he lost.\"\r\n\r\nThe teacher says, \"Yeah, and I think I broke his gambling problem.\"\r\n\r\nJohnny's dad laughs and says, \"No you didn't, he bet me $100 this morning that he'd see your ass before the day was over.\"",
        "likes": "1038",
        "dislikes": "229"
    },
    {
        "joke": "Q.  What is the color of the wind?",
        "likes": "1011",
        "dislikes": "565"
    },
    {
        "joke": "A child goes to his father and asks, \"Father, how do parents think of names for their children?\" The father answers, \"Well, son, the night before the mother gives birth, the father goes into the woods and camps for the night. When he wakes the following morning, the first thing he sees is what he names his child, which is why your sister is named Soaring Eagle. Why do you ask, Bear Poop?\"",
        "likes": "1002",
        "dislikes": "318"
    },
    {
        "joke": "A husband got his mother-in-law a cemetery plot for Christmas. It came with a coffin, tomb stone, the works. Next Christmas comes by and the husband gets her nothing. When the mother-in-law asks, \"Why didn't you get me a gift?\" the husband says, \"You haven't used the one I got you last year!\"",
        "likes": "952",
        "dislikes": "311"
    },
    {
        "joke": "For a period, Houdini used a trap door in every single show he did…I guess you could say it was a stage he was going through.",
        "likes": "947",
        "dislikes": "1287"
    },
    {
        "joke": "Q: Why do Jewish mothers make great parole officers?",
        "likes": "935",
        "dislikes": "1645"
    },
    {
        "joke": "You know you're getting old when your wife says, \"Honey, lets run upstairs and make love,\" and you answer, \"I can't do both.\"",
        "likes": "898",
        "dislikes": "423"
    },
    {
        "joke": "An Amish husband, wife and son travel to the city on vacation. They visit a shopping mall and while the mother is shopping, the father and son are standing in awe in front of an elevator (having no idea what it is). As they watch, an elderly lady walks into the strange silver doors and the doors close. The father and son watch as the numbers go up, and then back down. When the doors open, a beautiful young woman walks out. The father leans over and whispers to the son, \"Son, go get your mother!\"",
        "likes": "882",
        "dislikes": "215"
    },
    {
        "joke": "A little girl is serving her father tea while her mother is out shopping. The mother comes home and the father says, \"Watch this!\" The little girl goes and serves the mother tea. The mother responds, \"Did it ever occur to you that the only place she can reach to get water is the toilet?\"",
        "likes": "881",
        "dislikes": "175"
    },
    {
        "joke": "Q: What is white when it's dirty and black when it's clean?",
        "likes": "842",
        "dislikes": "556"
    },
    {
        "joke": "Paddy and Murphy are havin' a pint in the pub, when some scuba divers come on the TV.  Paddy says, \"Murphy, why is it them deep sea divers always sit on the side of the boat with them air tanks on their backs, and fall backwards out of the boat?\" Murphy thinks for a minute then says, \"That's easy. It's 'cos if they fell forwards, they'd still be in the friggin boat!\"",
        "likes": "824",
        "dislikes": "562"
    },
    {
        "joke": "Alfie was listening to his sister practice her singing. \"Sis,\" he said, \"I wish you'd sing Christmas carols.\"\r\n\r\n\"Thats nice of you, Alfie,\" she replied, \"but why?\"\r\n\r\nAlfie replied, \"Because then I'd only have to hear your voice once a year!\"",
        "likes": "803",
        "dislikes": "216"
    },
    {
        "joke": "Assistant: \"Sir, can I have a day off next week to visit my mother-in-law?\"",
        "likes": "742",
        "dislikes": "241"
    },
    {
        "joke": "It’s a sunny morning in the Big Forest and the Bear family is just waking up. Baby Bear goes downstairs and sits in his small chair at the table. He looks into his small bowl. It is empty! \"Who's been eating my porridge?\" he squeaks. Father Bear arrives at the table and sits in his big chair. He looks into his big bowl. It is also empty! \"Who's been eating my porridge?\" he roars.  Mother Bear sticks her head out the kitchen door and yells, \"For Pete's sake, how many times do we have to go through this? It was Mother Bear who go up first. It was Mother Bear who woke everybody else in the house up. It was Mother Bear who unloaded the dishwasher from last night and put everything away. It was Mother Bear who went out into the cold early morning air to fetch the newspaper. It was Mother Bear who set the table. It was Mother Bear who put the cat out, cleaned the litter box and filled the cat's water and food dish. And now that you've decided to come down stairs and grace me with your presence, listen good because I'm only going to say this one more time: I haven't made the f*cking porridge yet!\"",
        "likes": "721",
        "dislikes": "287"
    },
    {
        "joke": "I wonder what my parents did to fight boredom before the internet. I asked my 17 brothers and sisters and they didn't know either.",
        "likes": "680",
        "dislikes": "365"
    },
    {
        "joke": "A man tells his wife, \"Honey, your mom fell down the stairs 15 minutes ago.\" The wife yells at him, \"Why are you just telling me now?\" He said, \"Because I couldn't stop laughing.\"",
        "likes": "668",
        "dislikes": "204"
    },
    {
        "joke": "A man called his child's doctor, \"Hello! My son just snatched my pen when I was writing and swallowed it. What should I do?\" The doctor replied, \"Until I can come over, write with another pen.\"",
        "likes": "656",
        "dislikes": "606"
    },
    {
        "joke": "Q: Why are hairdressers never late for work?",
        "likes": "653",
        "dislikes": "281"
    },
    {
        "joke": "Son: \"Dad, when will I be old enough so I don't have to ask mom for her permission to go out?\"",
        "likes": "644",
        "dislikes": "276"
    },
    {
        "joke": "Q.  What can you give and keep at the same time?",
        "likes": "623",
        "dislikes": "616"
    },
    {
        "joke": "A 7 year-old and a 4 year-old are in their bedroom. \"You know what?\" says the 7 year-old, \"I think it's time we started swearing. When we go downstairs for breakfast, I'll swear first, then you.\" \"Okay,\" replies the 4 year-old. In the kitchen, when the mother asks the 7 year-old what he wants for breakfast, he answers, \"I'll have Coco Pops, bitch.\" *WHACK* He goes flying out of his chair, crying his eyes out. The mother looks at the 4 year-old & sternly asks, \"And what do you want?\" \"Dunno,\" he replies, \"But it won't be fucking Coco Pops.\"",
        "likes": "623",
        "dislikes": "226"
    },
    {
        "joke": "I want to die peacefully in my sleep, like my grandfather. Not screaming and yelling like the passengers in his car.",
        "likes": "622",
        "dislikes": "240"
    },
    {
        "joke": "A husband and wife have four boys. The odd part of it is that the older three have red hair, light skin, and are tall, while the youngest son has black hair, dark eyes, and is short. \r\n\r\nThe father eventually takes ill and is lying on his deathbed when he turns to his wife and says, \"Honey, before I die, be completely honest with me. Is our youngest son my child?\" \r\n\r\nThe wife replies, \"I swear on everything that's holy that he is your son.\" With that, the husband passes away. The wife then mutters, \"Thank God he didn't ask about the other three.\"",
        "likes": "591",
        "dislikes": "121"
    },
    {
        "joke": "Q.  What's a shark's favorite sandwich?",
        "likes": "578",
        "dislikes": "606"
    },
    {
        "joke": "A mom and a son come home from the grocery store. The boy immediately empties out a box of animal crackers and the mom asks him why. The boy says, \"You should not eat it if the seal is broken, so I'm looking for the seal.\"",
        "likes": "569",
        "dislikes": "277"
    },
    {
        "joke": "Q.  Why did the apple run away?",
        "likes": "556",
        "dislikes": "425"
    },
    {
        "joke": "A doctor tells an old couple at his office he needs to get a stool sample, a urine sample, and a blood test from the old man. Hard of hearing, the old man asks his wife what the doctor said. The wife replies, \"He needs a pair of your underwear.\"",
        "likes": "546",
        "dislikes": "294"
    },
    {
        "joke": "Three brothers wanted to give their blind mom a birthday gift. The first got her a big beautiful house. The second got her a brand new luxury vehicle with a driver. The third got her a talking parrot to keep her company. When they all got together, they wanted to know which gift she liked best. She said they were all great but she thanked her third son because she liked the chicken dinner best.",
        "likes": "546",
        "dislikes": "219"
    }
]